diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
//==============================================================================================================================
#ifndef STM32F10x_V01_H
#define STM32F10x_V01_H
//==============================================================================================================================
#include "APP_Common_V01.h"
#include "UG_Common_V01.h"
//==============================================================================================================================
//STM32F10X_V01 program library, which  whatever the chips and the pdf datasheets
//The LIB can fastest edit and run and boot user program,and ensure no error in user program,run speed has nothing with progsize
//The LIB has highest run efficiency and fastest respond speed, the programmer must learned LDY program theory
//The LIB be Maked only by LDY at whole world
//by LDY, 2019/04/25,QQ:184324486 ,MB:18377381136
//==============================================================================================================================
//2 bit for BOOT MODE:B(x0)=Main flash memory(BOOT1 use as IO),B(01)=System memory,B(11)=Embedded SRAM
//M3 Flash:
//代码(0.5G):0x00000000-0x1fffffff
//SRAM(0.5G):0x20000000-0x3fffffff
//SRAM_bitband:0x22000000-0x23ffffff
//外设(0.5G):0x40000000-0x5fffffff
//外设bitband:0x42000000-0x43ffffff
//外部RAM(1GB):0x60000000-0x7fffffff,0x80000000-0x9fffffff
//外部设备(1GB):0xA0000000-0xBfffffff,0xC0000000-0xDfffffff
//专用外设总线:0xE0000000-0xE00FFFFF
//系统:0xE0100000-0xffffffff
//CAN与USB1不能同时共用
//==============================================================================================================================
#define CPUType_F100X4  0//LD
#define CPUType_F100X6  1//LD
#define CPUType_F100X8  2//LD
#define CPUType_F100XB  3//MD
#define CPUType_F101X4  4//LD
#define CPUType_F101X6  5//LD
#define CPUType_F101XC  6//HD
#define CPUType_F101XD  7//HD
#define CPUType_F101XE  8//HD
#define CPUType_F102X4  9//LD
#define CPUType_F102X6  10//LD
#define CPUType_F102X8  11//MD
#define CPUType_F102XB  12//MD
#define CPUType_F103X4  13//LD
#define CPUType_F103X6  14//LD
#define CPUType_F103X8  15//MD
#define CPUType_F103XB  16//MD
#define CPUType_F103XC  17//HD
#define CPUType_F103XD  18//HD
#define CPUType_F103XE  19//HD,FLASH=256-512K,SRAM=64K
#define CPUType_F105XX  20//CL
#define CPUType_F107XX  21//CL
#define CPUType         CPUType_F103XB
#define IsCPUType(name) (CPUType==CPUType_##name)
//==============================================================================================================================
#define Density_LD      0//16-32k
#define Density_LD_VL   1//16-32k
#define Density_MD      2//64-128k
#define Density_MD_VL   3//64-128k
#define Density_HD      4//256-512k
#define Density_HD_VL   5//256-512k
#define Density_XL      6//512-1024k
#define Density_CL      7//STM32F105xx,STM32F107xx
#define Density         Density_MD  
#define IsDensity(name) (Density==Density_##name)
#if Density>7
 #error "Please select first the target STM32F10x device used in your application (in STM32F10X_V01.h file)"
#endif
//==============================================================================================================================
//Bank1-NOR/PSRAM,4 sectors,bit27_26=sector index,bit25_0=address
#define BASE_FSMC_BANK1S0_START 0x60000000
#define BASE_FSMC_BANK1S0_END   0x63FFFFFF
#define BASE_FSMC_BANK1S1_START 0x64000000
#define BASE_FSMC_BANK1S1_END   0x67FFFFFF
#define BASE_FSMC_BANK1S2_START 0x68000000
#define BASE_FSMC_BANK1S2_END   0x6BFFFFFF
#define BASE_FSMC_BANK1S3_START 0x6C000000
#define BASE_FSMC_BANK1S3_END   0x6FFFFFFF
#define BASE_FSMC_BANK1_CH(i)   (0x60000000|(i<<26))//i=0_3=sector index
//RS PIN,数据命令区分线
#define BASE_FSMC_BANK1RS_A0    ((1<<1)-2)
#define BASE_FSMC_BANK1RS_A1    ((1<<2)-2)
#define BASE_FSMC_BANK1RS_A2    ((1<<3)-2)
#define BASE_FSMC_BANK1RS_A3    ((1<<4)-2)
#define BASE_FSMC_BANK1RS_A4    ((1<<5)-2)
#define BASE_FSMC_BANK1RS_A5    ((1<<6)-2)
#define BASE_FSMC_BANK1RS_A6    ((1<<7)-2)
#define BASE_FSMC_BANK1RS_A7    ((1<<8)-2)
#define BASE_FSMC_BANK1RS_A8    ((1<<9)-2)
#define BASE_FSMC_BANK1RS_A9    ((1<<10)-2)
#define BASE_FSMC_BANK1RS_A10   ((1<<11)-2)
#define BASE_FSMC_BANK1RS_A11   ((1<<12)-2)
#define BASE_FSMC_BANK1RS_A12   ((1<<13)-2)
#define BASE_FSMC_BANK1RS_A13   ((1<<14)-2)
#define BASE_FSMC_BANK1RS_A14   ((1<<15)-2)
#define BASE_FSMC_BANK1RS_A15   ((1<<16)-2)
#define BASE_FSMC_BANK1RS_A16   ((1<<17)-2)
#define BASE_FSMC_BANK1RS_A17   ((1<<18)-2)
#define BASE_FSMC_BANK1RS_A18   ((1<<19)-2)
#define BASE_FSMC_BANK1RS_A19   ((1<<20)-2)
#define BASE_FSMC_BANK1RS_A20   ((1<<21)-2)
#define BASE_FSMC_BANK1RS_A21   ((1<<22)-2)
#define BASE_FSMC_BANK1RS_A22   ((1<<23)-2)
#define BASE_FSMC_BANK1RS_A23   ((1<<24)-2)
#define BASE_FSMC_BANK1RS_A24   ((1<<25)-2)
#define BASE_FSMC_BANK1RS_A25   ((1<<26)-2)
#define BASE_FSMC_BANK1RS_A(i)  ((1<<(i+1))-2)//i=0_25=RS PIN Index
//Bank2-NAND FLASH,PATT2(6C),PMEM2(68)
#define BASE_FSMC_BANK2A_START  0x70000000
#define BASE_FSMC_BANK2A_END    0x73FFFFFF
#define BASE_FSMC_BANK2B_START  0x78000000
#define BASE_FSMC_BANK2B_END    0x7BFFFFFF
//Bank3-NAND FLASH,PATT3(8C),PMEM3(88)
#define BASE_FSMC_BANK3A_START  0x80000000
#define BASE_FSMC_BANK3A_END    0x83FFFFFF
#define BASE_FSMC_BANK3B_START  0x88000000
#define BASE_FSMC_BANK3B_END    0x8BFFFFFF
//Bank4-PC CARD,PATT4(AC),PMEM4(A8)
#define BASE_FSMC_BANK4A_START  0x90000000
#define BASE_FSMC_BANK4A_END    0x93FFFFFF
#define BASE_FSMC_BANK4B_START  0x98000000
#define BASE_FSMC_BANK4B_END    0x9BFFFFFF
//Bank4-PC CARD,PIO4(B0)
#define BASE_FSMC_BANK4C_START  0x9C000000
#define BASE_FSMC_BANK4C_END    0x9FFFFFFF
//LCD
#define LCD_CH                  0x00
#define LCD_RS                  0x10
#if     LCD_RS
#define BASE_LCD                ((BASE_FSMC_BANK1_CH(LCD_CH)|BASE_FSMC_BANK1RS_A(LCD_RS))-2)//align 4 bytes
#else   
#define BASE_LCD                BASE_FSMC_BANK1_CH(LCD_CH)
#endif
//==============================================================================================================================
#define SIZE_FLASHPAGE          0x00000400//1k
#define BASE_FLASH              0x08000000//FLASH base address in the alias region,128页，每页1K
#define SIZE_FLASH              0x00020000//128K
#define BASE_SYSMEM             0x1FFFF000
#define SIZE_SYSMEM             0x00000800
#define BASE_OB                 0x1FFFF800//Flash Option Bytes base address
#define SIZE_OB                 0x00000010
#define BASE_DES                0x1FFFF7E0//Device electronic signature
#define BASE_SRAM               0x20000000//SRAM base address in the alias region
#define BASE_PERIPH             0x40000000//Peripheral base address in the alias region
#define BASE_USBFS              0x50000000//USB2.0 OTG
#define BASE_SRAM_BB            0x22000000//SRAM base address in the bit-band region
#define BASE_PERIPH_BB          0x42000000//Peripheral base address in the bit-band region
#define BASE_FSMC               0xA0000000//FSMC registers base address

#define BASE_APP                BASE_FLASH
#define BASE_DEVICE             (BASE_APP+0x00001000) //DEVICE Property
#define BASE_UG                 (BASE_FLASH+0x18000)
#define UG_BASE_DEVICE          (BASE_UG+0x00001000) //DEVICE Property
//------------------------------------------------------------------------------------------------------------------------------
#define BASE_ITM                0xE0000000//M3 ITM Base Address
#define BASE_DWT                0xE0001000//DWT,观察点和触发
#define BASE_FPB                0xE0002000//FLASH repair,修补
#define BASE_TPI                0xE0040000//跟踪端口接口单元
#define BASE_ETM                0xE0041000//ETM,嵌入式跟踪宏单元
#define BASE_DBG                0xE0042000//Debug MCU registers base address

#define BASE_SCS                0xE000E000//M3 System Control Space Base Address
#define BASE_SYS                BASE_SCS
#define BASE_SYSTICK            0xE000E010//CM3 SYSTICK
#define BASE_NVIC               0xE000E100//CM3 NVIC
#define BASE_SCB                0xE000ED00//CM3 SCB
#define BASE_MPU                0xE000ED90//CM3 MPU
#define BASE_CDB                0xE000EDF0//CM3 Debug Base Address
#define BASE_TAB                0xE00FF000//CM3 Default RAM Table Values
//------------------------------------------------------------------------------------------------------------------------------
//Peripheral memory map
#define BASE_USBFS_DATAFIFO     BASE_USBFS+0x1000
#define SIZE_USBFS_DATAFIFO     0x1000

