diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define BASE_APB1PERIPH         BASE_PERIPH
#define BASE_APB2PERIPH         (BASE_PERIPH + 0x10000)
#define BASE_AHBPERIPH          (BASE_PERIPH + 0x20000)
#define BASE_TIM2               (BASE_APB1PERIPH + 0x0000)
#define BASE_TIM3               (BASE_APB1PERIPH + 0x0400)
#define BASE_TIM4               (BASE_APB1PERIPH + 0x0800)
#define BASE_TIM5               (BASE_APB1PERIPH + 0x0C00)
#define BASE_TIM6               (BASE_APB1PERIPH + 0x1000)
#define BASE_TIM7               (BASE_APB1PERIPH + 0x1400)
#define BASE_TIM12              (BASE_APB1PERIPH + 0x1800)
#define BASE_TIM13              (BASE_APB1PERIPH + 0x1C00)
#define BASE_TIM14              (BASE_APB1PERIPH + 0x2000)
#define BASE_RTC                (BASE_APB1PERIPH + 0x2800)
#define BASE_WWDG               (BASE_APB1PERIPH + 0x2C00)
#define BASE_IWDG               (BASE_APB1PERIPH + 0x3000)
#define BASE_SPI2               (BASE_APB1PERIPH + 0x3800)
#define BASE_SPI3               (BASE_APB1PERIPH + 0x3C00)
#define BASE_UART2              (BASE_APB1PERIPH + 0x4400)
#define BASE_UART3              (BASE_APB1PERIPH + 0x4800)
#define BASE_UART4              (BASE_APB1PERIPH + 0x4C00)
#define BASE_UART5              (BASE_APB1PERIPH + 0x5000)
#define BASE_I2C1               (BASE_APB1PERIPH + 0x5400)
#define BASE_I2C2               (BASE_APB1PERIPH + 0x5800)
#define BASE_I2C(i)             (BASE_I2C1+i*0x400)
#define BASE_USB                (BASE_APB1PERIPH + 0x5C00)
#define BASE_USBRAM             (BASE_APB1PERIPH + 0x6000)
#define BASE_CAN1               (BASE_APB1PERIPH + 0x6400)
#define BASE_CAN2               (BASE_APB1PERIPH + 0x6800)
#define BASE_CAN(i)             (BASE_CAN1+i*0x400)
#define BASE_BKP                (BASE_APB1PERIPH + 0x6C00)
#define BASE_PWR                (BASE_APB1PERIPH + 0x7000)
#define BASE_DAC                (BASE_APB1PERIPH + 0x7400)
#define BASE_CEC                (BASE_APB1PERIPH + 0x7800)
//------------------------------------------------------------------------------------------------------------------------------
#define BASE_AFIO               (BASE_APB2PERIPH + 0x0000)
#define BASE_EXTI               (BASE_APB2PERIPH + 0x0400)
#define BASE_GPIOA              (BASE_APB2PERIPH + 0x0800)
#define BASE_GPIOB              (BASE_APB2PERIPH + 0x0C00)
#define BASE_GPIOC              (BASE_APB2PERIPH + 0x1000)
#define BASE_GPIOD              (BASE_APB2PERIPH + 0x1400)
#define BASE_GPIOE              (BASE_APB2PERIPH + 0x1800)
#define BASE_GPIOF              (BASE_APB2PERIPH + 0x1C00)
#define BASE_GPIOG              (BASE_APB2PERIPH + 0x2000)
#define BASE_GPIO(i)            (BASE_GPIOA+i*0x400)
#define BASE_ADC1               (BASE_APB2PERIPH + 0x2400)
#define BASE_ADC2               (BASE_APB2PERIPH + 0x2800)
#define BASE_TIM1               (BASE_APB2PERIPH + 0x2C00)
#define BASE_SPI1               (BASE_APB2PERIPH + 0x3000)
#define BASE_TIM8               (BASE_APB2PERIPH + 0x3400)
#define BASE_UART1              (BASE_APB2PERIPH + 0x3800)
#define BASE_ADC3               (BASE_APB2PERIPH + 0x3C00)
#define BASE_TIM15              (BASE_APB2PERIPH + 0x4000)
#define BASE_TIM16              (BASE_APB2PERIPH + 0x4400)
#define BASE_TIM17              (BASE_APB2PERIPH + 0x4800)
#define BASE_TIM9               (BASE_APB2PERIPH + 0x4C00)
#define BASE_TIM10              (BASE_APB2PERIPH + 0x5000)
#define BASE_TIM11              (BASE_APB2PERIPH + 0x5400)
#define BASE_SDIO               (BASE_APB2PERIPH + 0x8000)
//------------------------------------------------------------------------------------------------------------------------------
#define BASE_DMA1               (BASE_AHBPERIPH + 0x0000)
#define BASE_DMA1_CH1           (BASE_AHBPERIPH + 0x0008)
#define BASE_DMA1_CH2           (BASE_AHBPERIPH + 0x001C)
#define BASE_DMA1_CH3           (BASE_AHBPERIPH + 0x0030)
#define BASE_DMA1_CH4           (BASE_AHBPERIPH + 0x0044)
#define BASE_DMA1_CH5           (BASE_AHBPERIPH + 0x0058)
#define BASE_DMA1_CH6           (BASE_AHBPERIPH + 0x006C)
#define BASE_DMA1_CH7           (BASE_AHBPERIPH + 0x0080)
#define BASE_DMA2               (BASE_AHBPERIPH + 0x0400)
#define BASE_DMA2_CH1           (BASE_AHBPERIPH + 0x0408)
#define BASE_DMA2_CH2           (BASE_AHBPERIPH + 0x041C)
#define BASE_DMA2_CH3           (BASE_AHBPERIPH + 0x0430)
#define BASE_DMA2_CH4           (BASE_AHBPERIPH + 0x0444)
#define BASE_DMA2_CH5           (BASE_AHBPERIPH + 0x0458)
#define BASE_DMA(i)             (BASE_DMA1+i*0x400)
#define BASE_RCC                (BASE_AHBPERIPH + 0x1000)
#define BASE_FLASHR             (BASE_AHBPERIPH + 0x2000) //Flash registers base address
#define BASE_CRC                (BASE_AHBPERIPH + 0x3000)

#define BASE_ETH                (BASE_AHBPERIPH + 0x8000)
#define BASE_ETH_MAC            (BASE_ETH)
#define BASE_ETH_MMC            (BASE_ETH + 0x0100)
#define BASE_ETH_PTP            (BASE_ETH + 0x0700)
#define BASE_ETH_DMA            (BASE_ETH + 0x1000)

#define BASE_FSMC_Bank1         (BASE_FSMC + 0x0000) //FSMC Bank1 registers base address
#define BASE_FSMC_Bank2         (BASE_FSMC + 0x0060) //FSMC Bank2 registers base address
#define BASE_FSMC_Bank3         (BASE_FSMC + 0x0080) //FSMC Bank3 registers base address
#define BASE_FSMC_Bank4         (BASE_FSMC + 0x00A0) //FSMC Bank4 registers base address
#define BASE_FSMC_Bank1E        (BASE_FSMC + 0x0104) //FSMC Bank1E registers base address
//------------------------------------------------------------------------------------------------------------------------------
//Cortex-M3 Processor Exceptions Numbers
#define IRQN_NonMaskableInt        -14  //2 Non Maskable Interrupt
#define IRQN_MemoryManagement      -12  //4 Cortex-M3 Memory Management Interrupt
#define IRQN_BusFault              -11  //5 Cortex-M3 Bus Fault Interrupt
#define IRQN_UsageFault            -10  //6 Cortex-M3 Usage Fault Interrupt
#define IRQN_SVCall                -5   //11 Cortex-M3 SV Call Interrupt
#define IRQN_DebugMonitor          -4   //12 Cortex-M3 Debug Monitor Interrupt
#define IRQN_PendSV                -2   //14 Cortex-M3 Pend SV Interrupt
#define IRQN_SysTick               -1   //15 Cortex-M3 System Tick Interrupt
//STM32 specific Interrupt Numbers
#define IRQN_WWDG                  0    //Window WatchDog Interrupt
#define IRQN_PVD                   1    //PVD through EXTI Line detection Interrupt
#define IRQN_TAMPER                2    //Tamper Interrupt
#define IRQN_RTC                   3    //RTC global Interrupt
#define IRQN_FLASH                 4    //FLASH global Interrupt
#define IRQN_RCC                   5    //RCC global Interrupt
#define IRQN_EXTI0                 6    //EXTI Line0 Interrupt
#define IRQN_EXTI1                 7    //EXTI Line1 Interrupt
#define IRQN_EXTI2                 8    //EXTI Line2 Interrupt
#define IRQN_EXTI3                 9    //EXTI Line3 Interrupt
#define IRQN_EXTI4                 10   //EXTI Line4 Interrupt
#define IRQN_DMA1_CH1              11   //DMA1 Channel 1 global Interrupt
#define IRQN_DMA1_CH2              12   //DMA1 Channel 2 global Interrupt
#define IRQN_DMA1_CH3              13   //DMA1 Channel 3 global Interrupt
#define IRQN_DMA1_CH4              14   //DMA1 Channel 4 global Interrupt
#define IRQN_DMA1_CH5              15   //DMA1 Channel 5 global Interrupt
#define IRQN_DMA1_CH6              16   //DMA1 Channel 6 global Interrupt
#define IRQN_DMA1_CH7              17   //DMA1 Channel 7 global Interrupt

#if IsDensity(LD)
#define IRQN_ADC12                 18   //ADC1 and ADC2 global Interrupt
#define IRQN_USB1HP_CAN1TX         19   //USB1 Device High Priority or CAN1 TX Interrupts
#define IRQN_USB1LP_CAN1RX0        20   //USB1 Device Low Priority or CAN1 RX0 Interrupts
#define IRQN_CAN1_RX1              21   //CAN1 RX1 Interrupt
#define IRQN_CAN1_SCE              22   //CAN1 SCE Interrupt
#define IRQN_EXTI9_5               23   //External Line[9:5] Interrupts
#define IRQN_TIM1_BRK              24   //TIM1 Break Interrupt
#define IRQN_TIM1_UP               25   //TIM1 Update Interrupt
#define IRQN_TIM1_TRGCOM           26   //TIM1 Trigger and Commutation Interrupt
#define IRQN_TIM1_CCn              27   //TIM1 Capture Compare Interrupt
#define IRQN_TIM2                  28   //TIM2 global Interrupt
#define IRQN_TIM3                  29   //TIM3 global Interrupt
#define IRQN_I2C1_EV               31   //I2C1 Event Interrupt
#define IRQN_I2C1_ER               32   //I2C1 Error Interrupt
#define IRQN_SPI1                  35   //SPI1 global Interrupt
#define IRQN_USART1                37   //USART1 global Interrupt
#define IRQN_USART2                38   //USART2 global Interrupt
#define IRQN_EXTI15_10             40   //External Line[15:10] Interrupts
#define IRQN_RTCAlarm              41   //RTC Alarm through EXTI Line Interrupt
#define IRQN_USBWakeUp             42   //USB Device WakeUp from suspend through EXTI Line Interrupt
#endif

#if IsDensity(LD_VL)
#define IRQN_ADC1                  18   //ADC1 global Interrupt
#define IRQN_EXTI9_5               23   //External Line[9:5] Interrupts
#define IRQN_TIM1_BRK_TIM15        24   //TIM1 Break and TIM15 Interrupts
#define IRQN_TIM1_UP_TIM16         25   //TIM1 Update and TIM16 Interrupts
#define IRQN_TIM1_TRGCOM_TIM17     26   //TIM1 Trigger and Commutation and TIM17 Interrupt
#define IRQN_TIM1_CC               27   //TIM1 Capture Compare Interrupt
#define IRQN_TIM2                  28   //TIM2 global Interrupt
#define IRQN_TIM3                  29   //TIM3 global Interrupt
#define IRQN_I2C1_EV               31   //I2C1 Event Interrupt
#define IRQN_I2C1_ER               32   //I2C1 Error Interrupt
#define IRQN_SPI1                  35   //SPI1 global Interrupt
#define IRQN_USART1                37   //USART1 global Interrupt
#define IRQN_USART2                38   //USART2 global Interrupt
#define IRQN_EXTI15_10             40   //External Line[15:10] Interrupts
#define IRQN_RTCAlarm              41   //RTC Alarm through EXTI Line Interrupt
#define IRQN_CEC                   42   //HDMI-CEC Interrupt
#define IRQN_TIM6_DAC              54   //TIM6 and DAC underrun Interrupt
#define IRQN_TIM7                  55   //TIM7 Interrupt
#endif //LD_VL

