diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#if IsDensity(MD)
  #define IRQN_ADC12               18   //ADC1 and ADC2 global Interrupt
  #define IRQN_USB1HP_CAN1TX       19   //USB1 Device High Priority or CAN1 TX Interrupts
  #define IRQN_USB1LP_CAN1RX0      20   //USB1 Device Low Priority or CAN1 RX0 Interrupts
  #define IRQN_CAN1RX1             21   //CAN1 RX1 Interrupt
  #define IRQN_CAN1SCE             22   //CAN1 SCE Interrupt
  #define IRQN_EXTI9_5             23   //External Line[9:5] Interrupts
  #define IRQN_TIM1_BRK            24   //TIM1 Break Interrupt
  #define IRQN_TIM1_UP             25   //TIM1 Update Interrupt
  #define IRQN_TIM1_TRGCOM         26   //TIM1 Trigger and Commutation Interrupt
  #define IRQN_TIM1_CC             27   //TIM1 Capture Compare Interrupt
  #define IRQN_TIM2                28   //TIM2 global Interrupt
  #define IRQN_TIM3                29   //TIM3 global Interrupt
  #define IRQN_TIM4                30   //TIM4 global Interrupt
  #define IRQN_I2C1_EV             31   //I2C1 Event Interrupt
  #define IRQN_I2C1_ER             32   //I2C1 Error Interrupt
  #define IRQN_I2C2_EV             33   //I2C2 Event Interrupt
  #define IRQN_I2C2_ER             34   //I2C2 Error Interrupt
  #define IRQN_SPI1                35   //SPI1 global Interrupt
  #define IRQN_SPI2                36   //SPI2 global Interrupt
  #define IRQN_USART1              37   //USART1 global Interrupt
  #define IRQN_USART2              38   //USART2 global Interrupt
  #define IRQN_USART3              39   //USART3 global Interrupt
  #define IRQN_EXTI15_10           40   //External Line[15:10] Interrupts
  #define IRQN_RTCAlarm            41   //RTC Alarm through EXTI Line Interrupt
  #define IRQN_USBWakeUp           42   //USB Device WakeUp from suspend through EXTI Line Interrupt
#endif //MD  

#if IsDensity(MD_VL)
  #define IRQN_ADC1                18   //ADC1 global Interrupt
  #define IRQN_EXTI9_5             23   //External Line[9:5] Interrupts
  #define IRQN_TIM1_BRK_TIM15n     24   //TIM1 Break and TIM15 Interrupts
  #define IRQN_TIM1_UP_TIM16       25   //TIM1 Update and TIM16 Interrupts
  #define IRQN_TIM1_TRGCOM_TIM17   26   //TIM1 Trigger and Commutation and TIM17 Interrupt
  #define IRQN_TIM1_CC             27   //TIM1 Capture Compare Interrupt
  #define IRQN_TIM2                28   //TIM2 global Interrupt
  #define IRQN_TIM3                29   //TIM3 global Interrupt
  #define IRQN_TIM4                30   //TIM4 global Interrupt
  #define IRQN_I2C1_EV             31   //I2C1 Event Interrupt
  #define IRQN_I2C1_ER             32   //I2C1 Error Interrupt
  #define IRQN_I2C2_EV             33   //I2C2 Event Interrupt
  #define IRQN_I2C2_ER             34   //I2C2 Error Interrupt
  #define IRQN_SPI1                35   //SPI1 global Interrupt
  #define IRQN_SPI2                36   //SPI2 global Interrupt
  #define IRQN_USART1              37   //USART1 global Interrupt
  #define IRQN_USART2              38   //USART2 global Interrupt
  #define IRQN_USART3              39   //USART3 global Interrupt
  #define IRQN_EXTI15_10           40   //External Line[15:10] Interrupts
  #define IRQN_RTCAlarm            41   //RTC Alarm through EXTI Line Interrupt
  #define IRQN_CEC                 42   //HDMI-CEC Interrupt
  #define IRQN_TIM6_DAC            54   //TIM6 and DAC underrun Interrupt
  #define IRQN_TIM7                55   //TIM7 Interrupt
#endif //MD_VL

#if IsDensity(HD)
  #define IRQN_ADC12               18   //ADC1 and ADC2 global Interrupt
  #define IRQN_USB1HP_CAN1TX       19   //USB1 Device High Priority or CAN1 TX Interrupts
  #define IRQN_USB1LP_CAN1RX0      20   //USB1 Device Low Priority or CAN1 RX0 Interrupts
  #define IRQN_CAN1RX1             21   //CAN1 RX1 Interrupt
  #define IRQN_CAN1SCE             22   //CAN1 SCE Interrupt
  #define IRQN_EXTI9_5             23   //External Line[9:5] Interrupts
  #define IRQN_TIM1_BRK            24   //TIM1 Break Interrupt
  #define IRQN_TIM1_UP             25   //TIM1 Update Interrupt
  #define IRQN_TIM1_TRGCOM         26   //TIM1 Trigger and Commutation Interrupt
  #define IRQN_TIM1_CC             27   //TIM1 Capture Compare Interrupt
  #define IRQN_TIM2                28   //TIM2 global Interrupt
  #define IRQN_TIM3                29   //TIM3 global Interrupt
  #define IRQN_TIM4                30   //TIM4 global Interrupt
  #define IRQN_I2C1_EV             31   //I2C1 Event Interrupt
  #define IRQN_I2C1_ER             32   //I2C1 Error Interrupt
  #define IRQN_I2C2_EV             33   //I2C2 Event Interrupt
  #define IRQN_I2C2_ER             34   //I2C2 Error Interrupt
  #define IRQN_SPI1                35   //SPI1 global Interrupt
  #define IRQN_SPI2                36   //SPI2 global Interrupt
  #define IRQN_USART1              37   //USART1 global Interrupt
  #define IRQN_USART2              38   //USART2 global Interrupt
  #define IRQN_USART3              39   //USART3 global Interrupt
  #define IRQN_EXTI15_10           40   //External Line[15:10] Interrupts
  #define IRQN_RTCAlarm            41   //RTC Alarm through EXTI Line Interrupt
  #define IRQN_USBWakeUp           42   //USB Device WakeUp from suspend through EXTI Line Interrupt
  #define IRQN_TIM8_BRK            43   //TIM8 Break Interrupt
  #define IRQN_TIM8_UP             44   //TIM8 Update Interrupt
  #define IRQN_TIM8_TRGCOM         45   //TIM8 Trigger and Commutation Interrupt
  #define IRQN_TIM8_CC             46   //TIM8 Capture Compare Interrupt
  #define IRQN_ADC3                47   //ADC3 global Interrupt
  #define IRQN_FSMC                48   //FSMC global Interrupt
  #define IRQN_SDIO                49   //SDIO global Interrupt
  #define IRQN_TIM5                50   //TIM5 global Interrupt
  #define IRQN_SPI3                51   //SPI3 global Interrupt
  #define IRQN_UART4               52   //UART4 global Interrupt
  #define IRQN_UART5               53   //UART5 global Interrupt
  #define IRQN_TIM6                54   //TIM6 global Interrupt
  #define IRQN_TIM7                55   //TIM7 global Interrupt
  #define IRQN_DMA2_CH1            56   //DMA2 Channel 1 global Interrupt
  #define IRQN_DMA2_CH2            57   //DMA2 Channel 2 global Interrupt
  #define IRQN_DMA2_CH3            58   //DMA2 Channel 3 global Interrupt
  #define IRQN_DMA2_CH45           59   //DMA2 Channel 4 and Channel 5 global Interrupt
#endif

