diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#if IsDensity(HD_VL)
  #define IRQN_ADC1                18   //ADC1 global Interrupt
  #define IRQN_EXTI9_5             23   //External Line[9:5] Interrupts
  #define IRQN_TIM1_BRK_TIM15      24   //TIM1 Break and TIM15 Interrupts
  #define IRQN_TIM1_UP_TIM16       25   //TIM1 Update and TIM16 Interrupts
  #define IRQN_TIM1_TRGCOM_TIM17   26   //TIM1 Trigger and Commutation and TIM17 Interrupt
  #define IRQN_TIM1_CC             27   //TIM1 Capture Compare Interrupt
  #define IRQN_TIM2                28   //TIM2 global Interrupt
  #define IRQN_TIM3                29   //TIM3 global Interrupt
  #define IRQN_TIM4                30   //TIM4 global Interrupt
  #define IRQN_I2C1_EV             31   //I2C1 Event Interrupt
  #define IRQN_I2C1_ER             32   //I2C1 Error Interrupt
  #define IRQN_I2C2_EV             33   //I2C2 Event Interrupt
  #define IRQN_I2C2_ER             34   //I2C2 Error Interrupt
  #define IRQN_SPI1                35   //SPI1 global Interrupt
  #define IRQN_SPI2                36   //SPI2 global Interrupt
  #define IRQN_USART1              37   //USART1 global Interrupt
  #define IRQN_USART2              38   //USART2 global Interrupt
  #define IRQN_USART3              39   //USART3 global Interrupt
  #define IRQN_EXTI15_10           40   //External Line[15:10] Interrupts
  #define IRQN_RTCAlarm            41   //RTC Alarm through EXTI Line Interrupt
  #define IRQN_CEC                 42   //HDMI-CEC Interrupt
  #define IRQN_TIM12               43   //TIM12 global Interrupt
  #define IRQN_TIM13               44   //TIM13 global Interrupt
  #define IRQN_TIM14               45   //TIM14 global Interrupt
  #define IRQN_TIM5                50   //TIM5 global Interrupt
  #define IRQN_SPI3                51   //SPI3 global Interrupt
  #define IRQN_UART4               52   //UART4 global Interrupt
  #define IRQN_UART5               53   //UART5 global Interrupt
  #define IRQN_TIM6_DAC            54   //TIM6 and DAC underrun Interrupt
  #define IRQN_TIM7                55   //TIM7 Interrupt
  #define IRQN_DMA2_CH1            56   //DMA2 Channel 1 global Interrupt
  #define IRQN_DMA2_CH2            57   //DMA2 Channel 2 global Interrupt
  #define IRQN_DMA2_CH3            58   //DMA2 Channel 3 global Interrupt
  #define IRQN_DMA2_CH45           59   //DMA2 Channel 4 and Channel 5 global Interrupt
  #define IRQN_DMA2_CH5            60   //DMA2 Channel 5 global Interrupt (DMA2 Channel 5 is\
                                             mapped at position 60 only if the MISC_REMAP bit in \
                                             the AFIO_MAPR2 register is set)
#endif

#if IsDensity(XL)
  #define IRQN_ADC12               18   //ADC1 and ADC2 global Interrupt
  #define IRQN_USB1HP_CAN1TX       19   //USB1 Device High Priority or CAN1 TX Interrupts
  #define IRQN_USB1LP_CAN1RX0      20   //USB1 Device Low Priority or CAN1 RX0 Interrupts
  #define IRQN_CAN1RX1             21   //CAN1 RX1 Interrupt
  #define IRQN_CAN1SCE             22   //CAN1 SCE Interrupt
  #define IRQN_EXTI9_5             23   //External Line[9:5] Interrupts
  #define IRQN_TIM1_BRK_TIM9       24   //TIM1 Break Interrupt and TIM9 global Interrupt
  #define IRQN_TIM1_UP_TIM10       25   //TIM1 Update Interrupt and TIM10 global Interrupt
  #define IRQN_TIM1_TRGCOM_TIM11   26   //TIM1 Trigger and Commutation Interrupt and TIM11 global interrupt
  #define IRQN_TIM1_CC             27   //TIM1 Capture Compare Interrupt
  #define IRQN_TIM2                28   //TIM2 global Interrupt
  #define IRQN_TIM3                29   //TIM3 global Interrupt
  #define IRQN_TIM4                30   //TIM4 global Interrupt
  #define IRQN_I2C1_EV             31   //I2C1 Event Interrupt
  #define IRQN_I2C1_ER             32   //I2C1 Error Interrupt
  #define IRQN_I2C2_EV             33   //I2C2 Event Interrupt
  #define IRQN_I2C2_ER             34   //I2C2 Error Interrupt
  #define IRQN_SPI1                35   //SPI1 global Interrupt
  #define IRQN_SPI2                36   //SPI2 global Interrupt
  #define IRQN_USART1              37   //USART1 global Interrupt
  #define IRQN_USART2              38   //USART2 global Interrupt
  #define IRQN_USART3              39   //USART3 global Interrupt
  #define IRQN_EXTI15_10           40   //External Line[15:10] Interrupts
  #define IRQN_RTCAlarm            41   //RTC Alarm through EXTI Line Interrupt
  #define IRQN_USBWakeUp           42   //USB Device WakeUp from suspend through EXTI Line Interrupt
  #define IRQN_TIM8_BRK_TIM12      43   //TIM8 Break Interrupt and TIM12 global Interrupt
  #define IRQN_TIM8_UP_TIM13       44   //TIM8 Update Interrupt and TIM13 global Interrupt
  #define IRQN_TIM8_TRGCOM_TIM14   45   //TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt
  #define IRQN_TIM8_CC             46   //TIM8 Capture Compare Interrupt
  #define IRQN_ADC3                47   //ADC3 global Interrupt
  #define IRQN_FSMC                48   //FSMC global Interrupt
  #define IRQN_SDIO                49   //SDIO global Interrupt
  #define IRQN_TIM5                50   //TIM5 global Interrupt
  #define IRQN_SPI3                51   //SPI3 global Interrupt
  #define IRQN_UART4               52   //UART4 global Interrupt
  #define IRQN_UART5               53   //UART5 global Interrupt
  #define IRQN_TIM6                54   //TIM6 global Interrupt
  #define IRQN_TIM7                55   //TIM7 global Interrupt
  #define IRQN_DMA2_CH1            56   //DMA2 Channel 1 global Interrupt
  #define IRQN_DMA2_CH2            57   //DMA2 Channel 2 global Interrupt
  #define IRQN_DMA2_CH3            58   //DMA2 Channel 3 global Interrupt
  #define IRQN_DMA2_CH45           59   //DMA2 Channel 4 and Channel 5 global Interrupt
#endif

#if IsDensity(CL)
  #define IRQN_ADC12               18   //ADC1 and ADC2 global Interrupt
  #define IRQN_USB1HP_CAN1TX       19   //USB1 Device High Priority or CAN1 TX Interrupts
  #define IRQN_USB1LP_CAN1RX0      20   //USB1 Device Low Priority or CAN1 RX0 Interrupts
  #define IRQN_CAN1RX1             21   //CAN1 RX1 Interrupt
  #define IRQN_CAN1SCE             22   //CAN1 SCE Interrupt
  #define IRQN_EXTI9_5             23   //External Line[9:5] Interrupts
  #define IRQN_TIM1_BRK            24   //TIM1 Break Interrupt
  #define IRQN_TIM1_UP             25   //TIM1 Update Interrupt
  #define IRQN_TIM1_TRGCOM         26   //TIM1 Trigger and Commutation Interrupt
  #define IRQN_TIM1_CC             27   //TIM1 Capture Compare Interrupt
  #define IRQN_TIM2                28   //TIM2 global Interrupt
  #define IRQN_TIM3                29   //TIM3 global Interrupt
  #define IRQN_TIM4                30   //TIM4 global Interrupt
  #define IRQN_I2C1_EV             31   //I2C1 Event Interrupt
  #define IRQN_I2C1_ER             32   //I2C1 Error Interrupt
  #define IRQN_I2C2_EV             33   //I2C2 Event Interrupt
  #define IRQN_I2C2_ER             34   //I2C2 Error Interrupt
  #define IRQN_SPI1                35   //SPI1 global Interrupt
  #define IRQN_SPI2                36   //SPI2 global Interrupt
  #define IRQN_USART1              37   //USART1 global Interrupt
  #define IRQN_USART2              38   //USART2 global Interrupt
  #define IRQN_USART3              39   //USART3 global Interrupt
  #define IRQN_EXTI15_10           40   //External Line[15:10] Interrupts
  #define IRQN_RTCAlarm            41   //RTC Alarm through EXTI Line Interrupt
  #define IRQN_OTGFS_WKUP          42   //USB OTG FS WakeUp from suspend through EXTI Line Interrupt
  #define IRQN_TIM5                50   //TIM5 global Interrupt
  #define IRQN_SPI3                51   //SPI3 global Interrupt
  #define IRQN_UART4               52   //UART4 global Interrupt
  #define IRQN_UART5               53   //UART5 global Interrupt
  #define IRQN_TIM6                54   //TIM6 global Interrupt
  #define IRQN_TIM7                55   //TIM7 global Interrupt
  #define IRQN_DMA2_CH1            56   //DMA2 Channel 1 global Interrupt
  #define IRQN_DMA2_CH2            57   //DMA2 Channel 2 global Interrupt
  #define IRQN_DMA2_CH3            58   //DMA2 Channel 3 global Interrupt
  #define IRQN_DMA2_CH4            59   //DMA2 Channel 4 global Interrupt
  #define IRQN_DMA2_CH5            60   //DMA2 Channel 5 global Interrupt
  #define IRQN_ETH                 61   //Ethernet global Interrupt
  #define IRQN_ETH_WKUP            62   //Ethernet Wakeup through EXTI line Interrupt
  #define IRQN_CAN2_TX             63   //CAN2 TX Interrupt
  #define IRQN_CAN2_RX0            64   //CAN2 RX0 Interrupt
  #define IRQN_CAN2_RX1            65   //CAN2 RX1 Interrupt
  #define IRQN_CAN2_SCE            66   //CAN2 SCE Interrupt
  #define IRQN_OTGFS               67   //USB OTG FS global Interrupt
#endif
//------------------------------------------------------------------------------------------------------------------------------
typedef enum Enum_IRQN
{
//Cortex-M3 Processor Exceptions Numbers
  NonMaskableInt_IRQn         = -14,    //2 Non Maskable Interrupt
  MemoryManagement_IRQn       = -12,    //4 Cortex-M3 Memory Management Interrupt
  BusFault_IRQn               = -11,    //5 Cortex-M3 Bus Fault Interrupt
  UsageFault_IRQn             = -10,    //6 Cortex-M3 Usage Fault Interrupt
  SVCall_IRQn                 = -5,     //11 Cortex-M3 SV Call Interrupt
  DebugMonitor_IRQn           = -4,     //12 Cortex-M3 Debug Monitor Interrupt
  PendSV_IRQn                 = -2,     //14 Cortex-M3 Pend SV Interrupt
  SysTick_IRQn                = -1,     //15 Cortex-M3 System Tick Interrupt

//STM32 specific Interrupt Numbers
  WWDG_IRQn                   = 0,      //Window WatchDog Interrupt
  PVD_IRQn                    = 1,      //PVD through EXTI Line detection Interrupt
  TAMPER_IRQn                 = 2,      //Tamper Interrupt
  RTC_IRQn                    = 3,      //RTC global Interrupt
  FLASH_IRQn                  = 4,      //FLASH global Interrupt
  RCC_IRQn                    = 5,      //RCC global Interrupt
  EXTI0_IRQn                  = 6,      //EXTI Line0 Interrupt
  EXTI1_IRQn                  = 7,      //EXTI Line1 Interrupt
  EXTI2_IRQn                  = 8,      //EXTI Line2 Interrupt
  EXTI3_IRQn                  = 9,      //EXTI Line3 Interrupt
  EXTI4_IRQn                  = 10,     //EXTI Line4 Interrupt
  DMA1_Channel1_IRQn          = 11,     //DMA1 Channel 1 global Interrupt
  DMA1_Channel2_IRQn          = 12,     //DMA1 Channel 2 global Interrupt
  DMA1_Channel3_IRQn          = 13,     //DMA1 Channel 3 global Interrupt
  DMA1_Channel4_IRQn          = 14,     //DMA1 Channel 4 global Interrupt
  DMA1_Channel5_IRQn          = 15,     //DMA1 Channel 5 global Interrupt
  DMA1_Channel6_IRQn          = 16,     //DMA1 Channel 6 global Interrupt
  DMA1_Channel7_IRQn          = 17,     //DMA1 Channel 7 global Interrupt

#if IsDensity(LD)
  ADC1_2_IRQn                 = 18,     //ADC1 and ADC2 global Interrupt
  USB_HP_CAN1_TX_IRQn         = 19,     //USB Device High Priority or CAN1 TX Interrupts
  USB_LP_CAN1_RX0_IRQn        = 20,     //USB Device Low Priority or CAN1 RX0 Interrupts
  CAN1_RX1_IRQn               = 21,     //CAN1 RX1 Interrupt
  CAN1_SCE_IRQn               = 22,     //CAN1 SCE Interrupt
  EXTI9_5_IRQn                = 23,     //External Line[9:5] Interrupts
  TIM1_BRK_IRQn               = 24,     //TIM1 Break Interrupt
  TIM1_UP_IRQn                = 25,     //TIM1 Update Interrupt
  TIM1_TRGCOM_IRQn            = 26,     //TIM1 Trigger and Commutation Interrupt
  TIM1_CC_IRQn                = 27,     //TIM1 Capture Compare Interrupt
  TIM2_IRQn                   = 28,     //TIM2 global Interrupt
  TIM3_IRQn                   = 29,     //TIM3 global Interrupt
  I2C1_EV_IRQn                = 31,     //I2C1 Event Interrupt
  I2C1_ER_IRQn                = 32,     //I2C1 Error Interrupt
  SPI1_IRQn                   = 35,     //SPI1 global Interrupt
  USART1_IRQn                 = 37,     //USART1 global Interrupt
  USART2_IRQn                 = 38,     //USART2 global Interrupt
  EXTI15_10_IRQn              = 40,     //External Line[15:10] Interrupts
  RTCAlarm_IRQn               = 41,     //RTC Alarm through EXTI Line Interrupt
  USBWakeUp_IRQn              = 42      //USB Device WakeUp from suspend through EXTI Line Interrupt
#endif

#if IsDensity(LD_VL)
  ADC1_IRQn                   = 18,     //ADC1 global Interrupt
  EXTI9_5_IRQn                = 23,     //External Line[9:5] Interrupts
  TIM1_BRK_TIM15_IRQn         = 24,     //TIM1 Break and TIM15 Interrupts
  TIM1_UP_TIM16_IRQn          = 25,     //TIM1 Update and TIM16 Interrupts
  TIM1_TRGCOM_TIM17_IRQn      = 26,     //TIM1 Trigger and Commutation and TIM17 Interrupt
  TIM1_CC_IRQn                = 27,     //TIM1 Capture Compare Interrupt
  TIM2_IRQn                   = 28,     //TIM2 global Interrupt
  TIM3_IRQn                   = 29,     //TIM3 global Interrupt
  I2C1_EV_IRQn                = 31,     //I2C1 Event Interrupt
  I2C1_ER_IRQn                = 32,     //I2C1 Error Interrupt
  SPI1_IRQn                   = 35,     //SPI1 global Interrupt
  USART1_IRQn                 = 37,     //USART1 global Interrupt
  USART2_IRQn                 = 38,     //USART2 global Interrupt
  EXTI15_10_IRQn              = 40,     //External Line[15:10] Interrupts
  RTCAlarm_IRQn               = 41,     //RTC Alarm through EXTI Line Interrupt
  CEC_IRQn                    = 42,     //HDMI-CEC Interrupt
  TIM6_DAC_IRQn               = 54,     //TIM6 and DAC underrun Interrupt
  TIM7_IRQn                   = 55      //TIM7 Interrupt
#endif

