diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
//==============================================================================================================================
//直接地址申明寄存器
//SCS
#define _ICTR                   *((volatile UINT32 *)0xE000E004)//Interrupt Controller Type Register Definitions
#define _ACTLR                  *((volatile UINT32 *)0xE000E008)//Auxiliary Control Register ,for __CM3_REV >= 0x200
//NVIC
#define _STCTRL                 *((volatile UINT32 *)0xE000E010)//SysTick Control and Status Register
#define _STLOAD                 *((volatile UINT32 *)0xE000E014)//SysTick Reload Value Register
#define _STVAL                  *((volatile UINT32 *)0xE000E018)//SysTick Current Value Register
#define _STCALIB                *((volatile UINT32 *)0xE000E01C)//SysTick Calibration Register

#define _IRQE0                  *((volatile UINT32 *)0xE000E100)//IRQ0-31, Set Enable
#define _IRQE1                  *((volatile UINT32 *)0xE000E104)//IRQ32-63, Set Enable
#define _IRQE2                  *((volatile UINT32 *)0xE000E108)//IRQ64-95, Set Enable
#define _IRQE3                  *((volatile UINT32 *)0xE000E10C)//IRQ96-127, Set Enable
#define _IRQE4                  *((volatile UINT32 *)0xE000E110)//IRQ128-159, Set Enable
#define _IRQE5                  *((volatile UINT32 *)0xE000E114)//IRQ160-191, Set Enable
#define _IRQE6                  *((volatile UINT32 *)0xE000E118)//IRQ192-223, Set Enable
#define _IRQE7                  *((volatile UINT32 *)0xE000E11C)//IRQ224-239, Set Enable
#define _IRQE(i)                *((volatile UINT32 *)(0xE000E100+i*4))//i=0_7
		
#define _ICER0                  *((volatile UINT32 *)0xE000E180)//IRQ0-31,Clear Enable
#define _ICER1                  *((volatile UINT32 *)0xE000E184)//IRQ32-63,Clear Enable
#define _ICER2                  *((volatile UINT32 *)0xE000E188)//IRQ64-95,Clear Enable
#define _ICER3                  *((volatile UINT32 *)0xE000E18C)//IRQ96-127,Clear Enable
#define _ICER4                  *((volatile UINT32 *)0xE000E190)//IRQ128-159,Clear Enable
#define _ICER5                  *((volatile UINT32 *)0xE000E194)//IRQ160-191,Clear Enable
#define _ICER6                  *((volatile UINT32 *)0xE000E198)//IRQ192-223,Clear Enable
#define _ICER7                  *((volatile UINT32 *)0xE000E19C)//IRQ224-239,Clear Enable
#define _ICER(i)                *((volatile UINT32 *)(0xE000E180+i*4))//i=0_7

#define _ISPR0                  *((volatile UINT32 *)0xE000E200)//IRQ0-31,Set Pending Enable
#define _ISPR1                  *((volatile UINT32 *)0xE000E204)//IRQ32-63,Set Pending Enable
#define _ISPR2                  *((volatile UINT32 *)0xE000E208)//IRQ64-95,Set Pending Enable
#define _ISPR3                  *((volatile UINT32 *)0xE000E20C)//IRQ96-127,Set Pending Enable
#define _ISPR4                  *((volatile UINT32 *)0xE000E210)//IRQ128-159,Set Pending Enable
#define _ISPR5                  *((volatile UINT32 *)0xE000E214)//IRQ160-191,Set Pending Enable
#define _ISPR6                  *((volatile UINT32 *)0xE000E218)//IRQ192-223,Set Pending Enable
#define _ISPR7                  *((volatile UINT32 *)0xE000E21C)//IRQ224-239,Set Pending Enable
#define _ISPR(i)                *((volatile UINT32 *)(0xE000E200+i*4))//i=0_7

#define _ICPR0                  *((volatile UINT32 *)0xE000E280)//IRQ0-31,clear Pending Enable
#define _ICPR1                  *((volatile UINT32 *)0xE000E284)//IRQ32-63,clear Pending Enable
#define _ICPR2                  *((volatile UINT32 *)0xE000E288)//IRQ64-95,clear Pending Enable
#define _ICPR3                  *((volatile UINT32 *)0xE000E28C)//IRQ96-127,clear Pending Enable
#define _ICPR4                  *((volatile UINT32 *)0xE000E290)//IRQ128-159,clear Pending Enable
#define _ICPR5                  *((volatile UINT32 *)0xE000E294)//IRQ160-191,clear Pending Enable
#define _ICPR6                  *((volatile UINT32 *)0xE000E298)//IRQ192-223,clear Pending Enable
#define _ICPR7                  *((volatile UINT32 *)0xE000E29C)//IRQ224-239,clear Pending Enable
#define _ICPR(i)                *((volatile UINT32 *)(0xE000E280+i*4))//i=0_7

#define _IABR0                  *((volatile UINT32 *)0xE000E300)//IRQ0-31,active
#define _IABR1                  *((volatile UINT32 *)0xE000E304)//IRQ32-63,active
#define _IABR2                  *((volatile UINT32 *)0xE000E308)//IRQ64-95,active
#define _IABR3                  *((volatile UINT32 *)0xE000E30C)//IRQ96-127,active
#define _IABR4                  *((volatile UINT32 *)0xE000E310)//IRQ128-159,active
#define _IABR5                  *((volatile UINT32 *)0xE000E314)//IRQ160-191,active
#define _IABR6                  *((volatile UINT32 *)0xE000E318)//IRQ192-223,active
#define _IABR7                  *((volatile UINT32 *)0xE000E31C)//IRQ224-239,active
#define _IABR(i)                *((volatile UINT32 *)(0xE000E300+i*4))//i=0_7

#define _IPR(i)                 *((volatile UINT8 *)(0xE000E400+i))//i=0_239
//==============================================================================================================================
#define RSTV_ADC_SR             0x00000000//0x000
struct ADC_SR_BIT
{
	UINT32 AWD:1;         //00,Analog watchdog flag
	UINT32 EOC:1;         //01,End of conversion
	UINT32 JEOC:1;        //02,Injected channel end of conversion
	UINT32 JSTRT:1;       //03,Injected channel Start flag
	UINT32 STRT:1;        //04,Regular channel Start flag
	UINT32 Reserved0:27;  //05,
};
#define ADC_SR_AWD(i)           (*ADC[i]).SR_BIT.AWD
#define ADC_SR_EOC(i)           (*ADC[i]).SR_BIT.EOC
#define ADC_SR_JEOC(i)          (*ADC[i]).SR_BIT.JEOC
#define ADC_SR_JSTRT(i)         (*ADC[i]).SR_BIT.JSTRT
#define ADC_SR_STRT(i)          (*ADC[i]).SR_BIT.STRT
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ADC_CR1            0x00000000//0x004
struct ADC_CR1_BIT
{
	UINT32 AWDCH:5;       //00,AWDCH[4:0] bits (Analog watchdog channel select bits)
	UINT32 EOCIE:1;       //05,Interrupt enable for EOC
	UINT32 AWDIE:1;       //06,Analog Watchdog interrupt enable
	UINT32 JEOCIE:1;      //07,Interrupt enable for injected channels
	UINT32 SCAN:1;        //08,Scan mode
	UINT32 AWDSGL:1;      //09,Enable the watchdog on a single channel in scan mode
	UINT32 JAUTO:1;       //10,Automatic injected group conversion
	UINT32 DISCEN:1;      //11,Discontinuous mode on regular channels
	UINT32 JDISCEN:1;     //12,Discontinuous mode on injected channels
	UINT32 DISCNUM:3;     //13,DISCNUM[2:0] bits (Discontinuous mode channel count)
	UINT32 DUALMOD:4;     //16,DUALMOD[3:0] bits (Dual mode selection)
	UINT32 Reserved0:2;   //20,
	UINT32 JAWDEN:1;      //22,Analog watchdog enable on injected channels
	UINT32 AWDEN:1;       //23,Analog watchdog enable on regular channels
	UINT32 Reserved1:8;   //24,
};
#define ADC_CR1_AWDCH(i)        (*ADC[i]).CR1_BIT.AWDCH
#define ADC_CR1_EOCIE(i)        (*ADC[i]).CR1_BIT.EOCIE
#define ADC_CR1_AWDIE(i)        (*ADC[i]).CR1_BIT.AWDIE
#define ADC_CR1_JEOCIE(i)       (*ADC[i]).CR1_BIT.JEOCIE
#define ADC_CR1_SCAN(i)         (*ADC[i]).CR1_BIT.SCAN
#define ADC_CR1_AWDSGL(i)       (*ADC[i]).CR1_BIT.AWDSGL
#define ADC_CR1_JAUTO(i)        (*ADC[i]).CR1_BIT.JAUTO
#define ADC_CR1_DISCEN(i)       (*ADC[i]).CR1_BIT.DISCEN
#define ADC_CR1_JDISCEN(i)      (*ADC[i]).CR1_BIT.JDISCEN
#define ADC_CR1_DISCNUM(i)      (*ADC[i]).CR1_BIT.DISCNUM
#define ADC_CR1_DUALMOD(i)      (*ADC[i]).CR1_BIT.DUALMOD
#define ADC_CR1_JAWDEN(i)       (*ADC[i]).CR1_BIT.JAWDEN
#define ADC_CR1_AWDEN(i)        (*ADC[i]).CR1_BIT.AWDEN
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ADC_CR2            0x00000000//0x008
struct ADC_CR2_BIT
{
	UINT32 ADON:1;        //00,A/D Converter ON / OFF
	UINT32 CONT:1;        //01,Continuous Conversion
	UINT32 CAL:1;         //02,A/D Calibration
	UINT32 RSTCAL:1;      //03,Reset Calibration
	UINT32 Reserved0:4;   //04,
	UINT32 DMA:1;         //08,Direct Memory access mode
	UINT32 Reserved1:2;   //09,
	UINT32 ALIGN:1;       //11,Data Alignment
	UINT32 JEXTSEL:3;     //12,JEXTSEL[2:0] bits (External event select for injected group)
	UINT32 JEXTTRIG:1;    //15,External Trigger Conversion mode for injected channels
	UINT32 Reserved2:1;   //16,
	UINT32 EXTSEL:3;      //17,EXTSEL[2:0] bits (External Event Select for regular group)
	UINT32 EXTTRIG:1;     //20,External Trigger Conversion mode for regular channels
	UINT32 JSWSTART:1;    //21,Start Conversion of injected channels
	UINT32 SWSTART:1;     //22,Start Conversion of regular channels
	UINT32 TSVREFE:1;     //23,Temperature Sensor and VREFINT Enable
	UINT32 Reserved3:8;   //24,
};
#define ADC_CR2_ADON(i)         (*ADC[i]).CR2_BIT.ADON
#define ADC_CR2_CONT(i)         (*ADC[i]).CR2_BIT.CONT
#define ADC_CR2_CAL(i)          (*ADC[i]).CR2_BIT.CAL
#define ADC_CR2_RSTCAL(i)       (*ADC[i]).CR2_BIT.RSTCAL
#define ADC_CR2_DMA(i)          (*ADC[i]).CR2_BIT.DMA
#define ADC_CR2_ALIGN(i)        (*ADC[i]).CR2_BIT.ALIGN
#define ADC_CR2_JEXTSEL(i)      (*ADC[i]).CR2_BIT.JEXTSEL
#define ADC_CR2_JEXTTRIG(i)     (*ADC[i]).CR2_BIT.JEXTTRIG
#define ADC_CR2_EXTSEL(i)       (*ADC[i]).CR2_BIT.EXTSEL
#define ADC_CR2_EXTTRIG(i)      (*ADC[i]).CR2_BIT.EXTTRIG
#define ADC_CR2_JSWSTART(i)     (*ADC[i]).CR2_BIT.JSWSTART
#define ADC_CR2_SWSTART(i)      (*ADC[i]).CR2_BIT.SWSTART
#define ADC_CR2_TSVREFE(i)      (*ADC[i]).CR2_BIT.TSVREFE
//------------------------------------------------------------------------------------------------------------------------------
//SMP Cycles: 0=1.5,1=7.5,2=13.5,3=28.5,4=41.5,5=55.5,6=71.5,7=239.5
#define RSTV_ADC_SMPR1          0x00000000//0x00C
#define RSTV_ADC_SMPR2          0x00000000//0x010
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ADC_JOFR1          0x00000000//0x014
#define RSTV_ADC_JOFR2          0x00000000//0x018
#define RSTV_ADC_JOFR3          0x00000000//0x01C
#define RSTV_ADC_JOFR4          0x00000000//0x020
#define RSTV_ADC_JOFR           0x00000000
struct ADC_JOFR_BIT//0x014=JOFR1,0x018=JOFR2,0x01C=JOFR3,0x020=JOFR4
{
	UINT32 JOFFSET:12;    //00,Data offset for injected channel 1_4
	UINT32 Reserved0:20;  //12,
};
#define ADC_JOFR_JOFFSET(i,j)   (*ADC[i]).JOFR[j]_BIT.JOFFSET//i=0_2,j=0_3
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ADC_HTR            0x00000000//0x024，Analog watchdog high threshold
#define RSTV_ADC_LTR            0x00000000//0x028，Analog watchdog low threshold
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ADC_SQR1           0x00000000//0x02C,bit20_23=L=Regular channel sequence length
#define RSTV_ADC_SQR2           0x00000000//0x030
#define RSTV_ADC_SQR3           0x00000000//0x034
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ADC_JSQR           0x00000000//0x038
struct ADC_JSQR_BIT
{
	UINT32 JSQ1:5;        //00,JSQ1[4:0] bits (1st conversion in injected sequence)
	UINT32 JSQ2:5;        //05,JSQ2[4:0] bits (2nd conversion in injected sequence)
	UINT32 JSQ3:5;        //10,JSQ3[4:0] bits (3rd conversion in injected sequence)
	UINT32 JSQ4:5;        //15,JSQ4[4:0] bits (4th conversion in injected sequence)
	UINT32 JL:2;          //20,JL[1:0] bits (Injected Sequence length)
	UINT32 Reserved0:10;  //22,
};
#define ADC_JSQR_JSQ1(i)        (*ADC[i]).JSQR_BIT.JSQ1
#define ADC_JSQR_JSQ2(i)        (*ADC[i]).JSQR_BIT.JSQ2
#define ADC_JSQR_JSQ3(i)        (*ADC[i]).JSQR_BIT.JSQ3
#define ADC_JSQR_JSQ4(i)        (*ADC[i]).JSQR_BIT.JSQ4
#define ADC_JSQR_JL(i)          (*ADC[i]).JSQR_BIT.JL
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ADC_JDR1           0x00000000//0x03C
#define RSTV_ADC_JDR2           0x00000000//0x040
#define RSTV_ADC_JDR3           0x00000000//0x044
#define RSTV_ADC_JDR4           0x00000000//0x048
#define RSTV_ADC_JDR            0x00000000
struct ADC_JDR_BIT//JDR1,JDR2,JDR3,JDR4
{
	UINT32 JDATA:16;      //00,Injected data
	UINT32 Reserved0:16;  //16,
};
