diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define ADC_JDR_JDATA(i,j)      (*ADC[i]).JDR[j]_BIT.JDATA//i=0_2,j=0_3
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ADC_DR               0x00000000//0x04C
struct ADC_DR_BIT
{
	UINT32 DATA:16;       //00,Regular data
	UINT32 ADC2DATA:16;   //16,ADC2 data
};
#define ADC_DR_DATA(i)          (*ADC[i]).DR_BIT.DATA
#define ADC_DR_ADC2DATA(i)      (*ADC[i]).DR_BIT.ADC2DATA
//------------------------------------------------------------------------------------------------------------------------------
#define ADC_Struct Struct_ADC
typedef struct Struct_ADC//ADC1=0x40012400,ADC2=0x40012800,ADC3=0x40013C00 
{
  union{UINT32 SR;struct ADC_SR_BIT SR_BIT;};            //0x000(RW),ADC status register
  union{UINT32 CR1;struct ADC_CR1_BIT CR1_BIT;};         //0x004(RW),ADC control register 1
  union{UINT32 CR2;struct ADC_CR2_BIT CR2_BIT;};         //0x008(RW),ADC control register 2
  union{UINT32 SMPR[2];struct UINT32_B3P_BIT SMPR_BIT[2];};//0x00C(RW),ADC sample time register
  union{UINT32 JOFR[4];struct ADC_JOFR_BIT JOFR_BIT[4];};//0x014(RW),ADC injected channel data offset register 1_4
  union{UINT32 HTR;Type_UINT32_BIT12 HTR_BIT;};          //0x024(RW),ADC watchdog higher threshold register
  union{UINT32 LTR;Type_UINT32_BIT12 LTR_BIT;};          //0x028(RW),watchdog lower threshold register
  union{UINT32 SQR[3];struct UINT32_B5P_BIT SQR_BIT[3];};//0x02C(RW),regular sequence register 1_3
  union{UINT32 JSQR;struct ADC_JSQR_BIT JSQR_BIT;};      //0x038(RW),injected sequence register
  union{UINT32 JDR[4];struct ADC_JDR_BIT JDR_BIT[4];};   //0x03C(RW),injected data register 1_4
  union{UINT32 DR;struct ADC_DR_BIT DR_BIT;};            //0x04C(RW),ADC regular data register
} ADC_Type,Type_ADC;
#define PT_ADC1                 ((volatile Type_ADC *)BASE_ADC1)
#define PT_ADC2                 ((volatile Type_ADC *)BASE_ADC2)
#define PT_ADC3                 ((volatile Type_ADC *)BASE_ADC3)
#define PT_ADC(i)               ((volatile Type_ADC *)BASE_ADC[i])
//------------------------------------------------------------------------------------------------------------------------------
#define ADC_SR(i)               (*ADC[i]).SR//i=0_2
#define ADC_CR1(i)              (*ADC[i]).CR1//i=0_2
#define ADC_CR2(i)              (*ADC[i]).CR2//i=0_2
#define ADC_SMPR(i,j)           (*ADC[i]).SMPR[j]//i=0_2,j=0_1
#define ADC_JOFR(i,j)           (*ADC[i]).JOFR[j]//i=0_2,j=0_3
#define ADC_HTR(i)              (*ADC[i]).HTR//i=0_2
#define ADC_LTR(i)              (*ADC[i]).LTR//i=0_2
#define ADC_SQR(i,j)            (*ADC[i]).SQR[j]//i=0_2,j=0_2
#define ADC_JSQR(i)             (*ADC[i]).JSQR//i=0_2
#define ADC_JDR(i,j)            (*ADC[i]).JDR[j]//i=0_2,j=0_3
#define ADC_DR(i)               (*ADC[i]).DR//i=0_2
//==============================================================================================================================

#define RSTV_BKP_DRA            0x00000000//0x04
#define RSTV_BKP_DRB            0x00000000//0x40
#define RSTV_BKP_DR             0x00000000
struct BKP_DR_BIT//0x04=DRA,0x40=DRB
{
  UINT32 D:16;          //00,
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_BKP_RTCCR          0x00000000//0x2C
struct BKP_RTCCR_BIT
{
  UINT32 CAL:7;         //00,Calibration value
  UINT32 CCO:1;         //07,Calibration Clock Output
  UINT32 ASOE:1;        //08,Alarm or Second Output Enable
  UINT32 ASOS:1;        //09,Alarm or Second Output Selection
  UINT32 Reserved0:22;  //10,
};
#define BKP_RTCCR_CAL           BKP.RTCCR_BIT.CAL
#define BKP_RTCCR_CCO           BKP.RTCCR_BIT.CCO
#define BKP_RTCCR_ASOE          BKP.RTCCR_BIT.ASOE
#define BKP_RTCCR_ASOS          BKP.RTCCR_BIT.ASOS
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_BKP_CR             0x00000000//0x30
struct BKP_CR_BIT
{
  UINT32 TPE:1;         //0x00,TAMPER pin enable
  UINT32 TPAL:1;        //0x01,TAMPER pin active level
  UINT32 Reserved0:30;
};
#define BKP_CR_TPE              BKP.CR_BIT.TPE
#define BKP_CR_TPAL             BKP.CR_BIT.TPAL
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_BKP_CSR            0x00000000//0x34
struct BKP_CSR_BIT
{
  UINT32 CTE:1;         //Clear Tamper event
  UINT32 CTI:1;         //Clear Tamper Interrupt
  UINT32 TPIE:1;        //TAMPER Pin interrupt enable
  UINT32 Reserved0:5;
  UINT32 TEF:1;         //Tamper Event Flag
  UINT32 TIF:1;         //Tamper Interrupt Flag
};
#define BKP_CSR_CTE             BKP.CSR_BIT.CTE
#define BKP_CSR_CTI             BKP.CSR_BIT.CTI
#define BKP_CSR_TPIE            BKP.CSR_BIT.TPIE
#define BKP_CSR_TEF             BKP.CSR_BIT.TEF
#define BKP_CSR_TIF             BKP.CSR_BIT.TIF
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define BKP_Struct Struct_BKP
typedef struct Struct_BKP
{
  UINT32 RESERVED0[1];  //0x00(R),
  union{UINT32 DRA[10];struct BKP_DR_BIT DRA_BIT[10];}; //0x04(RW),
  union{UINT32 RTCCR;struct BKP_RTCCR_BIT RTCCR_BIT;};  //0x2C(RW),
  union{UINT32 CR;struct BKP_CR_BIT CR_BIT;};           //0x30(RW),
  union{UINT32 CSR;struct BKP_CSR_BIT CSR_BIT;};        //0x34(RW),
	UINT32 RESERVED1[2];  //0x38(R),
  union{UINT32 DRB[32];struct BKP_DR_BIT DRB_BIT[32];}; //0x40(RW),
} BKP_Type,Type_BKP;
#define PT_BKP                  ((volatile Type_BKP *)BASE_BKP)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define BKP_DRA(i)              BKP.DRA[i]//i=0_9
#define BKP_RTCCR               BKP.RTCCR
#define BKP_CR                  BKP.CR
#define BKP_CSR                 BKP.CSR
#define BKP_DRB(i)              BKP.DRB[i]//i=0_31
//==============================================================================================================================
#define RSTV_CAN_MCR            0x00010002//0x000
struct CAN_MCR_BIT
{
	UINT32 INRQ:1;        //00,Initialization Request
	UINT32 SLEEP:1;       //01,Sleep Mode Request
	UINT32 TXFP:1;        //02,Transmit FIFO Priority
	UINT32 RFLM:1;        //03,Receive FIFO Locked Mode
	UINT32 NART:1;        //04,No Automatic Retransmission
	UINT32 AWUM:1;        //05,Automatic Wakeup Mode
	UINT32 ABOM:1;        //06,Automatic Bus-Off Management
	UINT32 TTCM:1;        //07,Time Triggered Communication Mode
	UINT32 Reserved0:7;   //08,
	UINT32 RESET:1;       //15,CAN software master reset
	UINT32 DBF:1;         //16,Debug freeze
	UINT32 Reserved1:15;  //17,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_MSR            0x00000C02//0x004
struct CAN_MSR_BIT
{
	UINT32 INAK:1;        //00,Initialization Acknowledge
	UINT32 SLAK:1;        //01,Sleep Acknowledge
	UINT32 ERRI:1;        //02,Error Interrupt
	UINT32 WKUI:1;        //03,Wakeup Interrupt
	UINT32 SLAKI:1;       //04,Sleep Acknowledge Interrupt
	UINT32 Reserved0:3;   //05,
	UINT32 TXM:1;         //08,Transmit Mode
	UINT32 RXM:1;         //09,Receive Mode
	UINT32 SAMP:1;        //10,Last Sample Point
	UINT32 RX:1;          //11,CAN Rx Signal
	UINT32 Reserved1:20;  //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_TSR            0x1C000000//0x008
struct CAN_TSR_BIT
{
	UINT32 RQCP0:1;       //00,Request Completed Mailbox0
	UINT32 TXOK0:1;       //01,Transmission OK of Mailbox0
	UINT32 ALST0:1;       //02,Arbitration Lost for Mailbox0
	UINT32 TERR0:1;       //03,Transmission Error of Mailbox0
	UINT32 Reserved0:3;   //04,
	UINT32 ABRQ0:1;       //07,Abort Request for Mailbox0
	UINT32 RQCP1:1;       //08,Request Completed Mailbox1
	UINT32 TXOK1:1;       //09,Transmission OK of Mailbox1
	UINT32 ALST1:1;       //10,Arbitration Lost for Mailbox1
	UINT32 TERR1:1;       //11,Transmission Error of Mailbox1
	UINT32 Reserved1:3;   //12,
	UINT32 ABRQ1:1;       //15,Abort Request for Mailbox1
	UINT32 RQCP2:1;       //16,Request Completed Mailbox2
	UINT32 TXOK2:1;       //17,Transmission OK of Mailbox2
	UINT32 ALST2:1;       //18,Arbitration Lost for Mailbox2
	UINT32 TERR2:1;       //19,Transmission Error of Mailbox2
	UINT32 Reserved2:3;   //20,
	UINT32 ABRQ2:1;       //23,Abort Request for Mailbox2
  UINT32 CODE:2;        //24,Mailbox Code
	UINT32 TME:3;         //26,TME[2:0] bits=Transmit Mailbox 0_2 Empty
	UINT32 LOW:3;         //29,LOW[2:0] bits=Lowest Priority Flag for Mailbox 0_2
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_RF0R           0x00000000//0x00C
#define RSTV_CAN_RF1R           0x00000000//0x010
struct CAN_RFR_BIT//0x00C=RF0R,0x010=RF1R
{
	UINT32 FMP:2;         //00,FIFO 0/1 Message Pending
	UINT32 Reserved0:1;   //02,
	UINT32 FULL:1;        //03,FIFO 0/1 Full
	UINT32 FOVR:1;        //04,FIFO 0/1 Overrun
	UINT32 RFOM:1;        //05,Release FIFO 0/1 Output Mailbox
	UINT32 Reserved1:26;  //06,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_IER            0x00000000//0x014
struct CAN_IER_BIT
{
	UINT32 TMEIE:1;       //00,Transmit Mailbox Empty Interrupt Enable
	UINT32 FMPIE0:1;      //01,FIFO Message Pending Interrupt Enable
	UINT32 FFIE0:1;       //02,FIFO Full Interrupt Enable
	UINT32 FOVIE0:1;      //03,FIFO Overrun Interrupt Enable
	UINT32 FMPIE1:1;      //04,FIFO Message Pending Interrupt Enable
	UINT32 FFIE1:1;       //05,FIFO Full Interrupt Enable
	UINT32 FOVIE1:1;      //06,FIFO Overrun Interrupt Enable
	UINT32 Reserved0:1;   //07,
	UINT32 EWGIE:1;       //08,Error Warning Interrupt Enable
	UINT32 EPVIE:1;       //09,Error Passive Interrupt Enable
	UINT32 BOFIE:1;       //10,Bus-Off Interrupt Enable
	UINT32 LECIE:1;       //11,Last Error Code Interrupt Enable
	UINT32 Reserved1:3;   //12,
	UINT32 ERRIE:1;       //15,Error Interrupt Enable
	UINT32 WKUIE:1;       //16,Wakeup Interrupt Enable
	UINT32 SLKIE:1;       //17,Sleep Interrupt Enable
	UINT32 Reserved2:14;  //18,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_ESR            0x00000000//0x018
struct CAN_ESR_BIT
{
	UINT32 EWGF:1;        //00,Error Warning Flag
	UINT32 EPVF:1;        //01,Error Passive Flag
	UINT32 BOFF:1;        //02,Bus-Off Flag
	UINT32 Reserved0:1;   //03,
	UINT32 LEC:3;         //04,LEC[2:0] bits (Last Error Code)
	UINT32 Reserved1:9;   //07,
	UINT32 TEC:8;         //16,Least significant byte of the 9-bit Transmit Error Counter
	UINT32 REC:8;         //24,Receive Error Counter
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_BTR            0x01230000//0x01C
struct CAN_BTR_BIT
{
	UINT32 BRP:10;        //00,Baud Rate Prescaler
	UINT32 Reserved0:6;   //10,
	UINT32 TS1:4;         //16,Time Segment 1
	UINT32 TS2:3;         //20,Time Segment 2
	UINT32 Reserved1:1;   //23,
	UINT32 SJW:2;         //24,Resynchronization Jump Width
	UINT32 Reserved2:4;   //26,
	UINT32 LBKM:1;        //30,Loop Back Mode (Debug):1=enable
	UINT32 SILM:1;        //31,Silent Mode:0=normal,1=silent mode
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_TI0R           0x00000000//0x180
#define RSTV_CAN_TI1R           0x00000000//0x190 
#define RSTV_CAN_TI2R           0x00000000//0x1A0
#define RSTV_CAN_TIR            0x00000000
struct CAN_TIR_BIT//0x180=TI0R,0x190=TI1R,0x1A0=TI2R
{
	UINT32 TXRQ:1;        //00,Transmit Mailbox Request
	UINT32 RTR:1;         //01,Remote Transmission Request
	UINT32 IDE:1;         //02,Identifier Extension
	UINT32 EXID:18;       //03,Extended Identifier
	UINT32 STID:11;       //21,Standard Identifier or Extended Identifier
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_TDT0R          0x00000000//0x184
#define RSTV_CAN_TDT1R          0x00000000//0x194 
#define RSTV_CAN_TDT2R          0x00000000//0x1A4
#define RSTV_CAN_TDTR           0x00000000
struct CAN_TDTR_BIT//0x184=TDT0R,0x194=TDT1R,0x1A4=TDT2R
{
	UINT32 DLC:4;         //00,Data Length Code
	UINT32 Reserved0:4;   //04,
	UINT32 TGT:1;         //08,Transmit Global Time
	UINT32 Reserved1:7;   //09,
	UINT32 TIME:16;       //16,Message Time Stamp
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_TDL0R          0x00000000//0x188
#define RSTV_CAN_TDL1R          0x00000000//0x198 
#define RSTV_CAN_TDL2R          0x00000000//0x1A8
#define RSTV_CAN_RDL0R          0x00000000//0x1B8
#define RSTV_CAN_RDL1R          0x00000000//0x1C8
#define RSTV_CAN_DLR            0x00000000
struct CAN_DLR_BIT//0x188=TDL0R,0x198=TDL1R,0x1A8=TDL2R,0x1B8=RDL0R,0x1C8=RDL1R
{
	UINT32 DATA0:8;       //00,Data byte 0
	UINT32 DATA1:8;       //08,Data byte 1
	UINT32 DATA2:8;       //16,Data byte 2
	UINT32 DATA3:8;       //24,Data byte 3
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_TDH0R          0x00000000//0x18C
#define RSTV_CAN_TDH1R          0x00000000//0x19C 
#define RSTV_CAN_TDH2R          0x00000000//0x1AC
#define RSTV_CAN_RDH0R          0x00000000//0x1BC
#define RSTV_CAN_RDH1R          0x00000000//0x1CC
#define RSTV_CAN_DHR            0x00000000
struct CAN_DHR_BIT//0x18C=TDH0R,0x19C=TDH1R,0x1AC=TDH2R,0x1BC=RDH0R,0x1CC=RDH1R
{
	UINT32 DATA4:8;       //00,Data byte 0
	UINT32 DATA5:8;       //08,Data byte 1
	UINT32 DATA6:8;       //16,Data byte 2
	UINT32 DATA7:8;       //24,Data byte 3
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_RI0R           0x00000000//0x1B0
#define RSTV_CAN_RI1R           0x00000000//0x1C0 
#define RSTV_CAN_RIR            0x00000000
struct CAN_RIR_BIT//0x1B0=RI0R,0x1C0=RI1R
{
	UINT32 Reserved0:1;   //00,
	UINT32 RTR:1;         //01,Remote Transmission Request
	UINT32 IDE:1;         //02,Identifier Extension
	UINT32 EXID:18;       //03,Extended Identifier
	UINT32 STID:11;       //21,Standard Identifier or Extended Identifier
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_RDT0R          0x00000000//0x1B4
#define RSTV_CAN_RDT1R          0x00000000//0x1C4 
#define RSTV_CAN_RDTR           0x00000000
struct CAN_RDTR_BIT//0x1B4=RDT0R,0x1C4=RDT1R
{
	UINT32 DLC:4;         //00,Data Length Code
	UINT32 Reserved0:4;   //04,
	UINT32 FMI:8;         //08,Filter Match Index
	UINT32 TIME:16;       //16,Message Time Stamp
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_FMR            0x00000000//0x200
struct CAN_FMR_BIT
{
	UINT32 FINIT:1;       //00,Filter Init Mode
	UINT32 Reserved0:7;   //01,
	UINT32 CAN2SB:6;      //08,<LDY>
	UINT32 Reserved1:18;  //14,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_FM1R           0x00000000//0x204
struct CAN_FM1R_BIT
{
	UINT32 FBM:28;        //00,Filter Mode,or=14bits(IsDensity(CL)):0=mask mode,1=list mode
	UINT32 Reserved0:4;   //28,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_FS1R           0x00000000//0x20C
struct CAN_FS1R_BIT
{
	UINT32 FSC:28;        //00,Filter Scale Configuration,or=14bits(IsDensity(CL)):0=dual 16 bits,1=single 32 bits
	UINT32 Reserved0:4;   //28,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_FFA1R          0x00000000//0x214
struct CAN_FFA1R_BIT
{
	UINT32 FFA:28;        //00,Filter FIFO Assignment,or=14bits(IsDensity(CL)):0=fifo 0,1=fifo 1
	UINT32 Reserved0:4;   //28,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_FA1R           0x00000000//0x21C
struct CAN_FA1R_BIT
{
	UINT32 FACT:28;       //00,Filter Active,or=14bits(IsDensity(CL)):0=not active,1=active
	UINT32 Reserved0:4;   //28,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CAN_FR             0x00000000
//------------------------------------------------------------------------------------------------------------------------------
typedef union CAN_BUF
{
  UINT8  Item[8];
  struct CAN_BUFHL
  {
    union{UINT32 DLR;struct CAN_DLR_BIT DLR_BIT;UINT8 DLR_Byte[4];};
    union{UINT32 DHR;struct CAN_DHR_BIT DHR_BIT;UINT8 DHR_Byte[4];};
  }LH;
} CAN_BUF_Type,Type_CAN_BUF;
//------------------------------------------------------------------------------------------------------------------------------
typedef struct Struct_CAN_TxMailBox
{
  union{UINT32 TIR;struct CAN_TIR_BIT TIR_BIT;};
  union{UINT32 TDTR;struct CAN_TDTR_BIT TDTR_BIT;UINT8 TDTR_Byte[4];};
  Type_CAN_BUF TBUF;
} CAN_TxMailBox_Type,Type_CAN_TxMailBox;
//------------------------------------------------------------------------------------------------------------------------------
typedef struct Struct_CAN_RxMailBox
{
  union{UINT32 RIR;struct CAN_RIR_BIT RIR_BIT;};
  union{UINT32 RDTR;struct CAN_RDTR_BIT RDTR_BIT;UINT8 RDTR_Byte[4];};
  Type_CAN_BUF RBUF;
} CAN_RxMailBox_Type,Type_CAN_RxMailBox;
//------------------------------------------------------------------------------------------------------------------------------
typedef struct Struct_CAN_FilterR
{
  union{UINT32 FR1;Type_BIT32 FR1_BIT;};
  union{UINT32 FR2;Type_BIT32 FR2_BIT;};
} CAN_FilterR_Type,Type_CAN_FilterR;
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define CAN_Struct Struct_CAN
typedef struct Struct_CAN//CAN1=0x40006400,CAN2=0x40006800
{
  union{UINT32 MCR;struct CAN_MCR_BIT MCR_BIT;};      //CAN1=0x40006400
  union{UINT32 MSR;struct CAN_MSR_BIT MSR_BIT;};      //CAN1=0x40006404
  union{UINT32 TSR;struct CAN_TSR_BIT TSR_BIT;};      //CAN1=0x40006408
  union{UINT32 RFR[2];struct CAN_RFR_BIT RFR_BIT[2];};//CAN1=0x4000640C
  union{UINT32 IER;struct CAN_IER_BIT IER_BIT;};      //CAN1=0x40006414
  union{UINT32 ESR;struct CAN_ESR_BIT ESR_BIT;};      //CAN1=0x40006418
  union{UINT32 BTR;struct CAN_BTR_BIT BTR_BIT;};      //CAN1=0x4000641C
  UINT32 Reserved0[88]; //CAN1=0x40006420
  Type_CAN_TxMailBox TXM[3];//CAN1=0x40006580,sTxMailBox
  Type_CAN_RxMailBox RXM[2];//CAN1=0x400065B0,sRxMailBox
  UINT32 Reserved1[12]; //CAN1=0x400065D0
  union{UINT32 FMR;struct CAN_FMR_BIT FMR_BIT;};      //CAN1=0x40006600
  union{UINT32 FM1R;struct CAN_FM1R_BIT FM1R_BIT;};   //CAN1=0x40006604
  UINT32 Reserved2[1];  //CAN1=0x40006608
  union{UINT32 FS1R;struct CAN_FS1R_BIT FS1R_BIT;};   //CAN1=0x4000660C
  UINT32 Reserved3[1];  //CAN1=0x40006610
  union{UINT32 FFA1R;struct CAN_FFA1R_BIT FFA1R_BIT;};//CAN1=0x40006614
  UINT32 Reserved4[1];  //CAN1=0x40006618
  union{UINT32 FA1R;struct CAN_FA1R_BIT FA1R_BIT;};   //CAN1=0x4000661C
  UINT32 Reserved5[8];  //CAN1=0x40006620
#if !IsDensity(CL)
  Type_CAN_FilterR SFR[14];//CAN1=0x40006640,sFilterRegister
	UINT32 Reserved6[84];  //CAN1=0x400066B0
#else
  Type_CAN_FilterR SFR[28];//CAN1=0x40006640,sFilterRegister
	UINT32 Reserved6[56];  //CAN1=0x40006720
#endif

} CAN_Type,Type_CAN;
#define PT_CAN1                 ((volatile Type_CAN *)BASE_CAN1)
#define PT_CAN2                 ((volatile Type_CAN *)BASE_CAN2)
#define PT_CAN(i)               ((volatile Type_CAN *)BASE_CAN(i))
#define CAN1                    CAN[0]
#define CAN2                    CAN[1]
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define CAN_MCR(i)              CAN[i].MCR//i=0_1,
#define CAN_MSR(i)              CAN[i].MSR//i=0_1,
#define CAN_TSR(i)              CAN[i].TSR//i=0_1,
#define CAN_RFR(i,j)            CAN[i].RFR[j]//i=0_1,j=0_1
#define CAN_IER(i)              CAN[i].IER//i=0_1,
#define CAN_ESR(i)              CAN[i].ESR//i=0_1,
#define CAN_BTR(i)              CAN[i].BTR//i=0_1,
#define CAN_TIR(i,j)            CAN[i].TXM[j].TIR//i=0_1,j=0_2
#define CAN_TDTR(i,j)           CAN[i].TXM[j].TDTR//i=0_1,j=0_2
#define CAN_TDLR(i,j)           CAN[i].TXM[j].TDLR//i=0_1,j=0_2
#define CAN_TDHR(i,j)           CAN[i].TXM[j].TDHR//i=0_1,j=0_2
#define CAN_RIR(i,j)            CAN[i].RXM[j].RIR//i=0_1,j=0_1
#define CAN_RDTR(i,j)           CAN[i].RXM[j].RDTR//i=0_1,j=0_1
#define CAN_RDLR(i,j)           CAN[i].RXM[j].RDLR//i=0_1,j=0_1
#define CAN_RDHR(i,j)           CAN[i].RXM[j].RDHR//i=0_1,j=0_1
#define CAN_FMR(i)              CAN[i].FMR//i=0_1,
#define CAN_FM1R(i)             CAN[i].FM1R//i=0_1,
#define CAN_FS1R(i)             CAN[i].FS1R//i=0_1,
#define CAN_FFA1R(i)            CAN[i].FFA1R//i=0_1,
#define CAN_FA1R(i)             CAN[i].FA1R//i=0_1,
#define CAN_FR1(i,j)            CAN[i].SFR[j].FR1//i=0_1,j=0_13 or j=0_27(IsDensity(CL))
#define CAN_FR2(i,j)            CAN[i].SFR[j].FR2//i=0_1,j=0_13 or j=0_27(IsDensity(CL))
//==============================================================================================================================
#define RSTV_CEC_CFGR           0x00000000//0x000
struct CEC_CFGR_BIT
{
	UINT32 PE:1;          //00,Peripheral Enable
	UINT32 IE:1;          //01,Interrupt Enable
	UINT32 BTEM:1;        //02,Bit Timing Error Mode
	UINT32 BPEM:1;        //03,Bit Period Error Mode
	UINT32 Reserved0:28;  //04,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CEC_OAR            0x00000000//0x004
struct CEC_OAR_BIT
{
	UINT32 OA:4;          //00,OA[3:0]: Own Address
	UINT32 Reserved0:28;  //04,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CEC_PRES           0x00000000//0x008
struct CEC_PRES_BIT
{
	UINT32 PRES:14;       //00,Prescaler Counter Value
	UINT32 Reserved0:18;  //14,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CEC_ESR            0x00000000//0x00C
struct CEC_ESR_BIT
{
	UINT32 BTE:1;         //00,Bit Timing Error
	UINT32 BPE:1;         //01,Bit Period Error
	UINT32 RBTFE:1;       //02,Rx Block Transfer Finished Error
	UINT32 SBE:1;         //03,Start Bit Error
	UINT32 ACKE:1;        //04,Block Acknowledge Error
	UINT32 LINE:1;        //05,Line Error
	UINT32 TBTFE:1;       //06,Tx Block Transfer Finished Error
	UINT32 Reserved0:25;  //07,
};
