diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CEC_CSR            0x00000000//0x010
struct CEC_CSR_BIT
{
	UINT32 TSOM:1;        //00,Tx Start Of Message
	UINT32 TEOM:1;        //01,Tx End Of Message
	UINT32 TERR:1;        //02,Tx Error
	UINT32 TBTRF:1;       //03,Tx Byte Transfer Request or Block Transfer Finished
	UINT32 RSOM:1;        //04,Rx Start Of Message
	UINT32 REOM:1;        //05,Rx End Of Message
	UINT32 RERR:1;        //06,Rx Error
	UINT32 RBTF:1;        //07,Rx Block Transfer Finished
	UINT32 Reserved0:24;  //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CEC_TXD            0x00000000//0x014
#define RSTV_CEC_RXD            0x00000000//0x018
struct CEC_XD_BIT//0x014=TXD,0x18=RXD
{
	UINT32 XD:8;          //00,Tx/Rx Data register
	UINT32 Reserved0:24;  //08,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define CEC_Struct Struct_CEC
typedef struct Struct_CEC
{
  union{UINT32 CFGR;struct CEC_CFGR_BIT CFGR_BIT;};
  union{UINT32 OAR;struct CEC_OAR_BIT OAR_BIT;};
  union{UINT32 PRES;struct CEC_PRES_BIT PRES_BIT;};
  union{UINT32 ESR;struct CEC_ESR_BIT ESR_BIT;};
  union{UINT32 CSR;struct CEC_CSR_BIT CSR_BIT;};
  union{UINT32 TXD;struct CEC_XD_BIT TXD_BIT;};
  union{UINT32 RXD;struct CEC_XD_BIT RXD_BIT;};  
} CEC_Type,Type_CEC;
#define PT_CEC                  ((volatile Type_CEC *)BASE_CEC)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define CEC_CFGR                CEC.CFGR
#define CEC_OAR                 CEC.OAR
#define CEC_PRES                CEC.PRES
#define CEC_ESR                 CEC.ESR
#define CEC_CSR                 CEC.CSR
#define CEC_TXD                 CEC.TXD
#define CEC_RXD                 CEC.RXD
//==============================================================================================================================
#define RSTV_CRC_DR             0xFFFFFFFF//0x000
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CRC_IDR            0x00000000//0x004
struct CRC_IDR_BIT
{
  UINT32 IDR:8;         //00,
  UINT32 Reserved0:24;  //08,
};
#define CRC_IDR_IDR             CRC.IDR_BIT.IDR
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_CRC_CR             0x00000000//0x008
struct CRC_CR_BIT
{
  UINT32 RESET:1;       //00,Resets the CRC calculation unit
  UINT32 Reserved0:31;
};
#define CRC_CR_RESET            CRC.CR_BIT.RESET
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define CRC_Struct Struct_CRC
typedef struct Struct_CRC
{
  union{UINT32 DR;};
  union{UINT32 IDR;struct CRC_IDR_BIT IDR_BIT;};
  union{UINT32 CR;struct CRC_CR_BIT CR_BIT;};
} CRC_Type,Type_CRC;
#define PT_CRC    ((volatile Type_CRC *)BASE_CRC)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define CRC_DR     CRC.DR
#define CRC_IDR    CRC.IDR
#define CRC_CR     CRC.CR
//==============================================================================================================================
#define RSTV_DAC_CR             0x00000000//0x000
struct DAC_CR_BIT
{
	UINT32 EN1:1;         //00,DAC channel1 enable
	UINT32 BOFF1:1;       //01,DAC channel1 output buffer disable
	UINT32 TEN1:1;        //02,DAC channel1 Trigger enable
	UINT32 TSEL1:3;       //03,TSEL1[2:0] (DAC channel1 Trigger selection)
	UINT32 WAVE1:2;       //06,WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable)
	UINT32 MAMP1:4;       //08,MAMP1[3:0] (DAC channel1 Mask/Amplitude selector)
	UINT32 DMAEN1:1;      //12,DAC channel1 DMA enable
	UINT32 Reserved0:3;   //13,
	UINT32 EN2:1;         //16,DAC channel2 enable
	UINT32 BOFF2:1;       //17,DAC channel2 output buffer disable
	UINT32 TEN2:1;        //18,DAC channel2 Trigger enable
	UINT32 TSEL2:3;       //19,TSEL2[2:0] (DAC channel2 Trigger selection)
	UINT32 WAVE2:2;       //22,WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable)
	UINT32 MAMP2:4;       //24,MAMP2[3:0] (DAC channel2 Mask/Amplitude selector)
	UINT32 DMAEN2:1;      //28,DAC channel2 DMA enabled
	UINT32 Reserved1:3;   //29,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_SWTRIGR        0x00000000//0x004
struct DAC_SWTRIGR_BIT
{
	UINT32 SWTRIG1:1;     //00,DAC channel1 software trigger
	UINT32 SWTRIG2:1;     //01,DAC channel2 software trigger
	UINT32 Reserved0:30;  //02,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DHR12R1        0x00000000//0x008
struct DAC_DHR12R1_BIT
{
	UINT32 DACC1DHR:12;   //00,DAC channel1 12-bit Right aligned data
	UINT32 Reserved0:20;  //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DHR12L1        0x00000000//0x00C
struct DAC_DHR12L1_BIT
{
	UINT32 Reserved0:4;   //00,
	UINT32 DACC1DHR:12;   //04,DAC channel1 12-bit Right aligned data
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DHR8R1         0x00000000//0x010
struct DAC_DHR8R1_BIT
{
	UINT32 DACC1DHR:8;    //00,DAC channel1 8-bit Right aligned data
	UINT32 Reserved0:24;  //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DHR12R2        0x00000000//0x014
struct DAC_DHR12R2_BIT
{
	UINT32 DACC2DHR:12;   //00,DAC channel2 12-bit Right aligned data
	UINT32 Reserved0:20;  //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DHR12L2        0x00000000//0x018
struct DAC_DHR12L2_BIT
{
	UINT32 Reserved0:4;   //00,
	UINT32 DACC2DHR:12;   //04,DAC channel2 12-bit Left aligned data
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DHR8R2         0x00000000//0x01C
struct DAC_DHR8R2_BIT
{
	UINT32 DACC2DHR:8;    //00,DAC channel2 8-bit Right aligned data
	UINT32 Reserved1:24;  //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DHR12RD        0x00000000//0x020
struct DAC_DHR12RD_BIT
{
	UINT32 DACC1DHR:12;   //00,DAC channel1 12-bit Right aligned data
	UINT32 Reserved0:4;   //16,
	UINT32 DACC2DHR:12;   //16,DAC channel2 12-bit Right aligned data
	UINT32 Reserved1:4;   //28,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DHR12LD        0x00000000//0x024
struct DAC_DHR12LD_BIT
{
	UINT32 Reserved0:4;   //00,
	UINT32 DACC1DHR:12;   //04,DAC channel1 12-bit Left aligned data
	UINT32 Reserved1:4;   //16,
	UINT32 DACC2DHR:12;   //20,DAC channel2 12-bit Left aligned data
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DHR8RD         0x00000000//0x028
struct DAC_DHR8RD_BIT
{
	UINT32 DACC1DHR:8;    //00,DAC channel1 8-bit Right aligned data
	UINT32 DACC2DHR:8;    //08,DAC channel2 8-bit Right aligned data
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DOR1           0x00000000//0x02C
struct DAC_DOR1_BIT
{
	UINT32 DACC1DOR:12;   //00,DAC channel1 data output
	UINT32 Reserved0:16;  //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_DOR2           0x00000000//0x030
struct DAC_DOR2_BIT
{
	UINT32 DACC2DOR:12;   //00,DAC channel2 data output
	UINT32 Reserved0:16;  //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DAC_SR             0x00000000//0x030
struct DAC_SR_BIT
{
	UINT32 Reserved0:13;  //00,
	UINT32 DMAUDR1:1;     //13,DAC channel1 DMA underrun flag
	UINT32 Reserved1:15;  //14,
	UINT32 DMAUDR2:1;     //29,DAC channel2 DMA underrun flag
	UINT32 Reserved2:2;   //30,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define DAC_Struct Struct_DAC
typedef struct Struct_DAC
{
  union{UINT32 CR;struct DAC_CR_BIT CR_BIT;};
  union{UINT32 SWTRIGR;struct DAC_SWTRIGR_BIT SWTRIGR_BIT;};
  union{UINT32 DHR12R1;struct DAC_DHR12R1_BIT DHR12R1_BIT;};
  union{UINT32 DHR12L1;struct DAC_DHR12L1_BIT DHR12L1_BIT;};
  union{UINT32 DHR8R1;struct DAC_DHR8R1_BIT DHR8R1_BIT;};
  union{UINT32 DHR12R2;struct DAC_DHR12R2_BIT DHR12R2_BIT;};
  union{UINT32 DHR12L2;struct DAC_DHR12L2_BIT DHR12L2_BIT;};
  union{UINT32 DHR8R2;struct DAC_DHR8R2_BIT DHR8R2_BIT;};
  union{UINT32 DHR12RD;struct DAC_DHR12RD_BIT DHR12RD_BIT;};
  union{UINT32 DHR12LD;struct DAC_DHR12LD_BIT DHR12LD_BIT;};
  union{UINT32 DHR8RD;struct DAC_DHR8RD_BIT DHR8RD_BIT;};
  union{UINT32 DOR1;struct DAC_DOR1_BIT DOR1_BIT;};
  union{UINT32 DOR2;struct DAC_DOR2_BIT DOR2_BIT;};
  #if IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  union{UINT32 SR;struct DAC_SR_BIT SR_BIT;};
  #endif
} DAC_Type,Type_DAC;
