diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PT_DAC    ((volatile Type_DAC *)BASE_DAC)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define DAC_CR                  DAC.CR
#define DAC_SWTRIGR             DAC.SWTRIGR
#define DAC_DHR12R1             DAC.DHR12R1
#define DAC_DHR12L1             DAC.DHR12L1
#define DAC_DHR8R1              DAC.DHR8R1
#define DAC_DHR12R2             DAC.DHR12R2
#define DAC_DHR12L2             DAC.DHR12L2
#define DAC_DHR8R2              DAC.DHR8R2
#define DAC_DHR12RD             DAC.DHR12RD
#define DAC_DHR12LD             DAC.DHR12LD
#define DAC_DHR8RD              DAC.DHR8RD
#define DAC_DOR1                DAC.DOR1
#define DAC_DOR2                DAC.DOR2
#define DAC_SR                  DAC.SR
//==============================================================================================================================
#define RSTV_DMA_ISR            0x00000000//0x000
#define RSTV_DMA_IFCR           0x00000000//0x004
struct DMA_INT_BIT//0x000=ISR,0x004=IFCR
{
	UINT32 GIF1:1;        //00,Channel 1 Global interrupt flag
	UINT32 TCIF1:1;       //01,Channel 1 Transfer Complete flag
	UINT32 HTIF1:1;       //02,Channel 1 Half Transfer flag
	UINT32 TEIF1:1;       //03,Channel 1 Transfer Error flag
	UINT32 GIF2:1;        //04,Channel 2 Global interrupt flag
	UINT32 TCIF2:1;       //05,Channel 2 Transfer Complete flag
	UINT32 HTIF2:1;       //06,Channel 2 Half Transfer flag
	UINT32 TEIF2:1;       //07,Channel 2 Transfer Error flag
	UINT32 GIF3:1;        //08,Channel 3 Global interrupt flag
	UINT32 TCIF3:1;       //09,Channel 3 Transfer Complete flag
	UINT32 HTIF3:1;       //10,Channel 3 Half Transfer flag
	UINT32 TEIF3:1;       //11,Channel 3 Transfer Error flag
	UINT32 GIF4:1;        //12,Channel 4 Global interrupt flag
	UINT32 TCIF4:1;       //13,Channel 4 Transfer Complete flag
	UINT32 HTIF4:1;       //14,Channel 4 Half Transfer flag
	UINT32 TEIF4:1;       //15,Channel 4 Transfer Error flag
	UINT32 GIF5:1;        //16,Channel 5 Global interrupt flag
	UINT32 TCIF5:1;       //17,Channel 5 Transfer Complete flag
	UINT32 HTIF5:1;       //18,Channel 5 Half Transfer flag
	UINT32 TEIF5:1;       //19,Channel 5 Transfer Error flag
	UINT32 GIF6:1;        //20,Channel 6 Global interrupt flag
	UINT32 TCIF6:1;       //21,Channel 6 Transfer Complete flag
	UINT32 HTIF6:1;       //22,Channel 6 Half Transfer flag
	UINT32 TEIF6:1;       //23,Channel 6 Transfer Error flag
	UINT32 GIF7:1;        //24,Channel 7 Global interrupt flag
	UINT32 TCIF7:1;       //25,Channel 7 Transfer Complete flag
	UINT32 HTIF7:1;       //26,Channel 7 Half Transfer flag
	UINT32 TEIF7:1;       //27,Channel 7 Transfer Error flag
	UINT32 Reserved0:4;   //28,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DMA_CCR1           0x00000000//0x008
#define RSTV_DMA_CCR2           0x00000000//0x01C
#define RSTV_DMA_CCR3           0x00000000//0x030
#define RSTV_DMA_CCR4           0x00000000//0x044
#define RSTV_DMA_CCR5           0x00000000//0x058
#define RSTV_DMA_CCR6           0x00000000//0x06C
#define RSTV_DMA_CCR7           0x00000000//0x080
struct DMA_CCR_BIT//0x008=CCR1,CCR2,CCR3,CCR4,CCR5,CCR6,CCR7
{
	UINT32 EN:1;          //00,Channel enable:1=enable
	UINT32 TCIE:1;        //01,Transfer complete interrupt enable:1=enable
	UINT32 HTIE:1;        //02,Half Transfer interrupt enable:1=enable
	UINT32 TEIE:1;        //03,Transfer error interrupt enable:1=enable
	UINT32 DIR:1;         //04,Data transfer direction:0=read from peripheral,1=read from memory
	UINT32 CIRC:1;        //05,Circular mode:1=enable
	UINT32 PINC:1;        //06,Peripheral increment mode:1=enable
	UINT32 MINC:1;        //07,Memory increment mode:1=enable
	UINT32 PSIZE:2;       //08,PSIZE[1:0] bits (Peripheral size):0=8 bits,1=16 bits,2=32 bits,3=reserved
	UINT32 MSIZE:2;       //10,MSIZE[1:0] bits (Memory size):0=8 bits,1=16 bits,2=32 bits,3=reserved
	UINT32 PL:2;          //12,PL[1:0] bits(Channel Priority level):0=Low,1=Medium,2=High,3=Very High
	UINT32 MEM2MEM:1;     //14,Memory to memory mode:1=enable
	UINT32 Reserved0:17;  //15,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DMA_CNDTR1         0x00000000//0x00C
#define RSTV_DMA_CNDTR2         0x00000000//0x020
#define RSTV_DMA_CNDTR3         0x00000000//0x034
#define RSTV_DMA_CNDTR4         0x00000000//0x048
#define RSTV_DMA_CNDTR5         0x00000000//0x05C
#define RSTV_DMA_CNDTR6         0x00000000//0x070
#define RSTV_DMA_CNDTR7         0x00000000//0x084
#define RSTV_DMA_CNDTR          0x00000000
struct DMA_CNDTR_BIT//0x00C=CNDTR1,CNDTR2,CNDTR3,CNDTR4,CNDTR5,CNDTR6,CNDTR7
{
	UINT32 NDT:16;        //00,Number of data to Transfer
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DMA_CPAR1          0x00000000//0x010,Peripheral Address
#define RSTV_DMA_CPAR2          0x00000000//0x024,Peripheral Address
#define RSTV_DMA_CPAR3          0x00000000//0x038,Peripheral Address
#define RSTV_DMA_CPAR4          0x00000000//0x04C,Peripheral Address
#define RSTV_DMA_CPAR5          0x00000000//0x060,Peripheral Address
#define RSTV_DMA_CPAR6          0x00000000//0x074,Peripheral Address
#define RSTV_DMA_CPAR7          0x00000000//0x088,Peripheral Address
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DMA_CMAR1          0x00000000//0x014,Memory Address
#define RSTV_DMA_CMAR2          0x00000000//0x028,Memory Address
#define RSTV_DMA_CMAR3          0x00000000//0x03C,Memory Address
#define RSTV_DMA_CMAR4          0x00000000//0x050,Memory Address
#define RSTV_DMA_CMAR5          0x00000000//0x064,Memory Address
#define RSTV_DMA_CMAR6          0x00000000//0x078,Memory Address
#define RSTV_DMA_CMAR7          0x00000000//0x08C,Memory Address
//------------------------------------------------------------------------------------------------------------------------------
typedef struct DMACH
{
  union{UINT32 CCR;struct DMA_CCR_BIT CCR_BIT;};
  union{UINT32 CNDTR;struct DMA_CNDTR_BIT CNDTR_BIT;};
  union{UINT32 CPAR;Type_BIT32 CPAR_BIT;};
  union{UINT32 CMAR;Type_BIT32 CMAR_BIT;};
	UINT32 Reserved0[1];
} DMACH_Type,Type_DMACH;
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define DMA_Struct Struct_DMA
typedef struct Struct_DMA//0x40020000=DMA1,0x40020400=DMA2
{
  union{UINT32 ISR;struct DMA_INT_BIT ISR_BIT;};    //0x000,
  union{UINT32 IFCR;struct DMA_INT_BIT IFCR_BIT;};  //0x004,
	Type_DMACH CH[8];//0x008,Index:DMA[0]=0_6,DMA[1]=0_4
	UINT32 Reserved0[214]; //0x0A8,
} DMA_Type,Type_DMA;
#define PT_DMA1                 ((volatile Type_DMA *)BASE_DMA1)
#define PT_DMA2                 ((volatile Type_DMA *)BASE_DMA2)
#define PT_DMA(i)               ((volatile Type_DMA *)BASE_DMA(i))
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define DMA_ISR(i)              DMA[i].ISR//i=0_1
#define DMA_IFCR(i)             DMA[i].IFCR//i=0_1
#define DMA_CCR(i,j)            DMA[i].CH[j].CCR//i=0,j=0_6;i=1,j=0_4
#define DMA_CNDTR(i,j)          DMA[i].CH[j].CNDTR//i=0,j=0_6;i=1,j=0_4
#define DMA_CPAR(i,j)           DMA[i].CH[j].CPAR//i=0,j=0_6;i=1,j=0_4
#define DMA_CMAR(i,j)           DMA[i].CH[j].CMAR//i=0,j=0_6;i=1,j=0_4
//==============================================================================================================================
#define RSTV_ETH_MACCR          0x00000000//0x000
struct ETH_MACCR_BIT
{
	UINT32 Reserved0:2;   //00,
	UINT32 RE:1;          //02,Receiver enable
	UINT32 TE:1;          //03,Transmitter enable
	UINT32 DC:1;          //04,Defferal check
	UINT32 BL:2;          //05,Back-off limit: random integer number (r) of slot time delays before rescheduling
	                      //   a transmission attempt during retries after a collision: 0 =< r <2^k
	UINT32 APCS:1;        //07,Automatic Pad/CRC stripping
	UINT32 Reserved1:1;   //08,
	UINT32 RD:1;          //09,Retry disable
	UINT32 IPCO:1;        //10,IP Checksum offload
	UINT32 DM:1;          //11,Duplex mode
	UINT32 LM:1;          //12,loopback mode
	UINT32 ROD:1;         //13,Receive own disable
	UINT32 FES:1;         //14,Fast ethernet speed
	UINT32 Reserved2:1;   //15,
	UINT32 CSD:1;         //16,Carrier sense disable (during transmission)
	UINT32 IFG:3;         //17,Inter-frame gap
	UINT32 Reserved3:2;   //20,
	UINT32 JD:1;          //22,Jabber disable
	UINT32 WD:1;          //23,Watchdog disable
	UINT32 Reserved4:8;   //24,
};
#define ETH_MACCR_BL_10                 0//k = min (n, 10)
#define ETH_MACCR_BL_8                  1//k = min (n, 8)
#define ETH_MACCR_BL_4                  2//k = min (n, 4)
#define ETH_MACCR_BL_1                  3//k = min (n, 1)
#define ETH_MACCR_IFG_96Bit             0//Minimum IFG between frames during transmission is 96Bit
#define ETH_MACCR_IFG_88Bit             1//Minimum IFG between frames during transmission is 88Bit
#define ETH_MACCR_IFG_80Bit             2//Minimum IFG between frames during transmission is 80Bit
#define ETH_MACCR_IFG_72Bit             3//Minimum IFG between frames during transmission is 72Bit
#define ETH_MACCR_IFG_64Bit             4//Minimum IFG between frames during transmission is 64Bit      
#define ETH_MACCR_IFG_56Bit             5//Minimum IFG between frames during transmission is 56Bit
#define ETH_MACCR_IFG_48Bit             6//Minimum IFG between frames during transmission is 48Bit
#define ETH_MACCR_IFG_40Bit             7//Minimum IFG between frames during transmission is 40Bit 
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACFFR         0x00000000//0x004
struct ETH_MACFFR_BIT
{
	UINT32 PM:1;          //00,Promiscuous mode
	UINT32 HU:1;          //01,Hash unicast
	UINT32 HM:1;          //02,Hash multicast
	UINT32 DAIF :1;       //03,DA Inverse filtering
	UINT32 PAM:1;         //04,Pass all mutlicast
	UINT32 BFD:1;         //05,Broadcast frame disable
	UINT32 PCF:2;         //06,Pass control frames: 3 cases
	UINT32 SAIF:1;        //08,SA inverse filtering,<LDY>
	UINT32 SAF:1;         //09,Source address filter enable
	UINT32 HPF:1;         //10,Hash or perfect filter
	UINT32 Reserved0:20;  //11,
	UINT32 RA:1;          //31,Receive all
};
#define ETH_MACFFR_PCF_BlockAll         1//MAC filters all control frames from reaching the application
#define ETH_MACFFR_PCF_ForwardAll       2//MAC forwards all control frames to application even if they fail the Address Filter
#define ETH_MACFFR_PCF_FPAF             3//MAC forwards control frames that pass the Address Filter. 
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACHTHR        0x00000000//0x008,bit0_31=HTH=Hash table high
#define RSTV_ETH_MACHTLR        0x00000000//0x00C,bit0_31=HTL=Hash table low
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACMIIAR       0x00000000//0x010,Ethernet MAC MII Address Register
#define ETH_MACMIIAR_CR_Div42           0//HCLK:60-72 MHz; MDC clock= HCLK/42
#define ETH_MACMIIAR_CR_Div62           1//HCLK:60-72 MHz; MDC clock= HCLK/62
#define ETH_MACMIIAR_CR_Div16           2//HCLK:20-35 MHz; MDC clock= HCLK/16
#define ETH_MACMIIAR_CR_Div26           3//HCLK:35-60 MHz; MDC clock= HCLK/26
#define ETH_MACMIIAR_CR_Div102          4//HCLK:150-168 MHz; MDC clock= HCLK/102
struct ETH_MACMIIAR_BIT
{
	UINT32 MB:1;          //00,MII busy
	UINT32 MW:2;          //01,MII write
	UINT32 CR:3;          //02,CR clock range: 6 cases
	UINT32 Reserved0:1;   //05,
	UINT32 MR:5;          //06,MII register in the selected PHY
	UINT32 PA:5;          //11,Physical layer address
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACMIIDR       0x00000000//0x014
struct ETH_MACMIIDR_BIT
{
	UINT32 MD:16;         //00,MII data: read/write data from/to PHY
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACFCR         0x00000000//0x018
struct ETH_MACFCR_BIT
{
	UINT32 FCBBPA:1;      //00,Flow control busy/backpressure activate
	UINT32 TFCE:1;        //01,Transmit flow control enable
	UINT32 RFCE:1;        //02,Receive flow control enable
	UINT32 UPFD:1;        //03,Unicast pause frame detect
	UINT32 Reserved0:3;   //04,
	UINT32 ZQPD:1;        //07,Zero-quanta pause disable
	UINT32 Reserved1:8;   //08,
	UINT32 PT:16;         //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACVLANTR      0x00000000//0x01C
struct ETH_MACVLANTR_BIT
{
	UINT32 VLANTI:16;     //00,VLAN tag identifier (for receive frames)
	UINT32 VLANTC:1;      //16,12-bit VLAN tag comparison
	UINT32 Reserved0:15;  //17,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACRWUFFR      0x00000000//0x028,bit0_31=D=Wake-up frame filter register data,reg0_reg7
struct ETH_MACRWUFFR_BIT
{
	UINT32 REG0:4;        //00,Filter 0 Byte Mask
	UINT32 REG1:4;        //04,Filter 1 Byte Mask
	UINT32 REG2:4;        //08,Filter 2 Byte Mask
	UINT32 REG3:4;        //12,Filter 3 Byte Mask
	UINT32 REG4:4;        //16,RSVD - Filter3 Command - RSVD - Filter2 Command -RSVD - Filter1 Command - RSVD - Filter0 Command
	UINT32 REG5:4;        //20,Filter3 Offset - Filter2 Offset - Filter1 Offset - Filter0 Offset
	UINT32 REG6:4;        //24,Filter1 CRC16 - Filter0 CRC16
	UINT32 REG7:4;        //28,Filter3 CRC16 - Filter2 CRC16
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACPMTCSR      0x00000000//0x02C,MAC PMT Control and Status Register
struct ETH_MACPMTCSR_BIT
{
	UINT32 PD:1;          //00,Power Down
	UINT32 MPE:1;         //01,Magic Packet Enable
	UINT32 WFE:1;         //02,Wake-Up Frame Enable
	UINT32 Reserved0:2;   //03,
	UINT32 MPR:1;         //05,Magic Packet Received
	UINT32 WFR:1;         //06,Wake-Up Frame Received
	UINT32 Reserved1:2;   //07,
	UINT32 GU:1;          //09,Global Unicast
	UINT32 Reserved2:21;  //10,
	UINT32 WFFRPR:1;      //31,Wake-Up Frame Filter Register Pointer Reset
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACSR          0x00000000//0x038,Ethernet MAC Status Register
struct ETH_MACSR_BIT
{
	UINT32 Reserved0:3;   //00,
	UINT32 PMTS:1;        //03,PMT status
	UINT32 MMCS:1;        //04,MMC status
	UINT32 MMMCRS:1;      //05,MMC receive status
	UINT32 MMCTS:1;       //06,MMC transmit status
	UINT32 Reserved1:2;   //07,
	UINT32 TSTS:1;        //09,Time stamp trigger status
	UINT32 Reserved2:22;  //10,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACIMR         0x00000000//0x03C,Ethernet MAC Interrupt Mask Register
struct ETH_MACIMR_BIT
{
	UINT32 Reserved0:3;   //00,
	UINT32 PMTIM:1;       //03,PMT interrupt mask
	UINT32 Reserved1:5;   //04,
	UINT32 TSTIM:1;       //09,Time stamp trigger interrupt mask
	UINT32 Reserved2:22;  //10,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACA0LR        0xFFFFFFFF//0x044,MAC address0 low
#define RSTV_ETH_MACA1LR        0xFFFFFFFF//0x04C,MAC address1 low
#define RSTV_ETH_MACA2LR        0xFFFFFFFF//0x054,MAC address2 low
#define RSTV_ETH_MACA3LR        0xFFFFFFFF//0x05C,MAC address3 low
#define RSTV_ETH_MACALR         0xFFFFFFFF
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACA0HR        0x00000000//0x040,MAC address0 high
struct ETH_MACA0HR_BIT
{
	UINT32 MACA0H:16;     //00,
	UINT32 Reserved0:15;  //16,
	UINT32 MO:1;          //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MACA1HR        0x0000FFFF//0x048,MAC address1 high
#define RSTV_ETH_MACA2HR        0x0000FFFF//0x050,MAC address1 high
#define RSTV_ETH_MACA3HR        0x0000FFFF//0x058,MAC address1 high
#define RSTV_ETH_MACAHR         0x0000FFFF
struct ETH_MACA123HR_BIT//MACA1HR,MACA2HR,MACA3HR
{
	UINT32 MACAH:16;      //00,MAC address high
	UINT32 Reserved0:8;   //16,
	UINT32 MBC:6;         //24,Mask byte control: bits to mask for comparison of the MAC Address bytes,<LDY>
	UINT32 SA:1;          //30,Source address
	UINT32 AE:1;          //31,Address enable
};
#define ETH_MACAHR_MBC_HBits15_8        0x20//Mask MAC Address high reg bits [15:8]
#define ETH_MACAHR_MBC_HBits7_0         0x10//Mask MAC Address high reg bits [7:0]
#define ETH_MACAHR_MBC_LBits31_24       0x08//Mask MAC Address low reg bits [31:24]
#define ETH_MACAHR_MBC_LBits23_16       0x04//Mask MAC Address low reg bits [23:16]
#define ETH_MACAHR_MBC_LBits15_8        0x02//Mask MAC Address low reg bits [15:8]
#define ETH_MACAHR_MBC_LBits7_0         0x01//Mask MAC Address low reg bits [7:0] 
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MMCCR          0x00000000//0x100,Ethernet MMC Contol Register
struct ETH_MMCCR_BIT
{
	UINT32 CR:1;          //00,Counters Reset
	UINT32 CSR:1;         //01,Counter Stop Rollover
	UINT32 ROR:1;         //02,Reset on Read
	UINT32 MCF:1;         //03,MMC Counter Freeze
	UINT32 Reserved0:28;  //04,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MMCRIR         0x00000000//0x104,Ethernet MMC Receive Interrupt Register
#define RSTV_ETH_MMCRIMR        0x00000000//0x10C,Ethernet MMC Receive Interrupt mask Register
struct ETH_MMCRI_BIT//0x104=MMCRIR,0x10C=MMCRIMR
{
	UINT32 Reserved0:5;   //00,
	UINT32 RFCE:1;        //05,Set/Mask when Rx crc error counter reaches half the maximum value
	UINT32 RFAE:1;        //06,Set/Mask when Rx alignment error counter reaches half the maximum value
	UINT32 Reserved1:10;  //07,
	UINT32 RGUF:1;        //17,Set/Mask when Rx good unicast frames counter reaches half the maximum value
	UINT32 Reserved2:14;  //18,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MMCTIR         0x00000000//0x108,Ethernet MMC Transmit Interrupt Register
#define RSTV_ETH_MMCTIMR        0x00000000//0x110,Ethernet MMC Transmit Interrupt mask Register
struct ETH_MMCTI_BIT//0x108=MMCTIR,0x010=MMCTIMR
{
	UINT32 Reserved0:14;  //00,
	UINT32 TGFSC:1;       //14,Set/Mask when Tx good single col counter reaches half the maximum value
	UINT32 TGFMSC:1;      //15,Set/Mask when Tx good multi col counter reaches half the maximum value
	UINT32 Reserved1:5;   //16,
	UINT32 TGF:1;         //21,Set/Mask when Tx good frame count counter reaches half the maximum value
	UINT32 Reserved2:10;  //22,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_MMCTGFSCCR     0x00000000//0x14C,bit0_31=TGFSCC=Number of successfully transmitted frames after a single collision in Half-duplex mode
#define RSTV_ETH_MMCTGFMSCCR    0x00000000//0x150,bit0_31=TGFMSCC=Number of successfully transmitted frames after more than a single collision in Half-duplex mode
#define RSTV_ETH_MMCTGFCR       0x00000000//0x168,bit0_31=TGFC=Number of good frames transmitted
#define RSTV_ETH_MMCRFCECR      0x00000000//0x194,bit0_31=RFCEC=Number of frames received with CRC error
#define RSTV_ETH_MMCRFAECR      0x00000000//0x198,bit0_31=RFAEC=Number of frames received with alignment (dribble) error
#define RSTV_ETH_MMCRGUFCR      0x00000000//0x1C4,bit0_31=RGUFC=Number of good unicast frames received
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_PTPTSCR        0x00000000//0x700,Ethernet PTP Time Stamp Contol Register
struct ETH_PTPTSCR_BIT
{
	UINT32 TSE:1;         //00,Time stamp enable
	UINT32 TSFCU:1;       //01,Time stamp fine or coarse update
	UINT32 TSSTI:1;       //02,Time stamp initialize
	UINT32 TSSTU:1;       //03,Time stamp update
	UINT32 TSITE:1;       //04,Time stamp interrupt trigger enable
	UINT32 TSARU:1;       //05,Addend register update
	UINT32 Reserved0:26;  //06,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_PTPSSIR        0x00000000//0x704,Ethernet PTP Sub-Second Increment Register
struct ETH_PTPSSIR_BIT
{
	UINT32 STSSI:8;      //00,System time Sub-second increment value
	UINT32 Reserved0:24; //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_PTPTSHR        0x00000000//0x708,bit0_31=STS=System Time second,Ethernet PTP Time Stamp High Register
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_PTPTSLR        0x00000000//0x70C,Ethernet PTP Time Stamp Low Register
struct ETH_PTPTSLR_BIT
{
	UINT32 STSS:31;       //00,System Time sub-seconds
	UINT32 STPNS:1;       //31,System Time Positive or negative time
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_PTPTSHUR       0x00000000//0x710,bit0_31=TSUS=Time stamp update seconds,Ethernet PTP Time Stamp High Update Register
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_PTPTSLUR       0x00000000//0x714,Ethernet PTP Time Stamp Low Update Register
struct ETH_PTPTSLUR_BIT
{
	UINT32 TSUSS:31;      //00,Time stamp update sub-seconds
	UINT32 TSUPNS:1;      //31,Time stamp update Positive or negative time
};
