diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_PTPTSAR        0x00000000//0x718,bit0_31=TSA=Time stamp addend,Ethernet PTP Time Stamp Addend Register
#define RSTV_ETH_PTPTTHR        0x00000000//0x71C,bit0_31=TTSH=Target time stamp high,Ethernet PTP Target Time High Register
#define RSTV_ETH_PTPTTLR        0x00000000//0x720,bit0_31=TTSL=Target time stamp low,Ethernet PTP Target Time Low Register
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_DMABMR         0x00000000//0x1000,Ethernet DMA Bus Mode Register
struct ETH_DMABMR_BIT
{
	UINT32 SR:1;          //00,Software reset
	UINT32 DA:1;          //01,DMA arbitration scheme
	UINT32 DSL:5;         //02,Descriptor Skip Length
	UINT32 Reserved0:1;   //07,
	UINT32 PBL:6;         //8,Programmable burst length
	UINT32 RTPR:2;        //14,Rx Tx priority ratio
	UINT32 FB:1;          //16,Fixed Burst
	UINT32 RDP:6;         //17,RxDMA PBL
	UINT32 USP:1;         //23,Use separate PBL
	UINT32 FPM:1;         //24,4xPBL mode
	UINT32 AAB:1;         //25,Address-Aligned beats
	UINT32 Reserved2:6;   //26,
};
#define ETH_DMABMR_RDP_1Beat            0x01//maximum number of beats to be transferred in one RxDMA transaction is 1,FPM=1=*4
#define ETH_DMABMR_RDP_2Beat            0x02//maximum number of beats to be transferred in one RxDMA transaction is 2,FPM=1=*4
#define ETH_DMABMR_RDP_4Beat            0x04//maximum number of beats to be transferred in one RxDMA transaction is 4,FPM=1=*4
#define ETH_DMABMR_RDP_8Beat            0x08//maximum number of beats to be transferred in one RxDMA transaction is 8,FPM=1=*4
#define ETH_DMABMR_RDP_16Beat           0x10//maximum number of beats to be transferred in one RxDMA transaction is 16,FPM=1=*4
#define ETH_DMABMR_RDP_32Beat           0x20//maximum number of beats to be transferred in one RxDMA transaction is 32,FPM=1=*4
#define ETH_DMABMR_RTPR_1_1             0//Rx Tx priority ratio
#define ETH_DMABMR_RTPR_2_1             1//Rx Tx priority ratio
#define ETH_DMABMR_RTPR_3_1             2//Rx Tx priority ratio
#define ETH_DMABMR_RTPR_4_1             3//Rx Tx priority ratio  
#define ETH_DMABMR_PBL_1Beat            0x01//maximum number of beats to be transferred in one TxDMA (or both) transaction is 1,FPM=1=*4
#define ETH_DMABMR_PBL_2Beat            0x02//maximum number of beats to be transferred in one TxDMA (or both) transaction is 2,FPM=1=*4
#define ETH_DMABMR_PBL_4Beat            0x04//maximum number of beats to be transferred in one TxDMA (or both) transaction is 4,FPM=1=*4
#define ETH_DMABMR_PBL_8Beat            0x08//maximum number of beats to be transferred in one TxDMA (or both) transaction is 8,FPM=1=*4
#define ETH_DMABMR_PBL_16Beat           0x10//maximum number of beats to be transferred in one TxDMA (or both) transaction is 16,FPM=1=*4
#define ETH_DMABMR_PBL_32Beat           0x20//maximum number of beats to be transferred in one TxDMA (or both) transaction is 32,FPM=1=*4               
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_DMATPDR        0x00000000//0x1004,bit0_31=TPD=Transmit poll demand,Ethernet DMA Transmit Poll Demand Register
#define RSTV_ETH_DMARPDR        0x00000000//0x1008,bit0_31=RPD=Receive poll demand,Ethernet DMA Receive Poll Demand Register
#define RSTV_ETH_DMARDLAR       0x00000000//0x100C,bit0_31=SRL=Start of receive list
#define RSTV_ETH_DMATDLAR       0x00000000//0x1010,bit0_31=STL=Start of transmit list
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_DMASR          0x00000000//0x1014
struct ETH_DMASR_BIT
{
	UINT32 TS:1;          //00,Transmit status
	UINT32 TPSS:1;        //01,Transmit process stopped status
	UINT32 TBUS:1;        //02,Transmit buffer unavailable status
	UINT32 TJTS:1;        //03,Transmit jabber timeout status
	UINT32 ROS:1;         //04,Receive overflow status
	UINT32 TUS:1;         //05,Transmit underflow status
	UINT32 RS:1;          //06,Receive status
	UINT32 RBUS:1;        //07,Receive buffer unavailable status
	UINT32 RPSS:1;        //08,Receive process stopped status
	UINT32 RWTS:1;        //09,Receive watchdog timeout status
	UINT32 ETS:1;         //10,Early transmit status
	UINT32 Reserved0:2;   //11,
	UINT32 FBES:1;        //13,Fatal bus error status
	UINT32 ERS:1;         //14,Early receive status
	UINT32 AIS:1;         //15,Abnormal interrupt summary
	UINT32 NIS:1;         //16,Normal interrupt summary
	UINT32 RPS:3;         //17,Receive process state
	UINT32 TPS:3;         //20,Transmit process state
	UINT32 EBS:3;         //23,Error bits status
	UINT32 Reserved1:1;   //26,
	UINT32 MMCS:1;        //27,MMC status
	UINT32 PMTS:1;        //28,PMT status
	UINT32 TSTS:1;        //29,Time-stamp trigger status
	UINT32 Reserved2:2;   //30,
};
#define ETH_DMASR_RPS_Stopped           0//Stopped - Reset or Stop Rx Command issued
#define ETH_DMASR_RPS_Fetching          1//Running - fetching the Rx descriptor
#define ETH_DMASR_RPS_Waiting           3//Running - waiting for packet
#define ETH_DMASR_RPS_Suspended         4//Suspended - Rx Descriptor unavailable
#define ETH_DMASR_RPS_Closing           5//Running - closing descriptor
#define ETH_DMASR_RPS_Queuing           7//Running - queuing the recieve frame into host memory
#define ETH_DMASR_TPS_Stopped           0//Stopped - Reset or Stop Tx Command issued
#define ETH_DMASR_TPS_Fetching          1//Running - fetching the Tx descriptor
#define ETH_DMASR_TPS_Waiting           2//Running - waiting for status
#define ETH_DMASR_TPS_Reading           3//Running - reading the data from host memory
#define ETH_DMASR_TPS_Suspended         6//Suspended - Tx Descriptor unavailabe
#define ETH_DMASR_TPS_Closing           7//Running - closing Rx descriptor
#define ETH_DMASR_EBS_DescAccess        4//Error bits 0-data buffer, 1-desc. access
#define ETH_DMASR_EBS_ReadTransf        2//Error bits 0-write trnsf, 1-read transfr
#define ETH_DMASR_EBS_DataTransfTx      1//Error bits 0-Rx DMA, 1-Tx DMA
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_DMAOMR         0x00000000//0x1018
struct ETH_DMAOMR_BIT
{
	UINT32 Reserved0:1;   //00,
	UINT32 SR:1;          //01,Start/stop receive
	UINT32 OSF:1;         //02,operate on second frame
	UINT32 RTC:2;         //03,receive threshold control
	UINT32 Reserved1:1;   //05,
	UINT32 FUGF:1;        //06,Forward undersized good frames
	UINT32 FEF:1;         //07,Forward error frames
	UINT32 Reserved2:5;   //08,
	UINT32 ST:1;          //13,Start/stop transmission command
	UINT32 TTC:3;         //14,Transmit threshold control
	UINT32 Reserved3:3;   //17,
	UINT32 FTF:1;         //20,Flush transmit FIFO
	UINT32 TSF:1;         //21,Transmit store and forward
	UINT32 Reserved4:2;   //22,
	UINT32 DFRF:1;        //24,Disable flushing of received frames
	UINT32 RSF:1;         //25,Receive store and forward
	UINT32 DTCEFD:1;      //26,Disable Dropping of TCP/IP checksum error frames
	UINT32 Reserved5:5;   //27,
};
#define ETH_DMAOMR_RTC_64Bytes           0//threshold level of the MTL Receive FIFO is 64 Bytes
#define ETH_DMAOMR_RTC_32Bytes           1//threshold level of the MTL Receive FIFO is 32 Bytes
#define ETH_DMAOMR_RTC_96Bytes           2//threshold level of the MTL Receive FIFO is 96 Bytes
#define ETH_DMAOMR_RTC_128Bytes          3//threshold level of the MTL Receive FIFO is 128 Bytes
#define ETH_DMAOMR_TTC_64Bytes           0//threshold level of the MTL Transmit FIFO is 64 Bytes
#define ETH_DMAOMR_TTC_128Bytes          1//threshold level of the MTL Transmit FIFO is 128 Bytes
#define ETH_DMAOMR_TTC_192Bytes          2//threshold level of the MTL Transmit FIFO is 192 Bytes
#define ETH_DMAOMR_TTC_256Bytes          3//threshold level of the MTL Transmit FIFO is 256 Bytes
#define ETH_DMAOMR_TTC_40Bytes           4//threshold level of the MTL Transmit FIFO is 40 Bytes
#define ETH_DMAOMR_TTC_32Bytes           5//threshold level of the MTL Transmit FIFO is 32 Bytes
#define ETH_DMAOMR_TTC_24Bytes           6//threshold level of the MTL Transmit FIFO is 24 Bytes
#define ETH_DMAOMR_TTC_16Bytes           7//threshold level of the MTL Transmit FIFO is 16 Bytes
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_DMAIER         0x00000000//0x101C
struct ETH_DMAIER_BIT
{
	UINT32 TIE:1;         //00,Transmit interrupt enable
	UINT32 TPSIE:1;       //01,Transmit process stopped interrupt enable
	UINT32 TBUIE:1;       //02,Transmit buffer unavailable interrupt enable
	UINT32 TJTIE:1;       //03,Transmit jabber timeout interrupt enable
	UINT32 ROIE:1;        //04,Receive Overflow interrupt enable
	UINT32 TUIE:1;        //05,Transmit Underflow interrupt enable
	UINT32 RIE:1;         //06,Receive interrupt enable
	UINT32 RBUIE:1;       //07,Receive buffer unavailable interrupt enable
	UINT32 RPSIE:1;       //08,Receive process stopped interrupt enable
	UINT32 RWTIE:1;       //09,Receive watchdog timeout interrupt enable
	UINT32 ETIE:1;        //10,Early transmit interrupt enable
	UINT32 Reserved0:2;   //11,
	UINT32 FBEIE:1;       //13,Fatal bus error interrupt enable
	UINT32 ERIE:1;        //14,Early receive interrupt enable
	UINT32 AISE:1;        //15,Abnormal interrupt summary enable
	UINT32 NISE:1;        //16,Normal interrupt summary enable
	UINT32 Reserved1:15;  //17,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_DMAMFBOCR      0x00000000//0x1020,Ethernet DMA Missed Frame and Buffer Overflow Counter Register
struct ETH_DMAMFBOCR_BIT
{
	UINT32 MFC:16;        //00,Number of frames missed by the controller
	UINT32 OMFC:1;        //16,Overflow bit for missed frame counter
	UINT32 MFA:11;        //17,Number of frames missed by the application
	UINT32 OFOC:1;        //28,Overflow bit for FIFO overflow counter
	UINT32 Reserved0:3;   //29,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETH_DMACHTDR       0x00000000//0x1048,bit0_31=HTDAP=Host transmit descriptor address pointer
#define RSTV_ETH_DMACHRDR       0x00000000//0x104C,bit0_31=HRDAP=Host receive descriptor address pointer
#define RSTV_ETH_DMACHTBAR      0x00000000//0x1050,bit0_31=HTBAP=Host transmit buffer address pointer
#define RSTV_ETH_DMACHRBAR      0x00000000//0x1054,bit0_31=HRBAP=Host receive buffer address pointer
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define ETH_Struct Struct_ETH
typedef struct Struct_ETH//0x40028000
{
  union{UINT32 MACCR;struct ETH_MACCR_BIT MACCR_BIT;};          //0x000(RW),Ethernet MAC Control Register register
  union{UINT32 MACFFR;struct ETH_MACFFR_BIT MACFFR_BIT;};       //0x004(RW),Ethernet MAC Frame Filter Register
  union{UINT32 MACHTHR;Type_BIT32 MACHTHR_BIT;};                //0x008(RW),Ethernet MAC Hash Table High Register
  union{UINT32 MACHTLR;Type_BIT32 MACHTLR_BIT;};                //0x00C(RW),Ethernet MAC Hash Table Low Register
  union{UINT32 MACMIIAR;struct ETH_MACMIIAR_BIT MACMIIAR_BIT;}; //0x010(RW),Ethernet MAC MII Address Register
  union{UINT32 MACMIIDR;struct ETH_MACMIIDR_BIT MACMIIDR_BIT;}; //0x014(RW),Ethernet MAC MII Data Register
  union{UINT32 MACFCR;struct ETH_MACFCR_BIT MACFCR_BIT;};       //0x018(RW),Ethernet MAC Flow Control Register
  union{UINT32 MACVLANTR;struct ETH_MACVLANTR_BIT MACVLANTR_BIT;};//0x01C(RW),Ethernet MAC VLAN Tag Register
  UINT32 Reserved0[2];  //0x020(R),
  union{UINT32 MACRWUFFR;struct ETH_MACRWUFFR_BIT MACRWUFFR_BIT;};//0x028(RW),Ethernet MAC Remote Wake-UpFrame Filter Register
  union{UINT32 MACPMTCSR;struct ETH_MACPMTCSR_BIT MACPMTCSR_BIT;};//0x02C(RW),MAC PMT Control and Status Register
  UINT32 Reserved1[2];  //0x030(R),
  union{UINT32 MACSR;struct ETH_MACSR_BIT MACSR_BIT;};          //0x038(RW),Ethernet MAC Status Register
  union{UINT32 MACIMR;struct ETH_MACIMR_BIT MACIMR_BIT;};       //0x03C(RW),Ethernet MAC Interrupt Mask Register
  union{UINT32 MACA0HR;struct ETH_MACA0HR_BIT MACA0HR_BIT;};    //0x040(RW),MAC address0 high
  union{UINT32 MACA0LR;Type_BIT32 MACA0LR_BIT;};                //0x044(RW),MAC address0 low
  union{UINT32 MACA1HR;struct ETH_MACA123HR_BIT MACA1HR_BIT;};  //0x048(RW),MAC address1 high
  union{UINT32 MACA1LR;Type_BIT32 MACA1LR_BIT;};                //0x04C(RW),MAC address1 low
  union{UINT32 MACA2HR;struct ETH_MACA123HR_BIT MACA2HR_BIT;};  //0x050(RW),MAC address2 high
  union{UINT32 MACA2LR;Type_BIT32 MACA2LR_BIT;};                //0x054(RW),MAC address2 low
  union{UINT32 MACA3HR;struct ETH_MACA123HR_BIT MACA3HR_BIT;};  //0x058(RW),MAC address3 high
  union{UINT32 MACA3LR;Type_BIT32 MACA3LR_BIT;};                //0x05C(RW),MAC address3 low
  UINT32 Reserved2[40]; //0x060(R),
  union{UINT32 MMCCR;struct ETH_MMCCR_BIT MMCCR_BIT;};          //0x100(RW),Ethernet MMC Contol Register
  union{UINT32 MMCRIR;struct ETH_MMCRI_BIT MMCRIR_BIT;};        //0x104(RW),Ethernet MMC Receive Interrupt Register
  union{UINT32 MMCTIR;struct ETH_MMCTI_BIT MMCTIR_BIT;};        //0x108(RW),Ethernet MMC Transmit Interrupt Register
  union{UINT32 MMCRIMR;struct ETH_MMCRI_BIT MMCRIMR_BIT;};      //0x10C(RW),Ethernet MMC Receive Interrupt Mask Register
  union{UINT32 MMCTIMR;struct ETH_MMCTI_BIT MMCTIMR_BIT;};      //0x110(RW),Ethernet MMC Transmit Interrupt Mask Register
  UINT32 Reserved3[14]; //0x114(R),
  union{UINT32 MMCTGFSCCR;Type_BIT32 MMCTGFSCCR_BIT;};          //0x14C(RW),Ethernet MMC Transmitted Good Frames after Single Collision Counter Register
  union{UINT32 MMCTGFMSCCR;Type_BIT32 MMCTGFMSCCR_BIT;};        //0x150(RW),Ethernet MMC Transmitted Good Frames after More than a Single Collision Counter Register
  UINT32 Reserved4[5];  //0x154(R),
  union{UINT32 MMCTGFCR;Type_BIT32 MMCTGFCR_BIT;};              //0x168(RW),Ethernet MMC Transmitted Good Frames Counter Register
  UINT32 Reserved5[10]; //0x16C(R),
  union{UINT32 MMCRFCECR;Type_BIT32 MMCRFCECR_BIT;};            //0x194(RW),Ethernet MMC Received Frames with CRC Error Counter Register
  union{UINT32 MMCRFAECR;Type_BIT32 MMCRFAECR_BIT;};            //0x198(RW),Ethernet MMC Received Frames with Alignement Error Counter Register
  UINT32 Reserved6[10]; //0x19C(R),
  union{UINT32 MMCRGUFCR;Type_BIT32 MMCRGUFCR_BIT;};            //0x1C4(RW),Ethernet MMC Received Good Unicast Frames Counter Register
  UINT32 Reserved7[334]; //0x1C8(R),
  union{UINT32 PTPTSCR;struct ETH_PTPTSCR_BIT PTPTSCR_BIT;};    //0x700(RW),Ethernet PTP Time Stamp Contol Register
  union{UINT32 PTPSSIR;struct ETH_PTPSSIR_BIT PTPSSIR_BIT;};    //0x704(RW),Ethernet PTP Sub-Second Increment Register
  union{UINT32 PTPTSHR;Type_BIT32 PTPTSHR_BIT;};                //0x708(RW),Ethernet PTP Time Stamp High Register
  union{UINT32 PTPTSLR;struct ETH_PTPTSLR_BIT PTPTSLR_BIT;};    //0x70C(RW),Ethernet PTP Time Stamp Low Register
  union{UINT32 PTPTSHUR;Type_BIT32 PTPTSHUR_BIT;};              //0x710(RW),Ethernet PTP Time Stamp High Update Register
  union{UINT32 PTPTSLUR;struct ETH_PTPTSLUR_BIT PTPTSLUR_BIT;}; //0x714(RW),Ethernet PTP Time Stamp Low Update Register
  union{UINT32 PTPTSAR;Type_BIT32 PTPTSAR_BIT;};                //0x718(RW),Ethernet PTP Time Stamp Addend Register
  union{UINT32 PTPTTHR;Type_BIT32 PTPTTHR_BIT;};                //0x71C(RW),Ethernet PTP Target Time High Register
  union{UINT32 PTPTTLR;Type_BIT32 PTPTTLR_BIT;};                //0x720(RW),Ethernet PTP Target Time Low Register
  UINT32 Reserved8[567];//0x724(R),
  union{UINT32 DMABMR;struct ETH_DMABMR_BIT DMABMR_BIT;};       //0x1000(RW),Ethernet DMA Bus Mode Register
  union{UINT32 DMATPDR;Type_BIT32 DMATPDR_BIT;};                //0x1004(RW),Ethernet DMA Transmit Poll Demand Register
  union{UINT32 DMARPDR;Type_BIT32 DMARPDR_BIT;};                //0x1008(RW),Ethernet DMA Receive Poll Demand Register
  union{UINT32 DMARDLAR;Type_BIT32 DMARDLAR_BIT;};              //0x100C(RW),Ethernet DMA Receive Descriptor List Address Register
  union{UINT32 DMATDLAR;Type_BIT32 DMATDLAR_BIT;};              //0x1010(RW),Ethernet DMA Transmit Descriptor List Address Register
  union{UINT32 DMASR;struct ETH_DMASR_BIT DMASR_BIT;};          //0x1014(RW),Ethernet DMA Status Register
  union{UINT32 DMAOMR;struct ETH_DMAOMR_BIT DMAOMR_BIT;};       //0x1018(RW),Ethernet DMA Operation Mode Register
  union{UINT32 DMAIER;struct ETH_DMAIER_BIT DMAIER_BIT;};       //0x101C(RW),Ethernet DMA Interrupt Enable Register
  union{UINT32 DMAMFBOCR;struct ETH_DMAMFBOCR_BIT DMAMFBOCR_BIT;};//0x1020(RW),Ethernet DMA Missed Frame and Buffer Overflow Counter Register
  UINT32 Reserved9[9];   //0x1024(R),
  union{UINT32 DMACHTDR;Type_BIT32 DMACHTDR_BIT;};              //0x1048(RW),Ethernet DMA Current Host Transmit Descriptor Register
  union{UINT32 DMACHRDR;Type_BIT32 DMACHRDR_BIT;};              //0x104C(RW),Ethernet DMA Current Host Receive Descriptor Register
  union{UINT32 DMACHTBAR;Type_BIT32 DMACHTBAR_BIT;};            //0x1050(RW),Ethernet DMA Current Host Transmit Buffer Address Register
  union{UINT32 DMACHRBAR;Type_BIT32 DMACHRBAR_BIT;};            //0x1054(RW),Ethernet DMA Current Host Receive Buffer Address Register
} ETH_Type,Type_ETH;
#define PT_ETH                  ((volatile Type_ETH *)BASE_ETH)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define ETH_MACCR               ETH.MACCR
#define ETH_MACFFR              ETH.MACFFR
#define ETH_MACHTHR             ETH.MACHTHR
#define ETH_MMACHTLR            ETH.MACHTLR
#define ETH_MACMIIAR            ETH.MACMIIAR
#define ETH_MACMIIDR            ETH.MACMIIDR
#define ETH_MACFCR              ETH.MACFCR
#define ETH_MACVLANTR           ETH.MACVLANTR
#define ETH_MACRWUFFR           ETH.MACRWUFFR
#define ETH_MACPMTCSR           ETH.MACPMTCSR
#define ETH_MACSR               ETH.MACSR
#define ETH_MACIMR              ETH.MACIMR
#define ETH_MACA0HR             ETH.MACA0HR
#define ETH_MACA0LR             ETH.MACA0LR
#define ETH_MACA1HR             ETH.MACA1HR
#define ETH_MACA1LR             ETH.MACA1LR
#define ETH_MACA2HR             ETH.MACA2HR
#define ETH_MACA2LR             ETH.MACA2LR
#define ETH_MACA3HR             ETH.MACA3HR
#define ETH_MACA3LR             ETH.MACA3LR
#define ETH_MMCCR               ETH.MMCCR
#define ETH_MMCRIR              ETH.MMCRIR
#define ETH_MMCTIR              ETH.MMCTIR
#define ETH_MMCRIMR             ETH.MMCRIMR
#define ETH_MMCTIMR             ETH.MMCTIMR
#define ETH_MMCTGFSCCR          ETH.MMCTGFSCCR
#define ETH_MMCTGFMSCCR         ETH.MMCTGFMSCCR
#define ETH_MMCTGFCR            ETH.MMCTGFCR
#define ETH_MMCRFCECR           ETH.MMCRFCECR
#define ETH_MMCRFAECR           ETH.MMCRFAECR
#define ETH_MMCRGUFCR           ETH.MMCRGUFCR
#define ETH_PTPTSCR             ETH.PTPTSCR
#define ETH_PTPSSIR             ETH.PTPSSIR
#define ETH_PTPTSHR             ETH.PTPTSHR
#define ETH_PTPTSLR             ETH.PTPTSLR
#define ETH_PTPTSHUR            ETH.PTPTSHUR
#define ETH_PTPTSLUR            ETH.PTPTSLUR
#define ETH_PTPTSAR             ETH.PTPTSAR
#define ETH_PTPTTHR             ETH.PTPTTHR
#define ETH_PTPTTLR             ETH.PTPTTLR
#define ETH_DMABMR              ETH.DMABMR
#define ETH_DMATPDR             ETH.DMATPDR
#define ETH_DMARPDR             ETH.DMARPDR
#define ETH_DMARDLAR            ETH.DMARDLAR
#define ETH_DMATDLAR            ETH.DMATDLAR
#define ETH_DMASR               ETH.DMASR
#define ETH_DMAOMR              ETH.DMAOMR
#define ETH_DMAIER              ETH.DMAIER
#define ETH_DMAMFBOCR           ETH.DMAMFBOCR
#define ETH_DMACHTDR            ETH.DMACHTDR
#define ETH_DMACHRDR            ETH.DMACHRDR
#define ETH_DMACHTBAR           ETH.DMACHTBAR
#define ETH_DMACHRBAR           ETH.DMACHRBAR
//==============================================================================================================================
#define RSTV_EXTI_IMR             0x00000000//0x000,bit0_19=Interrupt Mask on line 0_19
#define RSTV_EXTI_EMR             0x00000000//0x004,bit0_19=Event Mask on line 0_19
#define RSTV_EXTI_RTSR            0x00000000//0x008,bit0_19=Rising trigger event configuration bit of line 0_19
#define RSTV_EXTI_FTSR            0x00000000//0x00C,bit0_19=Falling trigger event configuration bit of line 0_19
#define RSTV_EXTI_SWIER           0x00000000//0x010,bit0_19=Software Interrupt on line 0_19
#define RSTV_EXTI_PR              0x00000000//0x014,bit0_19=Pending bit for line 0_19
struct EXTI_R_BIT//0x000=IMR,EMR,RTSR,FTSR,SWIER,PR
{
	UINT32 B0:1;          //00,
	UINT32 B1:1;          //01,
	UINT32 B2:1;          //02,
	UINT32 B3:1;          //03,
	UINT32 B4:1;          //04,
	UINT32 B5:1;          //05,
	UINT32 B6:1;          //06,
	UINT32 B7:1;          //07,
	UINT32 B8:1;          //08,
	UINT32 B9:1;          //09,
	UINT32 B10:1;         //10,
	UINT32 B11:1;         //11,
	UINT32 B12:1;         //12,
	UINT32 B13:1;         //13,
	UINT32 B14:1;         //14,
	UINT32 B15:1;         //15,
	UINT32 B16:1;         //16,
	UINT32 B17:1;         //17,
	UINT32 B18:1;         //18,
	UINT32 B19:1;         //19,
	UINT32 Reserved0:12;  //20,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define EXTI_Struct Struct_EXTI
typedef struct Struct_EXTI//0x40010400
{
  union{UINT32 IMR;struct EXTI_R_BIT IMR_BIT;};   //0x000(RW),Interrupt mask register
  union{UINT32 EMR;struct EXTI_R_BIT EMR_BIT;};   //0x004(RW),Event mask register
  union{UINT32 RTSR;struct EXTI_R_BIT RTSR_BIT;}; //0x008(RW),Rising trigger selection register 
  union{UINT32 FTSR;struct EXTI_R_BIT FTSR_BIT;}; //0x00C(RW),Falling trigger selection register
  union{UINT32 SWIER;struct EXTI_R_BIT SWIER_BIT;};//0x010(RW),Software interrupt event register
  union{UINT32 PR;struct EXTI_R_BIT PR_BIT;};     //0x014(RW),Pending register,1=selected trigger request occurred
} EXTI_Type,Type_EXTI;
