diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PT_EXTI                 ((volatile Type_EXTI *)BASE_EXTI)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define EXTI_IMR                EXTI.IMR
#define EXTI_EMR                EXTI.EMR
#define EXTI_RTSR               EXTI.RTSR
#define EXTI_FTSR               EXTI.FTSR
#define EXTI_SWIER              EXTI.SWIER
#define EXTI_PR                 EXTI.PR
//==============================================================================================================================
#define RSTV_FLASH_ACR          0x00000000//0x000(0x40022000)
struct FLASH_ACR_BIT
{
	UINT32 LATENCY:3;     //00,LATENCY[2:0] bits (Latency),SYSCLK:(0,24M]=0,(24M,48M]=1;(48M,72M]=2
	UINT32 HLFCYA:1;      //03,Flash Half Cycle Access Enable
	UINT32 PRFTBE:1;      //04,Prefetch Buffer Enable
	UINT32 PRFTBS:1;      //05,Prefetch Buffer Status
	UINT32 Reserved0:26;  //06,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FLASH_KEYR         0x00000000//0x004
#define RSTV_FLASH_OPTKEYR      0x00000000//0x008
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FLASH_SR           0x00000000//0x00C
struct FLASH_SR_BIT
{
	UINT32 BSY:1;         //00,Busy
	UINT32 Reserved0:1;   //01,
	UINT32 PGERR:1;       //02,Programming Error
	UINT32 Reserved1:1;   //03,
	UINT32 WRPRTERR:1;    //04,Write Protection Error
	UINT32 EOP:1;         //05,End of operation
	UINT32 Reserved2:26;  //06,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FLASH_CR           0x00000000//0x010
struct FLASH_CR_BIT
{
	UINT32 PG:1;          //00,Programming
	UINT32 PER:1;         //01,Page Erase
	UINT32 MER:1;         //02,Mass Erase
	UINT32 Reserved0:1;   //03,
	UINT32 OPTPG:1;       //04,Option Byte Programming
	UINT32 OPTER:1;       //05,Option Byte Erase
	UINT32 STRT:1;        //06,Start
	UINT32 LOCK:1;        //07,Lock
	UINT32 Reserved1:1;   //08,
	UINT32 OPTWRE:1;      //09,Option Bytes Write Enable
	UINT32 ERRIE:1;       //10,Error Interrupt Enable
	UINT32 Reserved2:1;   //11,
	UINT32 EOPIE:1;       //12,End of operation interrupt enable
	UINT32 Reserved3:19;  //13,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FLASH_AR           0x00000000//0x014,Flash Address
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FLASH_OBR          0x00000000//0x01C
struct FLASH_OBR_BIT
{
	UINT32 OPTERR:1;      //00,Option Byte Error
	UINT32 RDPRT:1;       //01,Read protection
	UINT32 USER:8;        //02,User Option Bytes(bit2=WDG_SW,bit3=nRST_STOP,bit4=nRST_STDBY,bit5=BFB2)
	UINT32 Reserved0:22;  //10,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FLASH_WRP          0x00000000//0x020,Write Protect
//------------------------------------------------------------------------------------------------------------------------------
#define FLASH_Struct Struct_FLASH
typedef struct Struct_FLASH//0x40020000
{
  union{UINT32 ACR;struct FLASH_ACR_BIT ACR_BIT;};      //0x000(RW),
  union{UINT32 KEYR;Type_UINT32 KEYR_BIT;};              //0x004(RW),
  union{UINT32 OPTKEYR;Type_UINT32 OPTKEYR_BIT;};        //0x008(RW),
  union{UINT32 SR;struct FLASH_SR_BIT SR_BIT;};         //0x00C(RW),
  union{UINT32 CR;struct FLASH_CR_BIT CR_BIT;};         //0x010(RW),
  union{UINT32 AR;Type_BIT32 AR_BIT;};                  //0x014(RW),
  UINT32 Reserved0[1];//0x018(R),
  union{UINT32 OBR;struct FLASH_OBR_BIT OBR_BIT;};      //0x01C(RW),
  union{UINT32 WRP;Type_BIT32 WRP_BIT;};    //0x020(RW),
#if IsDensity(XL)
  UINT32 Reserved1[8];//0x024(R), 
  union{UINT32 KEYR2;Type_BIT32 KEYR2_BIT;};//0x028(RW),
  UINT32 Reserved2[1];//0x02C(R),   
  union{UINT32 SR2;struct FLASH_SR_BIT SR2_BIT;};//0x030(R),
  union{UINT32 CR2;struct FLASH_CR_BIT CR2_BIT;};//0x034(RW),
  union{UINT32 AR2;Type_BIT32 AR2_BIT;};//0x038(RW), 
#endif
} FLASH_Type,Type_FLASH;
#define PT_FLASH                ((volatile Type_FLASH *)BASE_FLASHR)
//------------------------------------------------------------------------------------------------------------------------------
#define FLASH_ACR               FLASH.ACR
#define FLASH_KEYR              FLASH.KEYR
#define FLASH_OPTKEYR           FLASH.OPTKEYR
#define FLASH_SR                FLASH.SR
#define FLASH_CR                FLASH.CR
#define FLASH_AR                FLASH.AR
#define FLASH_OBR               FLASH.OBR
#define FLASH_WRP               FLASH.WRP
#if IsDensity(XL)
#define FLASH_KEYR2             FLASH.KEYR2
#define FLASH_SR2               FLASH.SR2
#define FLASH_CR2               FLASH.CR2
#define FLASH_AR2               FLASH.AR2
#endif
//==============================================================================================================================
#define RSTV_OB_RDP             0x00000000//0x000
#define RSTV_OB_USER            0x00000000//0x002
#define RSTV_OB_DATA0           0x00000000//0x004
#define RSTV_OB_DATA1           0x00000000//0x006
#define RSTV_OB_WRP0            0x00000000//0x008
#define RSTV_OB_WRP1            0x00000000//0x00A
#define RSTV_OB_WRP2            0x00000000//0x00C
#define RSTV_OB_WRP3            0x00000000//0x00E
struct OB_REG_BIT
{
	UINT32 V:8;           //00,option byte
	UINT32 nV:8;          //08,complemented option byte
};
//------------------------------------------------------------------------------------------------------------------------------
#define OB_Struct Struct_OB
typedef struct Struct_OB//0x1FFFF800
{
  union{UINT16 RDP;struct OB_REG_BIT RDP_BIT;};         //0x000(RW),Read protection option byte
  union{UINT16 USER;struct OB_REG_BIT USER_BIT;};       //0x002(RW),User option byte
  union{UINT16 Data0[2];struct OB_REG_BIT Data_BIT[2];};//0x004(RW),User data storage option byte
  union{UINT16 WRP[4];struct OB_REG_BIT WRP_BIT[4];};   //0x008(RW),memory write protection option bytes
} OB_Type,Type_OB;
#define PT_OB                   ((volatile Type_OB *)BASE_OB)
//------------------------------------------------------------------------------------------------------------------------------
#define OB_RDP                  OB.RDP
#define OB_USER                 OB.USER
#define OB_Data(i)              OB.Data[i]//i=0_1
#define OB_WRP(i)               OB.WRP[i]//i=0_3
//==============================================================================================================================
#define RSTV_FSMC_BCR1          0x00000081//0x000
#define RSTV_FSMC_BCR2          0x00000081//0x008
#define RSTV_FSMC_BCR3          0x00000081//0x010
#define RSTV_FSMC_BCR4          0x00000081//0x018
struct FSMC_BCR_BIT//0x000=BCR1,0x008=BCR2,0x010=BCR3,0x018=BCR4
{
	UINT32 MBKEN:1;       //00,Memory bank enable bit
	UINT32 MUXEN:1;       //01,Address/data multiplexing enable bit
	UINT32 MTYP:2;        //02,MTYP[1:0] bits (Memory type):0=SRAM,1=PSRAM/CRAM,2=NOR FLASH,3=Reserve
	UINT32 MWID:2;        //04,MWID[1:0] bits (Memory data bus width):0=8bit,1=16bit
	UINT32 FACCEN:1;      //06,Flash access enable
	UINT32 Reserved0:1;   //07,
	UINT32 BURSTEN:1;     //08,Burst enable bit
	UINT32 WAITPOL:1;     //09,Wait signal polarity bit:
	UINT32 WRAPMOD:1;     //10,Wrapped burst mode support
	UINT32 WAITCFG:1;     //11,Wait timing configuration
	UINT32 WREN:1;        //12,Write enable bit
	UINT32 WAITEN:1;      //13,Wait enable bit
	UINT32 EXTMOD:1;      //14,Extended mode enable
	UINT32 ASYNCWAIT:1;   //15,Asynchronous wait
	UINT32 Reserved1:3;   //16,
	UINT32 CBURSTRW:1;    //19,Write burst enable
	UINT32 Reserved2:12;  //20,
};
