diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define FSMC_BCR_MODE_1         0x00000081//SRAM/PSRAM(CRAM)
#define FSMC_BCR_MODE_2         0x000000C9//NOR FLASH
#define FSMC_BCR_MODE_B         0x000040C9//NOR FLASH
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FSMC_BTR1          0x00000000//0x004
#define RSTV_FSMC_BTR2          0x00000000//0x00C
#define RSTV_FSMC_BTR3          0x00000000//0x014
#define RSTV_FSMC_BTR4          0x00000000//0x01C
#define RSTV_FSMC_BTR           0x00000000
struct FSMC_BTR_BIT//0x004=BTR1,0x00C=BTR2,0x014=BTR3,0x01C=BTR4
{
	UINT32 ADDSET:4;      //00,ADDSET[3:0] bits (Address setup phase duration):ADDSET+1 HCLK
	UINT32 ADDHLD:4;      //04,ADDHLD[3:0] bits (Address-hold phase duration):0_15=1_16 HCLK cycles
	UINT32 DATAST:8;      //08,DATAST [3:0] bits (Data-phase duration):DATAST+1 HCLK for write,DATAST+3 HCLK for read. min=1
	UINT32 BUSTURN:4;     //16,BUSTURN[3:0] bits (Bus turnaround phase duration):BUSTURN HCLK cycles
  UINT32 CLKDIV:4;      //20,CLKDIV[3:0] bits (Clock divide ratio):0=reserve,1_15=2_16 HCLK cycles
	UINT32 DATLAT:4;      //24,DATLA[3:0] bits (Data latency):DATLAT+2 HCLK
	UINT32 ACCMOD:2;      //28,ACCMOD[1:0] bits (Access mode):0=A,1=B,2=C,3=D ;Write=0
	UINT32 Reserved0:2;   //30, =0
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FSMC_BWTR1           0x00000000//0x104
#define RSTV_FSMC_BWTR2           0x00000000//0x10C
#define RSTV_FSMC_BWTR3           0x00000000//0x114
#define RSTV_FSMC_BWTR4           0x00000000//0x11C
#define RSTV_FSMC_BWTR            0x00000000
struct FSMC_BWTR_BIT//0x104=BWTR1,0x10C=BWTR2,0x114=BWTR3,0x11C=BWTR4，<LDY>
{
	UINT32 ADDSET:4;      //00,ADDSET[3:0] bits (Address setup phase duration),ADDSET+1 HCLK
	UINT32 ADDHLD:4;      //04,ADDHLD[3:0] bits (Address-hold phase duration):don't care
	UINT32 DATAST:8;      //08,DATAST [3:0] bits (Data-phase duration):DATAST+1 HCLK for write,DATAST+3 HCLK for read. min=1
	UINT32 BUSTURN:4;     //16,BUSTURN[3:0] bits (Bus turnaround phase duration)
  UINT32 Reserved0:8;   //20,:don't care
	UINT32 ACCMOD:2;      //28,ACCMOD[1:0] bits (Access mode):=0
	UINT32 Reserved1:2;   //30, =0
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FSMC_PCR2            0x00000018//0xA0000060
#define RSTV_FSMC_PCR3            0x00000018//0xA0000080
#define RSTV_FSMC_PCR4            0x00000018//0xA00000A0
#define RSTV_FSMC_PCR             0x00000018
struct FSMC_PCR_BIT//0xA0000060=PCR2,0xA0000080=PCR3,0xA00000A0=PCR4
{
	UINT32 Reserved0:1;   //00,
	UINT32 PWAITEN:1;     //01,Wait feature enable bit
	UINT32 PBKEN:1;       //02,PC Card/NAND Flash memory bank enable bit
	UINT32 PTYP:1;        //03,Memory type:0=PC Card,CompactFlash,CF+ or PCMCIA;1=NAND flash
	UINT32 PWID:2;        //04,PWID[1:0] bits (NAND Flash databus width):0=8bits,1=16bits,2_3=reserved
  UINT32 ECCEN:1;       //06,ECC computation logic enable bit
	UINT32 Reserved1:2;   //07,
	UINT32 TCLR:4;        //09,TCLR[3:0] bits (CLE to RE delay)
	UINT32 TAR:4;         //13,TAR[3:0] bits (ALE to RE delay)
	UINT32 ECCPS:3;       //17,ECCPS[1:0] bits (ECC page size)
	UINT32 Reserved2:12;  //20,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FSMC_SR2             0x00000040//0xA0000064
#define RSTV_FSMC_SR3             0x00000040//0xA0000084
#define RSTV_FSMC_SR4             0x00000040//0xA00000A4
#define RSTV_FSMC_SR              0x00000040
struct FSMC_SR_BIT//0xA0000064=SR2,0xA0000084=SR3,0xA00000A4=SR4
{
	UINT32 IRS:1;         //00,Interrupt Rising Edge status
	UINT32 ILS:1;         //01,Interrupt Level status
	UINT32 IFS:1;         //02,Interrupt Falling Edge status
	UINT32 IREN:1;        //03,Interrupt Rising Edge detection Enable bit
	UINT32 ILEN:1;        //04,Interrupt Level detection Enable bit
  UINT32 IFEN:1;        //05,Interrupt Falling Edge detection Enable bit
	UINT32 FEMPT:1;       //06,FIFO empty
	UINT32 Reserved2:25;  //07,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FSMC_PMEM2           0x00000000//0xA0000068,Common memory 2
#define RSTV_FSMC_PMEM3           0x00000000//0xA0000088,Common memory 3
#define RSTV_FSMC_PMEM4           0x00000000//0xA00000A8,Common memory 4
#define RSTV_FSMC_PMEM            0x00000000
#define RSTV_FSMC_PATT2           0x00000000//0xA000006C,Attribute memory 2
#define RSTV_FSMC_PATT3           0x00000000//0xA000008C,Attribute memory 3
#define RSTV_FSMC_PATT4           0x00000000//0xA00000AC,Attribute memory 4
#define RSTV_FSMC_PATT            0x00000000
#define RSTV_FSMC_PIO4            0x00000000//0xA00000B0,I/O 4
struct FSMC_SWHH_BIT//0xA0000068=PMEM2,0xA0000088=PMEM3,0xA00000A8=PMEM4,0xA000006C=PATT2,0xA000008C=PATT3,0xA00000AC=PATT4,0xA00000B0=PIO4
{
	UINT32 SET:8;         //00,MEMSET2[7:0] bits ( setup time)
	UINT32 WAIT:8;        //08,MEMWAIT2[7:0] bits (Common memory 2 wait time)
	UINT32 HOLD:8;        //16,MEMHOLD2[7:0] bits (Common memory 2 hold time)
	UINT32 HIZ:8;         //24,MEMHIZ2[7:0] bits (Common memory 2 databus HiZ time)
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_FSMC_ECCR2           0x00000000//0xA0000074,ECC result 2
#define RSTV_FSMC_ECCR3           0x00000000//0xA0000094,ECC result 3
//------------------------------------------------------------------------------------------------------------------------------
typedef struct FSMCCH//0x000=CH[0],Bank1
{
  union{UINT32 BCR;struct FSMC_BCR_BIT BCR_BIT;}; 
  union{UINT32 BTR;struct FSMC_BTR_BIT BTR_BIT;};  
} FSMCCH_Type,Type_FSMCCH;
//------------------------------------------------------------------------------------------------------------------------------
typedef struct FSMCPC//0x060=PC[0],Bank2
{
  union{UINT32 PCR;struct FSMC_PCR_BIT PCR_BIT;};//0x000(RW),
  union{UINT32 SR;struct FSMC_SR_BIT SR_BIT;};//0x004(RW),
  union{UINT32 PMEM;struct FSMC_SWHH_BIT PMEM_BIT;};//0x008(RW),Common memory space timing register
  union{UINT32 PATT;struct FSMC_SWHH_BIT PATT_BIT;};//0x00C(RW),Attribute memory space timing register
  union{UINT32 PIO4;struct FSMC_SWHH_BIT PIO4_BIT;};//0x010(RW),only for bank4,PC Card  I/O space timing register   
  union{UINT32 ECCR;Type_BIT32 ECCR_BIT;};//0x014(RW), 
	UINT32 Reserved0[2];//0x018(R),
} FSMCPC_Type,Type_FSMCPC;  
//------------------------------------------------------------------------------------------------------------------------------
typedef struct FSMCBW//0x100=BW[0],0x108=BW[1],0x110=BW[2],0x118=BW[3],Bank1E
{
	UINT32 Reserved0[1];
  union{UINT32 BWTR;struct FSMC_BWTR_BIT BWTR_BIT;};
} FSMCBW_Type,Type_FSMCBW;
//------------------------------------------------------------------------------------------------------------------------------
#define FSMC_Struct Struct_FSMC
typedef struct Struct_FSMC//0xA0000000
{
	Type_FSMCCH CH[4];    //0xA0000000,Bank1
	UINT32 Reserved0[16]; //0xA0000020,
	Type_FSMCPC PC[3];    //0xA0000060,Bank2,Bank3,Bank4
	UINT32 Reserved1[16]; //0xA00000C0,
	Type_FSMCBW BW[4];    //0xA0000100,Bank1E
} FSMC_Type,Type_FSMC;
#define PT_FSMC                 ((volatile Type_FSMC *)BASE_FSMC)
//------------------------------------------------------------------------------------------------------------------------------
#define FSMC_BCR(i)             FSMC.CH[i].BCR//i=0_3
#define FSMC_BTR(i)             FSMC.CH[i].BTR//i=0_3
#define FSMC_PCR(i)             FSMC.PC[i].PCR//i=0_2
#define FSMC_SR(i)              FSMC.PC[i].SR//i=0_2
#define FSMC_PMEM(i)            FSMC.PC[i].PMEM//i=0_2
#define FSMC_PATT(i)            FSMC.PC[i].PATT//i=0_2
#define FSMC_PIO4(i)            FSMC.PC[i].PIO4//i=0_2
#define FSMC_ECCR(i)            FSMC.PC[i].ECCR//i=0_2
#define FSMC_BWTR(i)            FSMC.BW[i].BWTR//i=0_3
//==============================================================================================================================
typedef struct Struct_LCD
{
  #if LCD_RS
  UINT16 Reserved0;
  #endif
  UINT16 REG;
  UINT16 RAM;
} LCD_Type,Type_LCD;
#define PT_LCD                  ((volatile Type_LCD *)BASE_LCD)
#define LCD_REG                 LCD.REG
#define LCD_RAM                 LCD.RAM
//==============================================================================================================================
#define RSTV_GPIO_CRL           0x44444444//0x000
#define RSTV_GPIO_CRH           0x44444444//0x004
//MODE:0=Input,1=Out_10M,2=Out_2M,3=Out_50M
//CNF:Input(0=Analog,1=Floating,2=PU/PD,3=Reserved),Output(0=PushPull,1=OpenDrain,2=ALTF_PushPull,3=ALTF_OpenDrain)
struct GPIO_CR_BIT//CRL,CRH
{
  UINT32 MODE0:2;       //00,MODE0[1:0] bits (Port x mode bits, pin 0)
	UINT32 CNF0:2;        //02,CNF0[1:0] bits (Port x configuration bits, pin 0)
  UINT32 MODE1:2;       //04,MODE1[1:0] bits (Port x mode bits, pin 1)
	UINT32 CNF1:2;        //06,CNF1[1:0] bits (Port x configuration bits, pin 1)
  UINT32 MODE2:2;       //08,MODE2[1:0] bits (Port x mode bits, pin 2)
	UINT32 CNF2:2;        //10,CNF2[1:0] bits (Port x configuration bits, pin 2)
  UINT32 MODE3:2;       //12,MODE3[1:0] bits (Port x mode bits, pin 3)
	UINT32 CNF3:2;        //14,CNF3[1:0] bits (Port x configuration bits, pin 3)
  UINT32 MODE4:2;       //16,MODE4[1:0] bits (Port x mode bits, pin 4)
	UINT32 CNF4:2;        //18,CNF4[1:0] bits (Port x configuration bits, pin 4)
  UINT32 MODE5:2;       //20,MODE5[1:0] bits (Port x mode bits, pin 5)
	UINT32 CNF5:2;        //22,CNF5[1:0] bits (Port x configuration bits, pin 5)
  UINT32 MODE6:2;       //24,MODE6[1:0] bits (Port x mode bits, pin 6)
	UINT32 CNF6:2;        //26,CNF6[1:0] bits (Port x configuration bits, pin 6)
  UINT32 MODE7:2;       //28,MODE7[1:0] bits (Port x mode bits, pin 7)
	UINT32 CNF7:2;        //30,CNF7[1:0] bits (Port x configuration bits, pin 7)
};

#define GPIO_MI_Analog          0
#define GPIO_MI_Floating        4
#define GPIO_MI_PUPD            8
#define GPIO_MO_10M_PU          1
#define GPIO_MO_10M_OD          5
#define GPIO_MO_10M_AFPU        9
#define GPIO_MO_10M_AFOD        13
#define GPIO_MO_2M_PU           2
#define GPIO_MO_2M_OD           6
#define GPIO_MO_2M_AFPU         10
#define GPIO_MO_2M_AFOD         14
#define GPIO_MO_50M_PU          3
#define GPIO_MO_50M_OD          7
#define GPIO_MO_50M_AFPU        11
#define GPIO_MO_50M_AFOD        15
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_GPIO_IDR           0x00000000//0x008
#define RSTV_GPIO_ODR           0x00000000//0x00C
struct GPIO_IO_BIT//IDR,ODR
{
  UINT32 B0:1;          //00,Port input/output data, bit 0,1=output
  UINT32 B1:1;          //01,Port input/output data, bit 1
  UINT32 B2:1;          //02,Port input/output data, bit 2
  UINT32 B3:1;          //03,Port input/output data, bit 3
  UINT32 B4:1;          //04,Port input/output data, bit 4
  UINT32 B5:1;          //05,Port input/output data, bit 5
  UINT32 B6:1;          //06,Port input/output data, bit 6
  UINT32 B7:1;          //07,Port input/output data, bit 7
  UINT32 B8:1;          //08,Port input/output data, bit 8
  UINT32 B9:1;          //09,Port input/output data, bit 9
  UINT32 B10:1;         //10,Port input/output data, bit 10
  UINT32 B11:1;         //11,Port input/output data, bit 11
  UINT32 B12:1;         //12,Port input/output data, bit 12
  UINT32 B13:1;         //13,Port input/output data, bit 13
  UINT32 B14:1;         //14,Port input/output data, bit 14
  UINT32 B15:1;         //15,Port input/output data, bit 15
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_GPIO_BSRR          0x00000000//0x010
struct GPIO_BSRR_BIT
{
  UINT32 BS:16;         //00,
  UINT32 BR:16;         //16,
};
#define GPIO_BSRR_BS(i)         GPIO[i].BSRR_BIT.BS
#define GPIO_BSRR_BR(i)         GPIO[i].BSRR_BIT.BR
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_GPIO_BRR           0x00000000//0x014
struct GPIO_BRR_BIT
{
  UINT32 BR:16;         //00,
  UINT32 Reserved0:16;  //16,
};
#define GPIO_BRR_BR(i)          GPIO[i].BRR_BIT.BR
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_GPIO_LCKR          0x00000000//0x018
struct GPIO_LCKR_BIT
{
  UINT32 LCK:16;        //00,Lock Port Config
	UINT32 LCKK:1;        //16,Enable Bit0_15
  UINT32 Reserved0:15;  //17,
};
#define GPIO_LCKR_CLK(i)        GPIO[i].LCKR_BIT.CLK
#define GPIO_LCKR_LCKK(i)       GPIO[i].LCKR_BIT.LCKK
//------------------------------------------------------------------------------------------------------------------------------
#define GPIO_Struct Struct_GPIO
typedef struct Struct_GPIO//GPIOA=0x40010800,Size=0x0400
{
  union{UINT32 CRL;struct GPIO_CR_BIT CRL_BIT;};//0x000(RW),Port configuration register low 
  union{UINT32 CRH;struct GPIO_CR_BIT CRH_BIT;};//0x004(RW),Port configuration register high 
  union{UINT32 IDR;struct GPIO_IO_BIT IDR_BIT;};//0x008(RW),Port input data register 
  union{UINT32 ODR;struct GPIO_IO_BIT ODR_BIT;};//0x00C(RW),Port output data register 
  union{UINT32 BSRR;struct GPIO_BSRR_BIT BSRR_BIT;};//0x010(RW),Port bit set/reset register
  union{UINT32 BRR;struct GPIO_BRR_BIT BRR_BIT;};//0x014(RW),Port bit reset register 
  union{UINT32 LCKR;struct GPIO_LCKR_BIT LCKR_BIT;};//0x018(RW),Port configuration lock register
	UINT32 Reserved0[249];//0x01C(R),
} GPIO_Type,Type_GPIO;
