diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PT_GPIOA                ((volatile Type_GPIO *)BASE_GPIOA)
#define PT_GPIOB                ((volatile Type_GPIO *)BASE_GPIOB)
#define PT_GPIOC                ((volatile Type_GPIO *)BASE_GPIOC)
#define PT_GPIOD                ((volatile Type_GPIO *)BASE_GPIOD)
#define PT_GPIOE                ((volatile Type_GPIO *)BASE_GPIOE)
#define PT_GPIOF                ((volatile Type_GPIO *)BASE_GPIOF)
#define PT_GPIOG                ((volatile Type_GPIO *)BASE_GPIOG)
#define PT_GPIO(i)              ((volatile Type_GPIO *)BASE_GPIO(i))//i=0_6
#define GPIOA                   GPIO[0]
#define GPIOB                   GPIO[1]
#define GPIOC                   GPIO[2]
#define GPIOD                   GPIO[3]
#define GPIOE                   GPIO[4]
#define GPIOF                   GPIO[5]
#define GPIOG                   GPIO[6]
//------------------------------------------------------------------------------------------------------------------------------
#define GPIO_CRL(i)             GPIO[i].CRL//i=0_6
#define GPIO_CRH(i)             GPIO[i].CRH//i=0_6
#define GPIO_IDR(i)             GPIO[i].IDR//i=0_6
#define GPIO_ODR(i)             GPIO[i].ODR//i=0_6
#define GPIO_BSRR(i)            GPIO[i].BSRR//i=0_6
#define GPIO_BRR(i)             GPIO[i].BRR//i=0_6
#define GPIO_LCKR(i)            GPIO[i].LCKR//i=0_6
//==============================================================================================================================
#define RSTV_AFIO_EVCR          0x00000000//0x000
struct AFIO_EVCR_BIT
{
  UINT32 PIN:4;         //00,PIN[3:0] bits (Pin selection)
	UINT32 PORT:3;        //04,PORT[2:0] bits (Port selection)
	UINT32 EVOE:1;        //07,Event Output Enable
  UINT32 Reserved0:24;  //08,
};
#define AFIO_EVCR_PIN        AFIO.EVCR_BIT.PIN
#define AFIO_EVCR_PORT       AFIO.EVCR_BIT.PORT
#define AFIO_EVCR_EVOE       AFIO.EVCR_BIT.EVOE

#define AFIO_EVCR_PORT_PA               0//Port A selected
#define AFIO_EVCR_PORT_PB               1//Port B selected
#define AFIO_EVCR_PORT_PC               2//Port C selected
#define AFIO_EVCR_PORT_PD               3//Port D selected
#define AFIO_EVCR_PORT_PE               4//Port E selected
//------------------------------------------------------------------------------------------------------------------------------
//SPI2=fix at NSS/SCK/MISO/MOSI=PB12/PB13/PB14/PB15
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_AFIO_MAPR            0x00000000//0x004
struct AFIO_MAPR_BIT
{
  UINT32 SPI1:1;        //00,SPI1 remapping,NSS/SCK/MISO/MOSI=: 0=PA4/PA5/PA6/PA7,1=PA15/PB3/PB4/PB5
	UINT32 I2C1:1;        //01,I2C1 remapping,SCL/SDA=: 0=PB6/PB7,1=PB8/PB9
	UINT32 USART1:1;      //02,USART1 remapping,TXRX=: 0=PA9/PA10,1=PB6/PB7
  UINT32 USART2:1;      //03,USART2 remapping,TXRX=: 0=PA2/PA3,1=PD5/PD6
	UINT32 USART3:2;      //04,USART3_REMAP[1:0] bits (USART3 remapping),TXRX=: 0=PB10/PB11,1=PC10/PC11,2=no used,3=PD8/PD9
	UINT32 TIM1:2;        //06,TIM1_REMAP[1:0] bits
	UINT32 TIM2:2;        //08,TIM2_REMAP[1:0] bits:0=(PA0_3),1=(PA15,PB3,PA2_3),2=(PA0_1,PB10_11),3=(PA15,PB3,PB10_11)
	UINT32 TIM3:2;        //10,TIM3_REMAP[1:0] bits:0=No remap(PA6,PA7,PB0,PB1),2=partial(PB4,PB5,PB0,PB1),3=full(PC6_9)
  UINT32 TIM4:1;        //12,TIM4_REMAP bit (TIM4 remapping,0=T4C1_4=PB6_9,1=T4C1_4=PD12_15)
	UINT32 CAN1_AL:2;     //13,CAN_REMAP[1:0] bits (CAN Alternate function remapping)RXTX:0=(PA11,PA12),2=(PB8,PB9),3=(PD0,PD1)
	UINT32 PD01:1;        //15,Port D0/Port D1 mapping on OSC_IN/OSC_OUT:1=Enable
	UINT32 TIM5CH4:1;     //16,TIM5 Channel4 Internal Remap
	UINT32 ADC1ETRGINJ:1; //17,ADC 1 External Trigger Injected Conversion remapping
	UINT32 ADC1ETRGREG:1; //18,ADC 1 External Trigger Regular Conversion remapping
	UINT32 ADC2ETRGINJ:1; //19,ADC 2 External Trigger Injected Conversion remapping
	UINT32 ADC2ETRGREG:1; //20,ADC 2 External Trigger Regular Conversion remapping
#if IsDensity(CL)
	UINT32 ETH:1;         //21,SPI3_REMAP bit (Ethernet MAC I/O remapping)
	UINT32 CAN2_AL:1;     //22,CAN2_REMAP bit (CAN2 I/O remapping)
	UINT32 MII:1;         //23,MII_RMII_SEL bit (Ethernet MII or RMII selection)
#else
	UINT32 Reserved0:3;
#endif
  UINT32 SWJCFG:3;      //24,SWJCFG[2:0] bits (Serial Wire JTAG configuration):0=FULL SWJ(reset),1=FULL SWJ but no NJRST,2=JTAG disable and SW enable,4=JTAG and SW disable
	UINT32 Reserved1:1;   //27,
#if IsDensity(CL)
  UINT32 SPI3:1;        //28,SPI3_REMAP bit,(NSS,CK,MISO,MOSI):0=(PA15,PB3,PB4,PB5),1=(PA4,PC10,PC11,PC12)
  UINT32 TIM2ITR1:1;    //29,TIM2ITR1_IREMAP bit (TIM2 internal trigger 1 remapping)
	UINT32 PTPPPS:1;      //30,PTP_PPS_REMAP bit (Ethernet PTP PPS remapping)
	UINT32 Reserved2:1;   //31,
#else
  UINT32 Reserved2:4;   //28,
#endif
};
#define AFIO_MAPR_USART3_NOREMAP        0//No remap (TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14)
#define AFIO_MAPR_USART3_PARTIALREMAP   1//Partial remap (TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14)
#define AFIO_MAPR_USART3_FULLREMAP      3//Full remap (TX/PD8, RX/PD9, CK/PD10, CTS/PD11, RTS/PD12)
#define AFIO_MAPR_TIM1_NOREMAP          0//No remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PB12, CH1N/PB13, CH2N/PB14, CH3N/PB15)
#define AFIO_MAPR_TIM1_PARTIALREMAP     2//Partial remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PA6, CH1N/PA7, CH2N/PB0, CH3N/PB1)
#define AFIO_MAPR_TIM1_FULLREMAP        3//Full remap (ETR/PE7, CH1/PE9, CH2/PE11, CH3/PE13, CH4/PE14, BKIN/PE15, CH1N/PE8, CH2N/PE10, CH3N/PE12)
#define AFIO_MAPR_TIM2_NOREMAP          0//No remap (CH1/ETR/PA0, CH2/PA1, CH3/PA2, CH4/PA3)
#define AFIO_MAPR_TIM2_PARTIALREMAP1    1//Partial remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2, CH4/PA3)
#define AFIO_MAPR_TIM2_PARTIALREMAP2    2//Partial remap (CH1/ETR/PA0, CH2/PA1, CH3/PB10, CH4/PB11)
#define AFIO_MAPR_TIM2_FULLREMAP        3//Full remap (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11)
#define AFIO_MAPR_TIM3_NOREMAP          0//No remap (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1)
#define AFIO_MAPR_TIM3_PARTIALREMAP     2//Partial remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1)
#define AFIO_MAPR_TIM3_FULLREMAP        3//Full remap (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9)
#define AFIO_MAPR_CAN_REMAP1            0//CANRX mapped to PA11, CANTX mapped to PA12
#define AFIO_MAPR_CAN_REMAP2            2//CANRX mapped to PB8, CANTX mapped to PB9
#define AFIO_MAPR_CAN_REMAP3            3//CANRX mapped to PD0, CANTX mapped to PD1
#define AFIO_MAPR_SWJCFG_RESET          0//Full SWJ (JTAG-DP + SW-DP) : Reset State
#define AFIO_MAPR_SWJCFG_NOJNTRST       1//Full SWJ (JTAG-DP + SW-DP) but without JNTRST
#define AFIO_MAPR_SWJCFG_JTAGDISABLE    2//JTAG-DP Disabled and SW-DP Enabled
#define AFIO_MAPR_SWJCFG_DISABLE        4//JTAG-DP Disabled and SW-DP Disabled
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_AFIO_EXTICR1       0x00000000//0x008
#define RSTV_AFIO_EXTICR2       0x00000000//0x00C
#define RSTV_AFIO_EXTICR3       0x00000000//0x010
#define RSTV_AFIO_EXTICR4       0x00000000//0x014
struct AFIO_EXTICR_BIT//0x008=EXTICR1,0x00C=EXTICR2,0x010=EXTICR3,0x014=EXTICR4
{
  UINT32 EXTI0:4;       //00,EXTI 0 configuration,EXTICR1=0_6=PA[0]_PG[0]
  UINT32 EXTI1:4;       //00,EXTI 1 configuration,EXTICR1=0_6=PA[1]_PG[1]
  UINT32 EXTI2:4;       //00,EXTI 2 configuration,EXTICR1=0_6=PA[2]_PG[2]
  UINT32 EXTI3:4;       //00,EXTI 3 configuration,EXTICR1=0_6=PA[3]_PG[3]
	UINT32 Reserved0:16;  //16,
};

#define AFIO_EXTICR_EXTI_PA     0//PA pin
#define AFIO_EXTICR_EXTI_PB     1//PB pin
#define AFIO_EXTICR_EXTI_PC     2//PC pin
#define AFIO_EXTICR_EXTI_PD     3//PD pin
#define AFIO_EXTICR_EXTI_PE     4//PE pin
#define AFIO_EXTICR_EXTI_PF     5//PF pin
#define AFIO_EXTICR_EXTI_PG     6//PG pin
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_AFIO_MAPR2           0x00000000//0x01C
struct AFIO_MAPR2_BIT
{
#if IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  UINT32 TIM15:1;       //00,TIM15 remapping
  UINT32 TIM16:1;       //01,TIM16 remapping
  UINT32 EXT17:1;       //02,TIM17 remapping
  UINT32 CEC:1;         //03,CEC remapping
	UINT32 TIM1_DMA:1;    //04,TIM1_DMA remapping
#else
	UINT32 Reserved0:5;
#endif
#if IsDensity(XL)
	UINT32 TIM9:1;        //05,TIM9 remapping
	UINT32 TIM10:1;       //06,TIM10 remapping
	UINT32 TIM11:1;       //07,TIM11 remapping
#else
  UINT32 Reserved1:3;   //05,
#endif
#if IsDensity(XL)|| IsDensity(HD_VL)
	UINT32 TIM13:1;       //08,TIM13 remapping
	UINT32 TIM14:1;       //09,TIM14 remapping
	UINT32 FSMCNADV:1;    //10,FSMC NADV remapping
#else
  UINT32 Reserved2:3;   //08,
#endif
  UINT32 TIM67DACDMA:1; //11,TIM6/TIM7 and DAC DMA remapping
	UINT32 TIM12:1;       //12,TIM12 remapping
	UINT32 MISC:1;        //13,Miscellaneous remapping
	UINT32 Reserved3:18;  //14,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define AFIO_Struct Struct_AFIO
typedef struct Struct_AFIO//0x40020000
{
  union{UINT32 EVCR;struct AFIO_EVCR_BIT EVCR_BIT;};//0x000(RW),
  union{UINT32 MAPR;struct AFIO_MAPR_BIT MAPR_BIT;};//0x004(RW),
  union{UINT32 EXTICR[4];struct AFIO_EXTICR_BIT EXTICR_BIT[4];struct UINT32_B4P_BIT EXTICR_B4P[4];};//0x008(RW),
  UINT32 Reserved0[1];  //0x018(R),
  union{UINT32 MAPR2;struct AFIO_MAPR2_BIT MAPR2_BIT;};         //0x01C(RW),
} AFIO_Type,Type_AFIO;
#define PT_AFIO                 ((volatile Type_AFIO *)BASE_AFIO)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define AFIO_EVCR               AFIO.EVCR
#define AFIO_MAPR               AFIO.MAPR
#define AFIO_EXTICR(i)          AFIO.EXTICR[i]//i=0_3
#define AFIO_MAPR2              AFIO.MAPR2
//==============================================================================================================================
#define RSTV_I2C_CR1            0x00000000//0x000
struct I2C_CR1_BIT
{
	UINT32 PE:1;          //00,Peripheral Enable:1=Enable
	UINT32 SMBUS:1;       //01,SMBus Mode:0=I2C,1=SMBus
	UINT32 Reserved0:1;   //02,
	UINT32 SMBTYPE:1;     //03,SMBus Type:0=Device,1=Host
	UINT32 ENARP:1;       //04,ARP Enable:1=Enable
	UINT32 ENPEC:1;       //05,PEC Enable:1=Enable
	UINT32 ENGC:1;        //06,General Call Enable:1=Enable
	UINT32 NOSTRETCH:1;   //07,Clock Stretching Disable (Slave mode):0=Enable,1=Disable
	UINT32 START:1;       //08,Start Generation,Master:0=No Start,1=Repeat Start;Slave:0=No Start,1=Start  when the bus is free
	UINT32 STOP:1;        //09,Stop Generation,Master:0=No stop,1=Stop after current;Slave:0=No stop,1=Release the SCL and SDA
	UINT32 ACK:1;         //10,Acknowledge Enable:1=ACK returned
	UINT32 POS:1;         //11,Acknowledge/PEC Position (for data reception):0=Current,1=Next
	UINT32 PEC:1;         //12,Packet Error Checking:1=PEC transfer
	UINT32 ALERT:1;       //13,SMBus Alert:0 Release SMBA pin high(NACK),1=Drive SMBA pin low(ACK)
	UINT32 Reserved1:1;   //14,
	UINT32 SWRST:1;       //15,Software Reset:1=Reset
  UINT32 Reserved2:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_I2C_CR2            0x00000000//0x004
struct I2C_CR2_BIT
{
	UINT32 FREQ:6;        //00,FREQ[5:0] bits (Peripheral Clock Frequency):0_1=not allowed,2_50=2_50MHz
	UINT32 Reserved0:2;   //06,
	UINT32 ITERREN:1;     //08,Error Interrupt Enable:1=Enable,interrupt when (BERR,ARLO,AF,OVR,PECERR,TIMEOUT,SMBALERT)=1
	UINT32 ITEVTEN:1;     //09,Event Interrupt Enable:1=Enable,interrupt when (SB(M),ADDR(M/S),ADD10(M),STOPF1(S),BTF,TxE,RxNE)=1
	UINT32 ITBUFEN:1;     //10,Buffer Interrupt Enable,when TxE=1 or RxNE=1,generates event interrupt:1=Enable
	UINT32 DMAEN:1;       //11,DMA Requests Enable:0=disable,1=Enable when TxE=1 or RxNE=1
	UINT32 LAST:1;        //12,DMA Last Transfer:1=Last transfer
	UINT32 Reserved1:3;   //13,
  UINT32 Reserved2:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_I2C_OAR1           0x00000000//0x008
struct I2C_OAR1_BIT
{
	UINT32 ADD:10;        //00,Interface Address
	UINT32 Reserved0:5;   //10,
	UINT32 ADDMODE:1;     //15,Addressing Mode (Slave mode):0=7 bit,1=10 bit
  UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_I2C_OAR2           0x00000000//0x00C
struct I2C_OAR2_BIT
{
	UINT32 ENDUAL:1;      //00,Dual addressing mode enable:0=only OAR1 in 7bit,1=OAR1 and OAR2 in 7bit
	UINT32 ADD2:7;        //01,Interface address
	UINT32 Reserved0:8;   //08,
  UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_I2C_DR             0x00000000//0x010
struct I2C_DR_BIT
{
	UINT32 DR:8;          //00,8-bit Data Register
	UINT32 Reserved0:8;   //08,
  UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_I2C_SR1            0x00000000//0x014
struct I2C_SR1_BIT
{
	UINT32 SB:1;          //00,Start Bit (Master mode)
	UINT32 ADDR:1;        //01,Address sent (master mode)/matched (slave mode)
	UINT32 BTF:1;         //02,Byte Transfer Finished
	UINT32 ADD10:1;       //03,10-bit header sent (Master mode)
	UINT32 STOPF:1;       //04,Stop detection (Slave mode)
	UINT32 Reserved0:1;   //05,
	UINT32 RXNE:1;        //06,Data Register not Empty (receivers)
	UINT32 TXE:1;         //07,Data Register Empty (transmitters)
	UINT32 BERR:1;        //08,Bus Error
	UINT32 ARLO:1;        //09,Arbitration Lost (master mode)
	UINT32 AF:1;          //10,Acknowledge Failure
	UINT32 OVR:1;         //11,Overrun/Underrun
	UINT32 PECERR:1;      //12,PEC Error in reception
	UINT32 Reserved1:1;   //13,
	UINT32 TIMEOUT:1;     //14,Timeout or Tlow Error
	UINT32 SMBALERT:1;    //15,SMBus Alert
  UINT32 Reserved2:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_I2C_SR2            0x00000000//0x018
struct I2C_SR2_BIT
{
	UINT32 MSL:1;         //00,Master/Slave
	UINT32 BUSY:1;        //01,Bus Busy
	UINT32 TRA:1;         //02,Transmitter/Receiver
	UINT32 Reserved0:1;   //03,
	UINT32 GENCALL:1;     //04,General Call Address (Slave mode)
	UINT32 SMBDEFAULT:1;  //05,SMBus Device Default Address (Slave mode)
	UINT32 SMBHOST:1;     //06,SMBus Host Header (Slave mode)
	UINT32 DUALF:1;       //07,Dual Flag (Slave mode)
	UINT32 PEC:8;         //08,Packet Error Checking Register
  UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
//Event=SR2_Low:SR1_Low

