diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define I2C_EVENT_MASTER_MODE_SELECT                    0x00030001  //EV5, BUSY, MSL and SB flag
#define I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED      0x00070082  //EV6, BUSY, MSL, ADDR, TXE and TRA flags
#define I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED         0x00030002  //EV6, BUSY, MSL and ADDR flags
#define I2C_EVENT_MASTER_MODE_ADDRESS10                 0x00030008  //EV9, BUSY, MSL and ADD10 flags
#define I2C_EVENT_MASTER_BYTE_RECEIVED                  0x00030040  //EV7,Master receive: BUSY, MSL and RXNE flags
#define I2C_EVENT_MASTER_BYTE_TRANSMITTING              0x00070080  //EV8, Master transmit:TRA, BUSY, MSL, TXE flags
#define I2C_EVENT_MASTER_BYTE_TRANSMITTED               0x00070084  //EV8_2,TRA, BUSY, MSL, TXE and BTF flags

//1,Case of One Single Address managed by the slave
#define  I2C_EVENT_SLAVE_RECEIVER_ADDRESS_MATCHED          ((uint32_t)0x00020002) //EV1, BUSY and ADDR flags
#define  I2C_EVENT_SLAVE_TRANSMITTER_ADDRESS_MATCHED       ((uint32_t)0x00060082) //EV1, TRA, BUSY, TXE and ADDR flags

//2,Case of Dual address managed by the slave
#define  I2C_EVENT_SLAVE_RECEIVER_SECONDADDRESS_MATCHED    ((uint32_t)0x00820000)  //EV1, DUALF and BUSY flags
#define  I2C_EVENT_SLAVE_TRANSMITTER_SECONDADDRESS_MATCHED ((uint32_t)0x00860080)  //EV1, DUALF, TRA, BUSY and TXE flags

//3,Case of General Call enabled for the slave
#define  I2C_EVENT_SLAVE_GENERALCALLADDRESS_MATCHED        ((uint32_t)0x00120000)  //EV1, GENCALL and BUSY flags


#define I2C_EVENT_SLAVE_BYTE_RECEIVED                  0x00020040  //EV2,slave receive: BUSY and RXNE flags
#define I2C_EVENT_SLAVE_STOP_DETECTED                  0x00000010  //EV4,slave receive: STOPF flag
#define I2C_EVENT_SLAVE_BYTE_TRANSMITTED               0x00060084  //EV3,slave transmitter: TRA, BUSY, TXE and BTF flags
#define I2C_EVENT_SLAVE_BYTE_TRANSMITTING              0x00060080  //EV3,slave transmitter: TRA, BUSY and TXE flags
#define I2C_EVENT_SLAVE_ACK_FAILURE                    0x00000400  //EV3_2,slave transmitter: AF flag

//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_I2C_CCR            0x00000000//0x01C
struct I2C_CCR_BIT
{
	UINT32 CCR:12;        //00,Clock Control Register in Fast/Standard mode (Master mode):TH
	UINT32 Reserved0:2;   //12,
	UINT32 DUTY:1;        //14,Fast Mode Duty Cycle:0=(TL/TH=2),1=(TL/TH=16/9
	UINT32 FS:1;          //15,I2C Master Mode Selection:0=Slow Mode(SM,TL/TH=1),1=Fast Mode(FM)
  UINT32 Reserved2:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_I2C_TRISE            0x00000002//0x020
struct I2C_TRISE_BIT
{
	UINT32 TRISE:6;       //00,Maximum Rise Time in Fast/Standard mode (Master mode)
	UINT32 Reserved0:10;  //06,
  UINT32 Reserved2:16;  //16,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define I2C_Struct Struct_I2C
typedef struct Struct_I2C//0x40005400=I2C1,0x40005800=I2C2
{
  union{UINT32 CR1;struct I2C_CR1_BIT CR1_BIT;};   //0x000(RW),I2C Control register 1 
  union{UINT32 CR2;struct I2C_CR2_BIT CR2_BIT;};   //0x004(RW),I2C Control register 2 
  union{UINT32 OAR1;struct I2C_OAR1_BIT OAR1_BIT;};//0x008(RW),
  union{UINT32 OAR2;struct I2C_OAR2_BIT OAR2_BIT;};//0x00C(RW),
  union{UINT32 DR;struct I2C_DR_BIT DR_BIT;};      //0x010(RW),
  union{UINT32 SR1;struct I2C_SR1_BIT SR1_BIT;};   //0x014(RW),
  union{UINT32 SR2;struct I2C_SR2_BIT SR2_BIT;};   //0x018(RW),
  union{UINT32 CCR;struct I2C_CCR_BIT CCR_BIT;};   //0x01C(RW),
  union{UINT32 TRISE;struct I2C_TRISE_BIT TRISE_BIT;};//0x020(RW),
	UINT32 Reserved0[247]; //0x024,
} I2C_Type,Type_I2C;
#define PT_I2C1                 ((volatile Type_I2C *)BASE_I2C1)
#define PT_I2C2                 ((volatile Type_I2C *)BASE_I2C2)
#define PT_I2C(i)               ((volatile Type_I2C *)BASE_I2C(i))
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define I2C_CR1(i)              I2C[i].CR1//i=0_1
#define I2C_CR2(i)              I2C[i].CR2
#define I2C_OAR1(i)             I2C[i].OAR1
#define I2C_OAR2(i)             I2C[i].OAR2
#define I2C_DR(i)               I2C[i].DR
#define I2C_SR1(i)              I2C[i].SR1
#define I2C_SR2(i)              I2C[i].SR2
#define I2C_CCR(i)              I2C[i].CCR
#define I2C_TRISE(i)            I2C[i].TRISE
//==============================================================================================================================
#define RSTV_WWDG_CR            0x0000007F//0x000
struct WWDG_CR_BIT
{
	UINT32 T:7;           //00,T[6:0] bits (7-Bit counter (MSB to LSB))
	UINT32 WDGA:1;        //07,Activation bit
	UINT32 Reserved0:24;  //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_WWDG_CFR           0x0000007F//0x004
struct WWDG_CFR_BIT
{
	UINT32 W:7;           //00,W[6:0] bits (7-bit window value)
	UINT32 WDGTB:2;       //07,WDGTB[1:0] bits (Timer Base)
	UINT32 EWI:1;         //09,Early Wakeup Interrupt
	UINT32 Reserved0:22;  //10,
};
#define WWDG_CFR_WDGTB_DIV1             0//PCLK1/1
#define WWDG_CFR_WDGTB_DIV2             1//PCLK1/2
#define WWDG_CFR_WDGTB_DIV4             2//PCLK1/4
#define WWDG_CFR_WDGTB_DIV8             3//PCLK1/8
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_WWDG_SR            0x00000000//0x008
struct WWDG_SR_BIT
{
	UINT32 EWIF:1;        //00,Early Wakeup Interrupt Flag
	UINT32 Reserved0:31;  //01,
};
//------------------------------------------------------------------------------------------------------------------------------
#define WWDG_Struct Struct_WWDG
typedef struct Struct_WWDG//0x40002C00
{
  union{UINT32 CR;struct WWDG_CR_BIT CR_BIT;};//0x000(RW),
  union{UINT32 CFR;struct WWDG_CFR_BIT CFR_BIT;};//0x004(RW),
  union{UINT32 SR;struct WWDG_SR_BIT SR_BIT;};//0x008(RW),
} WWDG_Type,Type_WWDG;
