diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PT_WWDG                 ((volatile Type_WWDG *)BASE_WWDG)
//------------------------------------------------------------------------------------------------------------------------------
#define WWDG_CR                 WWDG.CR
#define WWDG_CFR                WWDG.CFR
#define WWDG_SR                 WWDG.SR
//==============================================================================================================================
#define RSTV_IWDG_KR              0x00000000//0x000
struct IWDG_KR_BIT
{
	UINT32 KEY:16;        //00,Key value (write only, read 0000h)
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_IWDG_PR              0x00000000//0x004
#define IWDG_PR_DIV4                    0//DIV 4
#define IWDG_PR_DIV8                    1//DIV 8
#define IWDG_PR_DIV16                   2//DIV 16
#define IWDG_PR_DIV32                   3//DIV 32
#define IWDG_PR_DIV64                   4//DIV 64
#define IWDG_PR_DIV128                  5//DIV 128
#define IWDG_PR_DIV256                  6//DIV 256
struct IWDG_PR_BIT
{
	UINT32 PD:3;          //00,PD[2:0] (Prescaler divider)
	UINT32 Reserved0:29;  //03,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_IWDG_RLR             0x00000000//0x008
struct IWDG_RLR_BIT
{
	UINT32 RL:12;         //00,Watchdog counter reload value
	UINT32 Reserved0:20;  //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_IWDG_SR              0x00000000//0x00C
struct IWDG_SR_BIT
{
	UINT32 PVU:1;         //00,Watchdog prescaler value update
	UINT32 RVU:1;         //01,Watchdog counter reload value update
	UINT32 Reserved0:30;  //02,
};
//------------------------------------------------------------------------------------------------------------------------------
#define IWDG_Struct Struct_IWDG
typedef struct Struct_IWDG//0x40003000
{
  union{UINT32 KR;struct IWDG_KR_BIT KR_BIT;};   //0x000(RW),
  union{UINT32 PR;struct IWDG_PR_BIT PR_BIT;};   //0x004(RW),
  union{UINT32 RLR;struct IWDG_RLR_BIT RLR_BIT;};//0x008(RW),
  union{UINT32 SR;struct IWDG_SR_BIT SR_BIT;};   //0x00C(RW),
} IWDG_Type,Type_IWDG;
#define PT_IWDG                 ((volatile Type_IWDG *)BASE_IWDG)
//------------------------------------------------------------------------------------------------------------------------------
#define IWDG_KR                 IWDG.KR
#define IWDG_PR                 IWDG.PR
#define IWDG_RLR                IWDG.RLR
#define IWDG_SR                 IWDG.SR
//==============================================================================================================================
#define RSTV_PWR_CR             0x00000000//0x000
struct PWR_CR_BIT
{
  UINT32 LPDS:1;        //00,Low-Power Deepsleep
  UINT32 PDDS:1;        //01,Power Down Deepsleep
  UINT32 CWUF:1;        //02,Clear Wakeup Flag
  UINT32 CSBF:1;        //03,Clear Standby Flag
  UINT32 PVDE:1;        //04,Power Voltage Detector Enable
  UINT32 PLS:3;         //05,PLS[2:0] bits (PVD Level Selection),PLS=0_7=2.2_2.9V
  UINT32 DBP:1;         //08,Disable Backup Domain write protection
  UINT32 Reserved0:23;
};
#define PWR_CR_LPDS             PWR.CR_BIT.LPDS
#define PWR_CR_PDDS             PWR.CR_BIT.PDDS
#define PWR_CR_CWUF             PWR.CR_BIT.CWUF
#define PWR_CR_CSBF             PWR.CR_BIT.CSBF
#define PWR_CR_PVDE             PWR.CR_BIT.PVDE
#define PWR_CR_PLS              PWR.CR_BIT.PLS
#define PWR_CR_DBP              PWR.CR_BIT.DBP
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_PWR_CSR            0x00000000//0x004
struct PWR_CSR_BIT
{
  UINT32 WUF:1;         //00,Wakeup Flag
  UINT32 SBF:1;         //01,Standby Flag
  UINT32 PVDO:1;        //02,PVD Output
  UINT32 Reserved0:5;   //03,
  UINT32 EWUP:1;        //08,Enable WKUP pin
  UINT32 Reserved1:23;
};
#define PWR_CSR_WUF             PWR.CSR_BIT.WUF
#define PWR_CSR_SBF             PWR.CSR_BIT.SBF
#define PWR_CSR_PVDO            PWR.CSR_BIT.PVDO
#define PWR_CSR_EWUP            PWR.CSR_BIT.EWUP
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define PWR_Struct Struct_PWR
typedef struct Struct_PWR//0x40007000
{
  union{UINT32 CR;struct PWR_CR_BIT CR_BIT;};//0x000(RW),
  union{UINT32 CSR;struct PWR_CSR_BIT CSR_BIT;};//0x004(RW),
} PWR_Type,Type_PWR;
#define PT_PWR                  ((volatile Type_PWR *)BASE_PWR)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define PWR_CR                  PWR.CR
#define PWR_CSR                 PWR.CSR
//==============================================================================================================================
#define RSTV_RCC_CR             0x00000083//0x000
struct RCC_CR_BIT
{
  UINT32 HSION:1;       //00,Internal High Speed clock enable
  UINT32 HSIRDY:1;      //01,Internal High Speed clock ready flag
  UINT32 Reserved0:1;   //02,
  UINT32 HSITRIM:5;     //03,Internal High Speed clock trimming
  UINT32 HSICAL:8;      //08,Internal High Speed clock Calibration
  UINT32 HSEON:1;       //16,External High Speed clock enable,3MHz_25MHz
  UINT32 HSERDY:1;      //17,External High Speed clock ready flag
  UINT32 HSEBYP:1;      //18,External High Speed clock Bypass
  UINT32 CSSON:1;       //19,Clock Security System enable
  UINT32 Reserved1:4;   //20,
  UINT32 PLLON:1;       //24,PLL enable
  UINT32 PLLRDY:1;      //25,PLL clock ready flag
#if IsDensity(CL)
  UINT32 PLL2ON:1;      //26,PLL2 enable
  UINT32 PLL2RDY:1;     //27,PLL2 clock ready flag
  UINT32 PLL3ON:1;      //28,PLL3 enable
  UINT32 PLL3RDY:1;     //29,PLL3 clock ready flag
  UINT32 Reserved2:2;   //30,
#else
  UINT32 Reserved2:6;   //26,
#endif
};
#define RCC_CR_HSION            RCC.CR_BIT.HSION
#define RCC_CR_HSIRDY           RCC.CR_BIT.HSIRDY
#define RCC_CR_HSITRIM          RCC.CR_BIT.HSITRIM
#define RCC_CR_HSICAL           RCC.CR_BIT.HSICAL
#define RCC_CR_HSEON            RCC.CR_BIT.HSEON
#define RCC_CR_HSERDY           RCC.CR_BIT.HSERDY

#define RCC_CR_HSEBYP           RCC.CR_BIT.HSEBYP
#define RCC_CR_CSSON            RCC.CR_BIT.CSSON
#define RCC_CR_PLLON            RCC.CR_BIT.PLLON
#define RCC_CR_PLLRDY           RCC.CR_BIT.PLLRDY
#if IsDensity(CL)
#define RCC_CR_PLL2ON           RCC.CR_BIT.PLL2ON
#define RCC_CR_PLL2RDY          RCC.CR_BIT.PLL2RDY
#define RCC_CR_PLL3ON           RCC.CR_BIT.PLL3ON
#define RCC_CR_PLL3RDY          RCC.CR_BIT.PLL3RDY
#endif
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_CFGR           0x00000000//0x004
#define RCC_CFGR_SW_HSI                 0//HSI selected as system clock
#define RCC_CFGR_SW_HSE                 1//HSE selected as system clock
#define RCC_CFGR_SW_PLL                 2//PLL selected as system clock

#define RCC_CFGR_SWS_HSI                0//HSI oscillator used as system clock
#define RCC_CFGR_SWS_HSE                1//HSE oscillator used as system clock
#define RCC_CFGR_SWS_PLL                2//PLL used as system clock

