diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define RCC_CFGR_MCO_NOCLOCK            0//No clock
#define RCC_CFGR_MCO_SYSCLK             4//System clock selected as MCO source
#define RCC_CFGR_MCO_HSI                5//HSI clock selected as MCO source
#define RCC_CFGR_MCO_HSE                6//HSE clock selected as MCO source
#define RCC_CFGR_MCO_PLLCLK_Div2        7//PLL clock divided by 2 selected as MCO source
#if IsDensity(CL)
#define RCC_CFGR_MCO_PLL2CLK            8//PLL2 clock selected as MCO source
#define RCC_CFGR_MCO_PLL3CLK_Div2       9//PLL3 clock divided by 2 selected as MCO source
#define RCC_CFGR_MCO_Ext_HSE            0x0A//XT1 external 3-25 MHz oscillator clock selected as MCO source
#define RCC_CFGR_MCO_PLL3CLK            0x0B//PLL3 clock selected as MCO source
#endif
struct RCC_CFGR_BIT
{
  UINT32 SW:2;          //00,SW[1:0] bits (System clock Switch)
  UINT32 SWS:2;         //02,SWS[1:0] bits (System Clock Switch Status)
  UINT32 HPRE:4;        //04,HPRE[3:0] bits (AHB prescaler),divided by: 0_7=1,8_B=2^(HPRE-7),C_F=2^(HPRE-6)
  UINT32 PPRE1:3;       //08,PRE1[2:0] bits (APB1 prescaler),divided by: 0_3=1,4_7=2^(PPRE1-3)
  UINT32 PPRE2:3;       //11,PRE2[2:0] bits (APB2 prescaler),divided by: 0_3=1,4_7=2^(PPRE1-3)
  UINT32 ADCPRE:2;      //14,ADCPRE[1:0] bits (ADC prescaler),PCLK2 divided by:0_3= 2*(ADCPRE+1)
#if IsDensity(CL)
  UINT32 PLLSRC:1;      //16,PLL entry clock source :0=HSI, 1= PREDIV1 clock 
  UINT32 PLLXTPRE:1;    //17,HSE divider for PLL entry:0=not divided, 1=PREDIV1/2
  UINT32 PLLMULL:4;     //18,PLLMUL[3:0] bits (PLL multiplication factor),PLL input clock *: 2_7= 4_9 ,11=6.5
  UINT32 USBPRE:1;      //22,USBPRE=OTGFSPRE,USB OTG FS prescaler,PLLVCO/:0=3,1=2
  UINT32 Reserved0:1;   //23,
  UINT32 MCO:4;         //24,MCO[3:0] bits (Microcontroller Clock Output)
  UINT32 Reserved1:4;   //28,
#elif IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  UINT32 PLLSRC:1;      //16,PLL entry clock source :0=HSI/2, 1= PREDIV1
  UINT32 PLLXTPRE:1;    //17,HSE divider for PLL entry:0=not divided, 1=PREDIV1/2
  UINT32 PLLMULL:4;     //18,PLLMUL[3:0] bits (PLL multiplication factor),PLL input clock *:0_14=2_16(PLLMULL+2)
  UINT32 USBPRE:1;      //22,USBPRE=OTGFSPRE,USB OTG FS prescaler,PLLVCO/:0=3,1=2
  UINT32 Reserved0:1;   //23,
  UINT32 MCO:3;         //24,MCO[2:0] bits (Microcontroller Clock Output)
  UINT32 Reserved1:5;   //27,
#else
  UINT32 PLLSRC:1;      //16,PLL entry clock source :0=HSI/2, 1=PREDIV1
  UINT32 PLLXTPRE:1;    //17,PREDIV1 divide by:0=not divided, 1= /2
  UINT32 PLLMULL:4;     //18,PLLMUL[3:0] bits (PLL multiplication factor),PLL input clock *:0_14=2_16(PLLMULL+2)
  UINT32 USBPRE:1;      //22,USBPRE=OTGFSPREUSB Device prescaler, PLLVCO/:0=3,1=2
  UINT32 Reserved0:1;   //23,
  UINT32 MCO:3;         //24,MCO[2:0] bits (Microcontroller Clock Output)
  UINT32 Reserved1:5;   //27,
#endif
};
#define RCC_CFGR_SW             RCC.CFGR_BIT.SW
#define RCC_CFGR_SWS            RCC.CFGR_BIT.SWS
#define RCC_CFGR_HPRE           RCC.CFGR_BIT.HPRE
#define RCC_CFGR_PPRE1          RCC.CFGR_BIT.PPRE1
#define RCC_CFGR_PPRE2          RCC.CFGR_BIT.PPRE2
#define RCC_CFGR_ADCPRE         RCC.CFGR_BIT.ADCPRE
#define RCC_CFGR_PLLSRC         RCC.CFGR_BIT.PLLSRC
#define RCC_CFGR_PLLXTPRE       RCC.CFGR_BIT.PLLXTPRE
#define RCC_CFGR_PLLMULL        RCC.CFGR_BIT.PLLMULL
#define RCC_CFGR_USBPRE         RCC.CFGR_BIT.USBPRE
#define RCC_CFGR_MCO            RCC.CFGR_BIT.MCO
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_CIR            0x00000000//0x008
struct RCC_CIR_BIT
{
  UINT32 LSIRDYF:1;     //00,LSI Ready Interrupt flag
  UINT32 LSERDYF:1;     //01,LSE Ready Interrupt flag
  UINT32 HSIRDYF:1;     //02,HSI Ready Interrupt flag
  UINT32 HSERDYF:1;     //03,HSE Ready Interrupt flag
  UINT32 PLLRDYF:1;     //04,PLL Ready Interrupt flag
#if IsDensity(CL)
  UINT32 PLL2RDYF:1;    //05,PLL2 Ready Interrupt flag
  UINT32 PLL3RDYF:1;    //06,PLL3 Ready Interrupt flag
#else
  UINT32 Reserved0:2;   //05,
#endif
  UINT32 CSSF:1;        //07,Clock Security System Interrupt flag
  UINT32 LSIRDYIE:1;    //08,LSI Ready Interrupt Enable
  UINT32 LSERDYIE:1;    //09,LSE Ready Interrupt Enable
  UINT32 HSIRDYIE:1;    //10,HSI Ready Interrupt Enable
  UINT32 HSERDYIE:1;    //11,HSE Ready Interrupt Enable
  UINT32 PLLRDYIE:1;    //12,PLL Ready Interrupt Enable
#if IsDensity(CL)
  UINT32 PLL2RDYIE:1;   //13,PLL2 Ready Interrupt Enable
  UINT32 PLL3RDYIE:1;   //14,PLL3 Ready Interrupt Enable
  UINT32 Reserved1:1;   //15,
#else
  UINT32 Reserved1:3;   //13,
#endif
  UINT32 LSIRDYC:1;     //16,LSI Ready Interrupt Clear
  UINT32 LSERDYC:1;     //17,LSE Ready Interrupt Clear
  UINT32 HSIRDYC:1;     //18,HSI Ready Interrupt Clear
  UINT32 HSERDYC:1;     //19,HSE Ready Interrupt Clear
  UINT32 PLLRDYC:1;     //20,PLL Ready Interrupt Clear
#if IsDensity(CL)
  UINT32 PLL2RDYC:1;    //21,PLL Ready Interrupt Clear
  UINT32 PLL3RDYC:1;    //22,PLL Ready Interrupt Clear
#else
  UINT32 Reserved2:2;   //21,
#endif
  UINT32 CSSC:1;        //23,Clock Security System Interrupt Clear
  UINT32 Reserved3:8;   //24,
};

#define RCC_CIR_LSIRDYF         RCC.CIR_BIT.LSIRDYF
#define RCC_CIR_LSERDYF         RCC.CIR_BIT.LSERDYF
#define RCC_CIR_HSIRDYF         RCC.CIR_BIT.HSIRDYF
#define RCC_CIR_HSERDYF         RCC.CIR_BIT.HSERDYF
#define RCC_CIR_PLLRDYF         RCC.CIR_BIT.PLLRDYF
#if IsDensity(CL)
#define RCC_CIR_PLL2RDYF        RCC.CIR_BIT.PLL2RDYF
#define RCC_CIR_PLL3RDYF        RCC.CIR_BIT.PLL3RDYF
#endif
#define RCC_CIR_CSSF            RCC.CIR_BIT.CSSF
#define RCC_CIR_LSIRDYIE        RCC.CIR_BIT.LSIRDYIE
#define RCC_CIR_LSERDYIE        RCC.CIR_BIT.LSERDYIE
#define RCC_CIR_HSIRDYIE        RCC.CIR_BIT.HSIRDYIE
#define RCC_CIR_HSERDYIE        RCC.CIR_BIT.HSERDYIE
#define RCC_CIR_PLLRDYIE        RCC.CIR_BIT.PLLRDYIE
#if IsDensity(CL)
#define RCC_CIR_PLL2RDYIE       RCC.CIR_BIT.PLL2RDYIE
#define RCC_CIR_PLL3RDYIE       RCC.CIR_BIT.PLL3RDYIE
#endif
#define RCC_CIR_LSIRDYC         RCC.CIR_BIT.LSIRDYC
#define RCC_CIR_LSERDYC         RCC.CIR_BIT.LSERDYC
#define RCC_CIR_HSIRDYC         RCC.CIR_BIT.HSIRDYC
#define RCC_CIR_HSERDYC         RCC.CIR_BIT.HSERDYC
#define RCC_CIR_PLLRDYC         RCC.CIR_BIT.PLLRDYC
#if IsDensity(CL)
#define RCC_CIR_PLL2RDYC        RCC.CIR_BIT.PLL2RDYC
#define RCC_CIR_PLL3RDYC        RCC.CIR_BIT.PLL3RDYC
#endif
#define RCC_CIR_CSSC            RCC.CIR_BIT.CSSC

//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_APB2RSTR       0x00000000//0x00C
struct RCC_APB2RSTR_BIT
{
  UINT32 AFIORST:1;     //00,Alternate Function I/O reset
  UINT32 Reserved0:1;   //01,
  UINT32 IOPARST:1;     //02,I/O port A reset
  UINT32 IOPBRST:1;     //03,I/O port B reset
  UINT32 IOPCRST:1;     //04,I/O port C reset
  UINT32 IOPDRST:1;     //05,I/O port D reset
#if IsDensity(LD) || IsDensity(LD_VL)
  UINT32 Reserved1:3;   //06,
#else
  UINT32 IOPERST:1;     //06,I/O port E reset
#if IsDensity(HD) || IsDensity(XL)
  UINT32 IOPFRST:1;     //07,I/O port F reset
  UINT32 IOPGRST:1;     //08,I/O port G reset
#else
  UINT32 Reserved1:2;   //07,
#endif
#endif

  UINT32 ADC1RST:1;     //09,ADC 1 interface reset
#if !IsDensity(LD_VL) && !IsDensity(MD_VL) && ! IsDensity(HD_VL)
  UINT32 ADC2RST:1;     //10,ADC 2 interface reset
#else
  UINT32 Reserved2:1;   //10,
#endif
  UINT32 TIM1RST:1;     //11,TIM1 Timer reset
  UINT32 SPI1RST:1;     //12,SPI 1 reset
#if IsDensity(HD)||IsDensity(XL)
  UINT32 TIM8RST:1;     //13,TIM8 Timer reset
#else
  UINT32 Reserved3:1;   //13,
#endif  
  UINT32 USART1RST:1;   //14,USART1 reset
#if IsDensity(HD)||IsDensity(XL)
  UINT32 ADC3RST:1;     //15,ADC3 interface reset,<LDY>
#else
  UINT32 Reserved4:1;   //15,
#endif  

