diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#if IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  UINT32 TIM15RST:1;    //16,TIM15 Timer reset,<LDY>
  UINT32 TIM16RST:1;    //17,TIM16 Timer reset,<LDY>
  UINT32 TIM17RST:1;    //18,TIM17 Timer reset,<LDY>
#else
  UINT32 Reserved5:3;   //16,
#endif
#if IsDensity(XL)
  UINT32 TIM9RST        //19,TIM9 Timer reset, <LDY>
  UINT32 TIM10RST       //20,TIM10 Timer reset,<LDY>
  UINT32 TIM11RST       //21,TIM11 Timer reset,<LDY>
#else
  UINT32 Reserved6:3;   //19,
#endif
  UINT32 Reserved7:10;  //22,
};

#define RCC_APB2RSTR_AFIORST    RCC.APB2RSTR_BIT.AFIORST
#define RCC_APB2RSTR_IOPARST    RCC.APB2RSTR_BIT.IOPARST
#define RCC_APB2RSTR_IOPBRST    RCC.APB2RSTR_BIT.IOPBRST
#define RCC_APB2RSTR_IOPCRST    RCC.APB2RSTR_BIT.IOPCRST
#define RCC_APB2RSTR_IOPDRST    RCC.APB2RSTR_BIT.IOPDRST
#if !IsDensity(LD) && !IsDensity(LD_VL)
#define RCC_APB2RSTR_IOPERST    RCC.APB2RSTR_BIT.IOPERST
#if IsDensity(HD) || IsDensity(XL)
#define RCC_APB2RSTR_IOPFRST    RCC.APB2RSTR_BIT.IOPFRST
#define RCC_APB2RSTR_IOPGRST    RCC.APB2RSTR_BIT.IOPGRST
#endif
#endif
#define RCC_APB2RSTR_ADC1RST    RCC.APB2RSTR_BIT.ADC1RST
#if !IsDensity(LD_VL) && !IsDensity(MD_VL) && ! IsDensity(HD_VL)
#define RCC_APB2RSTR_ADC2RST    RCC.APB2RSTR_BIT.ADC2RST
#endif
#define RCC_APB2RSTR_TIM1RST    RCC.APB2RSTR_BIT.TIM1RST
#define RCC_APB2RSTR_SPI1RST    RCC.APB2RSTR_BIT.SPI1RST
#if IsDensity(HD)||IsDensity(XL)
#define RCC_APB2RSTR_TIM8RST    RCC.APB2RSTR_BIT.TIM8RST
#endif
#define RCC_APB2RSTR_USART1RST  RCC.APB2RSTR_BIT.USART1RST
#if IsDensity(HD)||IsDensity(XL)
#define RCC_APB2RSTR_ADC3RST    RCC.APB2RSTR_BIT.ADC3RST
#endif
#if IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
#define RCC_APB2RSTR_TIM15RST   RCC.APB2RSTR_BIT.TIM15RST
#define RCC_APB2RSTR_TIM16RST   RCC.APB2RSTR_BIT.TIM16RST
#define RCC_APB2RSTR_TIM17RST   RCC.APB2RSTR_BIT.TIM17RST
#endif
#if IsDensity(XL)
#define RCC_APB2RSTR_TIM9RST    RCC.APB2RSTR_BIT.TIM9RST
#define RCC_APB2RSTR_TIM10RST   RCC.APB2RSTR_BIT.TIM10RST
#define RCC_APB2RSTR_TIM11RST   RCC.APB2RSTR_BIT.TIM11RST
#endif
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_APB1RSTR       0x00000000//0x010
struct RCC_APB1RSTR_BIT
{
  UINT32 TIM2RST:1;     //00,Timer 2 reset 
  UINT32 TIM3RST:1;     //01,Timer 3 reset 
#if !IsDensity(LD) && !IsDensity(LD_VL)
  UINT32 TIM4RST:1;     //02,Timer 4 reset
#else
  UINT32 Reserved0:1;   //02,
#endif
#if IsDensity(HD) ||IsDensity(HD_VL)|| IsDensity(CL) || IsDensity(XL)
  UINT32 TIM5RST:1;     //03,Timer 5 reset
#else
  UINT32 Reserved1:1;   //03,
#endif
#if IsDensity(HD) ||IsDensity(CL) || IsDensity(XL)|| IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  UINT32 TIM6RST:1;     //04,Timer 6 reset
  UINT32 TIM7RST:1;     //05,Timer 7 reset
#else
  UINT32 Reserved2:2;   //04,
#endif

#if IsDensity(HD_VL) || IsDensity(XL)
  UINT32 TIM12RST:1;    //06,TIM12 Timer reset 
  UINT32 TIM13RST:1;    //07,TIM13 Timer reset 
  UINT32 TIM14RST:1;    //08,TIM14 Timer reset
#else
  UINT32 Reserved3:3;   //06,
#endif
  UINT32 Reserved4:2;   //09,
  UINT32 WWDGRST:1;     //11,Window Watchdog reset
  UINT32 Reserved5:2;   //12,
#if !IsDensity(LD) && !IsDensity(LD_VL)
  UINT32 SPI2RST:1;     //14,SPI 2 reset
#else
  UINT32 Reserved6:1;   //14,
#endif
#if IsDensity(HD)|| IsDensity(HD_VL)|| IsDensity(CL) || IsDensity(XL)
  UINT32 SPI3RST:1;     //15,SPI 3 reset
#else
  UINT32 Reserved7:1;   //15,
#endif
  UINT32 Reserved8:1;   //16,
  UINT32 UART2RST:1;    //17,USART 2 reset
#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
  UINT32 UART3RST:1;    //18,USART 3 reset
#else
  UINT32 Reserved9:1;   //18,
#endif
#if IsDensity(HD)|| IsDensity(HD_VL)|| IsDensity(CL) || IsDensity(XL)
  UINT32 UART4RST:1;    //19,UART 4 reset 
  UINT32 UART5RST:1;    //20,UART 5 reset 
#else
  UINT32 Reserved10:2;
#endif
  UINT32 I2C1RST:1;     //21,I2C 1 reset

#if !IsDensity(LD) && !IsDensity(LD_VL)
  UINT32 I2C2RST:1;     //22,I2C 2 reset
#else
  UINT32 Reserved11:1;  //22,
#endif
#if IsDensity(HD) || IsDensity(MD) || IsDensity(LD) || IsDensity(XL)
  UINT32 USBRST:1;      //23,USB Device reset
#else
  UINT32 Reserved12:1;  //23,
#endif
  UINT32 Reserved13:1;  //24,
#if !IsDensity(LD_VL) && !IsDensity(MD_VL) && !IsDensity(HD_VL)
  UINT32 CAN1RST:1;     //25,CAN1 reset
#else
  UINT32 Reserved14:1;  //25,
#endif
#if IsDensity(CL)
  UINT32 CAN2RST:1;     //26,CAN2 reset
#else
  UINT32 Reserved15:1;  //26,
#endif
  UINT32 BKPRST:1;      //27,Backup interface reset
  UINT32 PWRRST:1;      //28,Power interface reset
#if IsDensity(HD) || IsDensity(CL) || IsDensity(XL)|| IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  UINT32 DACRST:1;      //29,DAC interface reset
#else
  UINT32 Reserved16:1;  //29,
#endif
#if IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  UINT32 CECRST:1;      //30,CEC interface reset
#else
  UINT32 Reserved17:1;  //30,
#endif
  UINT32 Reserved18:1;  //31,
};

#define RCC_APB1RSTR_TIM2RST    RCC.APB1RSTR_BIT.TIM2RST
#define RCC_APB1RSTR_TIM3RST    RCC.APB1RSTR_BIT.TIM3RST
#if !IsDensity(LD) && !IsDensity(LD_VL)
  #define RCC_APB1RSTR_TIM4RST  RCC.APB1RSTR_BIT.TIM4RST
#endif
#if IsDensity(HD) ||IsDensity(HD_VL)|| IsDensity(CL) || IsDensity(XL)
  #define RCC_APB1RSTR_TIM5RST  RCC.APB1RSTR_BIT.TIM5RST  
#endif
#if IsDensity(HD) ||IsDensity(CL) || IsDensity(XL)|| IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  #define RCC_APB1RSTR_TIM6RST  RCC.APB1RSTR_BIT.TIM6RST  
  #define RCC_APB1RSTR_TIM7RST  RCC.APB1RSTR_BIT.TIM7RST  
#endif
#if IsDensity(HD_VL) || IsDensity(XL)
  #define RCC_APB1RSTR_TIM12RST RCC.APB1RSTR_BIT.TIM12RST
  #define RCC_APB1RSTR_TIM13RST RCC.APB1RSTR_BIT.TIM13RST
  #define RCC_APB1RSTR_TIM14RST RCC.APB1RSTR_BIT.TIM14RST
#endif
  #define RCC_APB1RSTR_WWDGRST RCC.APB1RSTR_BIT.WWDGRST
#if !IsDensity(LD) && !IsDensity(LD_VL)
  #define RCC_APB1RSTR_SPI2RST RCC.APB1RSTR_BIT.SPI2RST
#endif
#if IsDensity(HD)|| IsDensity(HD_VL)|| IsDensity(CL) || IsDensity(XL)
  #define RCC_APB1RSTR_SPI3RST RCC.APB1RSTR_BIT.SPI3RST
#endif
  #define RCC_APB1RSTR_UART2RST RCC.APB1RSTR_BIT.UART2RST
#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
  #define RCC_APB1RSTR_UART3RST RCC.APB1RSTR_BIT.UART3RST
#endif
#if IsDensity(HD)|| IsDensity(HD_VL)|| IsDensity(CL) || IsDensity(XL)
  #define RCC_APB1RSTR_UART4RST RCC.APB1RSTR_BIT.UART4RST
  #define RCC_APB1RSTR_UART5RST RCC.APB1RSTR_BIT.UART5RST
#endif
  #define RCC_APB1RSTR_I2C1RST RCC.APB1RSTR_BIT.I2C1RST
#if !IsDensity(LD) && !IsDensity(LD_VL)
  #define RCC_APB1RSTR_I2C2RST RCC.APB1RSTR_BIT.I2C2RST
#endif
#if IsDensity(HD) || IsDensity(MD) || IsDensity(LD) || IsDensity(XL)
  #define RCC_APB1RSTR_USBRST  RCC.APB1RSTR_BIT.USBRST
#endif
#if !IsDensity(LD_VL) && !IsDensity(MD_VL) && !IsDensity(HD_VL)
  #define RCC_APB1RSTR_CAN1RST RCC.APB1RSTR_BIT.CAN1RST
#endif
#if IsDensity(CL)
  #define RCC_APB1RSTR_CAN2RST RCC.APB1RSTR_BIT.CAN2RST
#endif
  #define RCC_APB1RSTR_BKPRST  RCC.APB1RSTR_BIT.BKPRST
  #define RCC_APB1RSTR_PWRRST  RCC.APB1RSTR_BIT.PWRRST
#if IsDensity(HD) || IsDensity(CL) || IsDensity(XL)|| IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  #define RCC_APB1RSTR_DACRST  RCC.APB1RSTR_BIT.DACRST
#endif
#if IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  #define RCC_APB1RSTR_CECRST  RCC.APB1RSTR_BIT.CECRST
#endif
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_AHBENR         0x00000014//0x014
struct RCC_AHBENR_BIT
{
	UINT32 DMA1EN:1;      //00,DMA1 clock enable
  UINT32 DMA2EN:1;      //01,DMA2 clock enable,only for IsDensity(HD) || IsDensity(CL) || IsDensity(HD_VL)
	UINT32 SRAMEN:1;      //02,SRAM interface clock enable
	UINT32 Reserved1:1;   //03,
	UINT32 FLITFEN:1;     //04,FLITF clock enable
	UINT32 Reserved2:1;   //05,
	UINT32 CRCEN:1;       //06,CRC clock enable
	UINT32 Reserved3:1;   //07,
	UINT32 FSMCEN:1;      //08,FSMC clock enable,only for IsDensity(HD) || IsDensity(XL)||IsDensity(VL)
	UINT32 Reserved5:1;   //09,
  UINT32 SDIOEN:1;      //10,SDIO clock enable,only for IsDensity(HD) || IsDensity(XL)
  UINT32 Reserved7:1;   //11,
  UINT32 OTGFSEN:1;     //12,USB OTG FS clock enable,only for IsDensity(CL)
	UINT32 Reserved8:1;   //13,
	UINT32 ETHMACEN:1;    //14,ETHERNET MAC clock enable,only for IsDensity(CL)
	UINT32 ETHMACTXEN:1;  //15,ETHERNET MAC Tx clock enable,only for IsDensity(CL)
	UINT32 ETHMACRXEN:1;  //16,ETHERNET MAC Rx clock enable,only for IsDensity(CL)
  UINT32 Reserved9:15;  //17,
};
