diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define RCC_AHBENR_DMA1EN       RCC.AHBENR_BIT.DMA1EN
#define RCC_AHBENR_DMA2EN       RCC.AHBENR_BIT.DMA2EN//IsDensity(HD) || IsDensity(CL) || IsDensity(HD_VL)
#define RCC_AHBENR_SRAMEN       RCC.AHBENR_BIT.SRAMEN
#define RCC_AHBENR_FLITFEN      RCC.AHBENR_BIT.FLITFEN
#define RCC_AHBENR_CRCEN        RCC.AHBENR_BIT.CRCEN
#define RCC_AHBENR_FSMCEN       RCC.AHBENR_BIT.FSMCEN//IsDensity(HD) || IsDensity(XL)||IsDensity(VL)
#define RCC_AHBENR_SDIOEN       RCC.AHBENR_BIT.SDIOEN//IsDensity(HD) || IsDensity(XL)
#define RCC_AHBENR_OTGFSEN      RCC.AHBENR_BIT.OTGFSEN//IsDensity(CL)
#define RCC_AHBENR_ETHMACEN     RCC.AHBENR_BIT.ETHMACEN//IsDensity(CL)
#define RCC_AHBENR_ETHMACTXEN   RCC.AHBENR_BIT.ETHMACTXEN//IsDensity(CL)
#define RCC_AHBENR_ETHMACRXEN   RCC.AHBENR_BIT.ETHMACRXEN//IsDensity(CL)
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_APB2ENR        0x00000000//0x018
struct RCC_APB2ENR_BIT
{
	UINT32 AFIOEN:1;      //00,Alternate Function I/O clock enable
	UINT32 Reserved0:1;   //01,
	UINT32 IOPAEN:1;      //02,I/O port A clock enable
	UINT32 IOPBEN:1;      //03,I/O port B clock enable
	UINT32 IOPCEN:1;      //04,I/O port C clock enable
	UINT32 IOPDEN:1;      //05,I/O port D clock enable
  UINT32 IOPEEN:1;      //06,I/O port E clock enable,only for !IsDensity(LD) && !IsDensity(LD_VL)
	UINT32 IOPFEN:1;      //07,only for IsDensity(HD) || IsDensity(XL) || IsDensity(HD_VL)
	UINT32 IOPGEN:1;      //08,only for IsDensity(HD) || IsDensity(XL) || IsDensity(HD_VL)
	UINT32 ADC1EN:1;      //09,ADC 1 interface clock enable
	UINT32 ADC2EN:1;      //10,ADC 2 interface clock enable
	UINT32 TIM1EN:1;      //11,TIM1 Timer clock enable
	UINT32 SPI1EN:1;      //12,SPI 1 clock enable 
  UINT32 TIM8EN:1;      //13,TIM8 Timer clock enable,only for IsDensity(HD) || IsDensity(XL)
  UINT32 UART1EN:1;     //14,USART1 clock enable
  UINT32 ADC3EN:1;      //15,ADC3 clock enable,only for IsDensity(HD) || IsDensity(XL)
  UINT32 TIM15EN:1;     //16,TIM15 Timer clock enable,only for IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  UINT32 TIM16EN:1;     //17,TIM16 Timer clock enable,only for IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  UINT32 TIM17EN:1;     //18,TIM17 Timer clock enable,only for IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
  UINT32 TIM9EN:1;      //19,TIM9  Timer clock enable,only for IsDensity(XL)
  UINT32 TIM10EN:1;     //20,TIM10 Timer clock enable,only for IsDensity(XL)
  UINT32 TIM11EN:1;     //21,TIM11 Timer clock enable,only for IsDensity(XL)
  UINT32 Reserved8:10;  //22,
};
#define RCC_APB2ENR_AFIOEN    RCC.APB2ENR_BIT.AFIOEN
#define RCC_APB2ENR_IOPAEN    RCC.APB2ENR_BIT.IOPAEN
#define RCC_APB2ENR_IOPBEN    RCC.APB2ENR_BIT.IOPBEN
#define RCC_APB2ENR_IOPCEN    RCC.APB2ENR_BIT.IOPCEN
#define RCC_APB2ENR_IOPDEN    RCC.APB2ENR_BIT.IOPDEN
#define RCC_APB2ENR_IOPEEN    RCC.APB2ENR_BIT.IOPEEN //!IsDensity(LD) && !IsDensity(LD_VL)
#define RCC_APB2ENR_IOPFEN    RCC.APB2ENR_BIT.IOPFEN //IsDensity(HD) || IsDensity(XL) || IsDensity(HD_VL)
#define RCC_APB2ENR_IOPGEN    RCC.APB2ENR_BIT.IOPGEN //IsDensity(HD) || IsDensity(XL) || IsDensity(HD_VL)
#define RCC_APB2ENR_ADC1EN    RCC.APB2ENR_BIT.ADC1EN
#define RCC_APB2ENR_TIM1EN    RCC.APB2ENR_BIT.TIM1EN
#define RCC_APB2ENR_SPI1EN    RCC.APB2ENR_BIT.SPI1EN
#define RCC_APB2ENR_TIM8EN    RCC.APB2ENR_BIT.TIM8EN //IsDensity(HD) || IsDensity(XL)
#define RCC_APB2ENR_UART1EN   RCC.APB2ENR_BIT.UART1EN
#define RCC_APB2ENR_ADC3EN    RCC.APB2ENR_BIT.ADC3EN //IsDensity(HD) || IsDensity(XL)
#define RCC_APB2ENR_TIM15EN   RCC.APB2ENR_BIT.TIM15EN//IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
#define RCC_APB2ENR_TIM16EN   RCC.APB2ENR_BIT.TIM16EN//IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
#define RCC_APB2ENR_TIM17EN   RCC.APB2ENR_BIT.TIM17EN//IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
#define RCC_APB2ENR_TIM9EN    RCC.APB2ENR_BIT.TIM9EN //IsDensity(XL)
#define RCC_APB2ENR_TIM10EN   RCC.APB2ENR_BIT.TIM10EN//IsDensity(XL)
#define RCC_APB2ENR_TIM11EN   RCC.APB2ENR_BIT.TIM11EN//IsDensity(XL)
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_APB1ENR        0x00000000//0x01C
struct RCC_APB1ENR_BIT
{
	UINT32 TIM2EN:1;      //00,Timer 2 clock enabled
	UINT32 TIM3EN:1;      //01,Timer 3 clock enabled
	UINT32 TIM4EN:1;      //02,Timer 4 clock enabled,only for !IsDensity(LD) && !IsDensity(LD_VL)
	UINT32 TIM5EN:1;      //03,Timer 5 clock enable,only for IsDensity(HD) || IsDensity(CL) || IsDensity(HD_VL)
	UINT32 TIM6EN:1;      //04,Timer 6 clock enable,only for IsDensity(HD) ||IsDensity(CL)||IsDensity(LD_VL) || defined  (STM32F10X_MD_VL) || IsDensity(HD_VL)
	UINT32 TIM7EN:1;      //05,Timer 7 clock enable,only for IsDensity(HD) ||IsDensity(CL)||IsDensity(LD_VL) || defined  (STM32F10X_MD_VL) || IsDensity(HD_VL)
	UINT32 TIM12EN:1;     //06,Timer 12 clock enable,only for IsDensity(HD_VL)||IsDensity(XL)
	UINT32 TIM13EN:1;     //07,Timer 13 clock enable,only for IsDensity(HD_VL)||IsDensity(XL)
	UINT32 TIM14EN:1;     //08,Timer 14 clock enable,only for IsDensity(HD_VL)||IsDensity(XL)
  UINT32 Reserved4:2;   //09,
  UINT32 WWDGEN:1;      //11,Window Watchdog clock enable
	UINT32 Reserved5:2;   //12,
  UINT32 SPI2EN:1;      //14,SPI 2 clock enable,only for !IsDensity(LD) && !IsDensity(LD_VL)
  UINT32 SPI3EN:1;      //15,SPI 3 clock enable,only for IsDensity(HD) || IsDensity(CL)|| IsDensity(HD_VL)
  UINT32 Reserved8:1;   //16,
  UINT32 USART2EN:1;    //17,USART 2 clock enable
  UINT32 USART3EN:1;    //18,USART 3 clock enable,only for !IsDensity(LD) && !IsDensity(LD_VL)
  UINT32 USART4EN:1;    //19,USART 4 clock enable,only for IsDensity(HD) || IsDensity(CL) 	|| IsDensity(HD_VL)
  UINT32 USART5EN:1;    //20,USART 5 clock enable,only for IsDensity(HD) || IsDensity(CL) 	|| IsDensity(HD_VL)
  UINT32 I2C1EN:1;      //21,I2C 1 clock enable
  UINT32 I2C2EN:1;      //22,I2C 1 clock enable,only for !IsDensity(LD) && !IsDensity(LD_VL)
  UINT32 USBEN:1;       //23,USB Device clock enable,only for  IsDensity(HD) ||IsDensity(MD) || IsDensity(LD)
  UINT32 Reserved12:1;  //24,
  UINT32 CAN1EN:1;      //25,CAN1 clock enable,only for !IsDensity(LD_VL) && !IsDensity(MD_VL) && !IsDensity(HD_VL)
  UINT32 CAN2EN:1;      //26,CAN2 clock enable,only for IsDensity(CL)
  UINT32 BKPEN:1;       //27,Backup interface clock enable
  UINT32 PWREN:1;       //28,Power interface clock enable
  UINT32 DACEN:1;       //29,DAC interface clock enable,only for IsDensity(HD) || IsDensity(CL)||IsDensity(LD_VL) || IsDensity(MD_VL) ||IsDensity(HD_VL)
  UINT32 CECEN:1;       //30,CEC interface clock enable,only for IsDensity(LD_VL) || IsDensity(MD_VL) ||IsDensity(HD_VL)
  UINT32 Reserved17:1;  //31,
};
#define RCC_APB1ENR_TIM2EN    RCC.APB1ENR_BIT.TIM2EN  
#define RCC_APB1ENR_TIM3EN    RCC.APB1ENR_BIT.TIM3EN  
#define RCC_APB1ENR_TIM4EN    RCC.APB1ENR_BIT.TIM4EN  //!IsDensity(LD) && !IsDensity(LD_VL)
#define RCC_APB1ENR_TIM5EN    RCC.APB1ENR_BIT.TIM5EN //IsDensity(HD) || IsDensity(CL) || IsDensity(HD_VL)
#define RCC_APB1ENR_TIM6EN    RCC.APB1ENR_BIT.TIM6EN //IsDensity(HD) ||IsDensity(CL)||IsDensity(LD_VL) || defined  (STM32F10X_MD_VL) || IsDensity(HD_VL)
#define RCC_APB1ENR_TIM7EN    RCC.APB1ENR_BIT.TIM7EN //IsDensity(HD) ||IsDensity(CL)||IsDensity(LD_VL) || defined  (STM32F10X_MD_VL) || IsDensity(HD_VL)
#define RCC_APB1ENR_TIM12EN    RCC.APB1ENR_BIT.TIM12EN //IsDensity(HD_VL)||IsDensity(XL)
#define RCC_APB1ENR_TIM13EN    RCC.APB1ENR_BIT.TIM13EN //IsDensity(HD_VL)||IsDensity(XL)
#define RCC_APB1ENR_TIM14EN    RCC.APB1ENR_BIT.TIM14EN //IsDensity(HD_VL)||IsDensity(XL)
#define RCC_APB1ENR_WWDGEN    RCC.APB1ENR_BIT.WWDGEN
#define RCC_APB1ENR_SPI2EN    RCC.APB1ENR_BIT.SPI2EN//!IsDensity(LD) && !IsDensity(LD_VL)
#define RCC_APB1ENR_SPI3EN    RCC.APB1ENR_BIT.SPI3EN//IsDensity(HD) || IsDensity(CL)|| IsDensity(HD_VL)
#define RCC_APB1ENR_USART2EN  RCC.APB1ENR_BIT.USART2EN
#define RCC_APB1ENR_USART3EN  RCC.APB1ENR_BIT.USART3EN//!IsDensity(LD) && !IsDensity(LD_VL)
#define RCC_APB1ENR_USART4EN  RCC.APB1ENR_BIT.USART4EN//IsDensity(HD) || IsDensity(CL) 	|| IsDensity(HD_VL)
#define RCC_APB1ENR_USART5EN  RCC.APB1ENR_BIT.USART5EN//IsDensity(HD) || IsDensity(CL) 	|| IsDensity(HD_VL)
#define RCC_APB1ENR_I2C1EN  RCC.APB1ENR_BIT.I2C1EN
#define RCC_APB1ENR_I2C2EN  RCC.APB1ENR_BIT.I2C2EN//!IsDensity(LD) && !IsDensity(LD_VL)
#define RCC_APB1ENR_USBEN  RCC.APB1ENR_BIT.USBEN//IsDensity(HD) ||IsDensity(MD) || IsDensity(LD)
#define RCC_APB1ENR_CAN1EN  RCC.APB1ENR_BIT.CAN1EN//!IsDensity(LD_VL) && !IsDensity(MD_VL) && !IsDensity(HD_VL)
#define RCC_APB1ENR_CAN2EN  RCC.APB1ENR_BIT.CAN2EN//IsDensity(CL)
#define RCC_APB1ENR_BKPEN  RCC.APB1ENR_BIT.BKPEN
#define RCC_APB1ENR_PWREN  RCC.APB1ENR_BIT.PWREN
#define RCC_APB1ENR_DACEN  RCC.APB1ENR_BIT.DACEN//IsDensity(HD) || IsDensity(CL)||IsDensity(LD_VL) || IsDensity(MD_VL) ||IsDensity(HD_VL)
#define RCC_APB1ENR_CECEN  RCC.APB1ENR_BIT.CECEN//IsDensity(LD_VL) || IsDensity(MD_VL) ||IsDensity(HD_VL)
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_BDCR             0x00000000//0x020
#define RCC_BDCR_RTCSEL_NOCLOCK         0 //No clock
#define RCC_BDCR_RTCSEL_LSE             1 //LSE oscillator clock used as RTC clock
#define RCC_BDCR_RTCSEL_LSI             2 //LSI oscillator clock used as RTC clock
#define RCC_BDCR_RTCSEL_HSE             3 //HSE oscillator clock divided by 128 used as RTC clock
struct RCC_BDCR_BIT
{
	UINT32 LSEON:1;       //00,External Low Speed oscillator enable
	UINT32 LSERDY:1;      //01,External Low Speed oscillator Ready
	UINT32 LSEBYP:1;      //02,External Low Speed oscillator Bypass
  UINT32 Reserved0:5;   //03,
	UINT32 RTCSEL:2;      //08,RTCSEL[1:0] bits (RTC clock source selection):0=NO,1=LSE,2=LSI,3=HSE/128
	UINT32 Reserved1:5;   //10,
	UINT32 RTCEN:1;       //15,RTC clock enable
	UINT32 BDRST:1;       //16,Backup domain software reset
	UINT32 Reserved2:15;  //17,
};
#define RCC_BDCR_LSEON          RCC.BDCR_BIT.LSEON
#define RCC_BDCR_LSERDY         RCC.BDCR_BIT.LSERDY
#define RCC_BDCR_LSEBYP         RCC.BDCR_BIT.LSEBYP
#define RCC_BDCR_RTCSEL         RCC.BDCR_BIT.RTCSEL
#define RCC_BDCR_RTCEN          RCC.BDCR_BIT.RTCEN
#define RCC_BDCR_BDRST          RCC.BDCR_BIT.BDRST
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_CSR            0x0C000000//0x024
struct RCC_CSR_BIT
{
	UINT32 LSION:1;       //00,Internal Low Speed oscillator enable
	UINT32 LSIRDY:1;      //01,Internal Low Speed oscillator Ready
  UINT32 Reserved0:22;  //02,
	UINT32 RMVF:1;        //24,Remove reset flag
	UINT32 Reserved1:1;   //25,
	UINT32 PINRSTF:1;     //26,PIN reset flag
	UINT32 PORRSTF:1;     //27,POR/PDR reset flag
	UINT32 SFTRSTF:1;     //28,Software Reset flag
	UINT32 IWDGRSTF:1;    //29,Independent Watchdog reset flag
	UINT32 WWDGRSTF:1;    //30,Window watchdog reset flag
	UINT32 LPWRRSTF:1;    //31,Low-Power reset flag
};
#define RCC_CSR_LSION           RCC.CSR_BIT.LSION
#define RCC_CSR_LSIRDY          RCC.CSR_BIT.LSIRDY
#define RCC_CSR_RMVF            RCC.CSR_BIT.RMVF
#define RCC_CSR_PINRSTF         RCC.CSR_BIT.PINRSTF
#define RCC_CSR_PORRSTF         RCC.CSR_BIT.PORRSTF
#define RCC_CSR_SFTRSTF         RCC.CSR_BIT.SFTRSTF
#define RCC_CSR_IWDGRSTF        RCC.CSR_BIT.IWDGRSTF
#define RCC_CSR_WWDGRSTF        RCC.CSR_BIT.WWDGRSTF
#define RCC_CSR_LPWRRSTF        RCC.CSR_BIT.LPWRRSTF
//------------------------------------------------------------------------------------------------------------------------------
#if IsDensity(CL)
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_AHBRSTR          0x0C000000//0x028
struct RCC_AHBRSTR_BIT
{
  UINT32 Reserved0:12;  //00,
	UINT32 OTGFSRST:1;    //12,USB OTG FS reset
	UINT32 Reserved1:1;   //13,
	UINT32 ETHMACRST:1;   //14,ETHERNET MAC reset
	UINT32 Reserved2:17;  //15,
};
