diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
union RCC_AHBRSTR_REG//0x028
{
	UINT32                  VAL;
	struct RCC_AHBRSTR_BIT BIT;
};
#define RCC_AHBRSTR_OTGFSRST    RCC.AHBRSTR_BIT.OTGFSRST
#define RCC_AHBRSTR_ETHMACRST   RCC.AHBRSTR_BIT.ETHMACRST
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_CFGR2          0x0C000000//0x02C
struct RCC_CFGR2_BIT
{
  UINT32 PREDIV1:4;     //00,PREDIV1[3:0] bits,PREDIV1 input clock divided: PREDIV1=0_15= by 1_16
	UINT32 PREDIV2:4;     //04,PREDIV2[3:0] bits,PREDIV2 input clock divided: PREDIV2=0_15= by 1_16
	UINT32 PLL2MUL:4;     //08,PLL2MUL[3:0] bits,PLL2 input clock: PLL2MUL=0x06_0x0C= *(PLL2MUL+2),0x0E=*16,0x0F=*20
	UINT32 PLL3MUL:4;     //12,PLL3MUL[3:0] bits,PLL3 input clock: PLL3MUL=0x06_0x0C= *(PLL3MUL+2),0x0E=*16,0x0F=*20 
	UINT32 PREDIV1SRC:1;  //16,PREDIV1 entry clock source:0=HSE,1=PLL2
	UINT32 I2S2SRC:1;     //17,I2S2 entry clock source:0=Sysclk,1=PLL2
	UINT32 I2S3SRC:1;     //18,I2S3 entry clock source:0=Sysclk,1=PLL3
	UINT32 Reserved0:13;  //19,
};
#define RCC_CFGR2_PREDIV1       RCC.CFGR2_BIT.PREDIV1
#define RCC_CFGR2_PREDIV2       RCC.CFGR2_BIT.PREDIV2
#define RCC_CFGR2_PLL2MUL       RCC.CFGR2_BIT.PLL2MUL
#define RCC_CFGR2_PLL3MUL       RCC.CFGR2_BIT.PLL3MUL
#define RCC_CFGR2_PREDIV1SRC    RCC.CFGR2_BIT.PREDIV1SRC
#define RCC_CFGR2_I2S2SRC       RCC.CFGR2_BIT.I2S2SRC
#define RCC_CFGR2_I2S3SRC       RCC.CFGR2_BIT.I2S3SRC
//------------------------------------------------------------------------------------------------------------------------------
#endif
#if IsDensity(LD_VL) || IsDensity(MD_VL) || IsDensity(HD_VL)
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RCC_CFGR2            0x0C000000//0x02C
struct RCC_CFGR2_BIT
{
  UINT32 PREDIV1:4;     //00,PREDIV1[3:0] bits,PREDIV1 input clock divided: PREDIV1=0_15= by 1_16
	UINT32 Reserved0:28;  //04,
};
union RCC_CFGR2_REG//0x02C
{
	UINT32                VAL;
	struct RCC_CFGR2_BIT BIT;
};
#define RCC_CFGR2_PREDIV1       RCC.CFGR2_BIT.PREDIV1
//------------------------------------------------------------------------------------------------------------------------------
#endif
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define RCC_Struct Struct_RCC
typedef struct Struct_RCC//0x40021000
{
  union{UINT32 CR;struct RCC_CR_BIT CR_BIT;};                  //0x000(RW),
  union{UINT32 CFGR;struct RCC_CFGR_BIT CFGR_BIT;};            //0x004(RW),
  union{UINT32 CIR;struct RCC_CIR_BIT CIR_BIT;};               //0x008(RW),
  union{UINT32 APB2RSTR;struct RCC_APB2RSTR_BIT APB2RSTR_BIT;};//0x00C(RW),
  union{UINT32 APB1RSTR;struct RCC_APB1RSTR_BIT APB1RSTR_BIT;};//0x010(RW),
  union{UINT32 AHBENR;struct RCC_AHBENR_BIT AHBENR_BIT;};      //0x014(RW),
  union{UINT32 APB2ENR;struct RCC_APB2ENR_BIT APB2ENR_BIT;};   //0x018(RW),
  union{UINT32 APB1ENR;struct RCC_APB1ENR_BIT APB1ENR_BIT;};   //0x01C(RW),
  union{UINT32 BDCR;struct RCC_BDCR_BIT BDCR_BIT;};            //0x020(RW),
  union{UINT32 CSR;struct RCC_CSR_BIT CSR_BIT;};               //0x024(RW),
#if IsDensity(CL)  
  union{UINT32 AHBRSTR;struct RCC_AHBRSTR_BIT AHBRSTR_BIT;};   //0x028(RW),
#else
	UINT32 Reserved0[1];  //0x028(R),
#endif
#if IsDensity(CL)||IsDensity(LD_VL)||IsDensity(MD_VL)||IsDensity(HD_VL)
  union{UINT32 CFGR2;struct RCC_CFGR2_BIT CFGR2_BIT;};         //0x02C(RW),
#endif
} RCC_Type,Type_RCC;
#define PT_RCC                  ((volatile Type_RCC *)BASE_RCC)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define RCC_CR                  RCC.CR
#define RCC_CFGR                RCC.CFGR
#define RCC_CIR                 RCC.CIR
#define RCC_APB2RSTR            RCC.APB2RSTR
#define RCC_APB1RSTR            RCC.APB1RSTR
#define RCC_AHBENR              RCC.AHBENR
#define RCC_APB2ENR             RCC.APB2ENR
#define RCC_APB1ENR             RCC.APB1ENR
#define RCC_BDCR                RCC.BDCR
#define RCC_CSR                 RCC.CSR
#if IsDensity(CL)
#define RCC_AHBRSTR             RCC.AHBRSTR
#endif
#if IsDensity(CL)||IsDensity(LD_VL)||IsDensity(MD_VL)||IsDensity(HD_VL)
#define RCC_CFGR2               RCC.CFGR2
#endif
//==============================================================================================================================
#define RSTV_RTC_CRH            0x00000000//0x000
struct RTC_CRH_BIT
{
	UINT32 SECIE:1;       //00,Second Interrupt Enable
	UINT32 ALRIE:1;       //01,Alarm Interrupt Enable
	UINT32 OWIE:1;        //02,OverfloW Interrupt Enable
	UINT32 Reserved0:13;  //03,
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RTC_CRL            0x00000020//0x004
struct RTC_CRL_BIT
{
	UINT32 SECF:1;        //00,Second Flag
	UINT32 ALRF:1;        //01,Alarm Flag
	UINT32 OWF:1;         //02,OverfloW Flag
	UINT32 RSF:1;         //03,Registers Synchronized Flag
	UINT32 CNF:1;         //04,Configuration Flag
	UINT32 RTOFF:1;       //05,RTC operation OFF
	UINT32 Reserved0:10;  //06,
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RTC_PRLH           0x00000000//0x008
struct RTC_PRLH_BIT
{
	UINT32 PRL:4;         //00,RTC Prescaler Reload Value High,<LDY>
	UINT32 Reserved0:12;  //04,
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RTC_PRLL           0x00008000//0x00C
struct RTC_PRLL_BIT
{
	UINT32 PRL:16;        //00,RTC Prescaler Reload Value Low
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RTC_DIVH           0x00000000//0x010
struct RTC_DIVH_BIT
{
	UINT32 DIV:4;         //00,RTC Clock Divider High,<LDY>
	UINT32 Reserved0:12;  //04,
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RTC_DIVL           0x00000000//0x014
struct RTC_DIVL_BIT
{
	UINT32 DIV:16;        //00,RTC Clock Divider Low
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RTC_CNTH           0x00000000//0x018
struct RTC_CNTH_BIT
{
	UINT32 CNT:16;        //00,RTC Counter High
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RTC_CNTL           0x00000000//0x01C
struct RTC_CNTL_BIT
{
	UINT32 CNT:16;        //00,RTC Counter Low
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RTC_ALRH           0x00000000//0x020
struct RTC_ALRH_BIT
{
	UINT32 ALR:16;        //00,RTC Alarm High
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_RTC_ALRL           0x00000000//0x024
struct RTC_ALRL_BIT
{
	UINT32 ALR:16;        //00,RTC Alarm Low
	UINT32 Reserved0:16;  //16,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define RTC_Struct Struct_RTC
typedef struct Struct_RTC//0x40002800
{
  union{UINT32 CRH;struct RTC_CRH_BIT CRH_BIT;};//0x000(RW),
  union{UINT32 CRL;struct RTC_CRH_BIT CRL_BIT;};//0x004(RW),
  union{UINT32 PRLH;struct RTC_PRLH_BIT PRLH_BIT;};//0x008(RW),
  union{UINT32 PRLL;struct RTC_PRLL_BIT PRLL_BIT;};//0x00C(RW),
  union{UINT32 DIVH;struct RTC_DIVH_BIT DIVH_BIT;};//0x010(RW),
  union{UINT32 DIVL;struct RTC_DIVL_BIT DIVL_BIT;};//0x014(RW),
  union{UINT32 CNTH;struct RTC_CNTH_BIT CNTH_BIT;};//0x018(RW),
  union{UINT32 CNTL;struct RTC_CNTL_BIT CNTL_BIT;};//0x01C(RW),
  union{UINT32 ALRH;struct RTC_ALRH_BIT ALRH_BIT;};//0x020(RW),
  union{UINT32 ALRL;struct RTC_ALRL_BIT ALRL_BIT;};//0x024(RW),
} RTC_Type,Type_RTC;
#define PT_RTC                  ((volatile Type_RTC *)BASE_RTC)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define RTC_CRH                 RTC.CRH
#define RTC_CRL                 RTC.CRL
#define RTC_PRLH                RTC.PRLH
#define RTC_PRLL                RTC.PRLL
#define RTC_DIVH                RTC.DIVH
#define RTC_DIVL                RTC.DIVL
#define RTC_CNTH                RTC.CNTH
#define RTC_CNTL                RTC.CNTL
#define RTC_ALRH                RTC.ALRH
#define RTC_ALRL                RTC.ALRL
//==============================================================================================================================
#define RSTV_SDIO_POWER         0x00000000//0x000
struct SDIO_POWER_BIT
{
	UINT32 PWRCTRL:2;     //00,PWRCTRL[1:0] bits (Power supply control bits)
	UINT32 Reserved0:30;  //02,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_CLKCR         0x00000000//0x004
struct SDIO_CLKCR_BIT
{
	UINT32 CLKDIV:8;      //00,Clock divide factor
	UINT32 CLKEN:1;       //08,Clock enable bit
	UINT32 PWRSAV:1;      //09,Power saving configuration bit
	UINT32 BYPASS:1;      //10,Clock divider bypass enable bit
	UINT32 WIDBUS:2;      //11,WIDBUS[1:0] bits (Wide bus mode enable bit)
	UINT32 NEGEDGE:1;     //13,SDIO_CK dephasing selection bit
	UINT32 HWFCEN:1;      //14,HW Flow Control enable
	UINT32 Reserved0:17;  //15,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_ARG           0x00000000//0x008,bit0_31=CMDARG=Command argument
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_CMD           0x00000000//0x00C
struct SDIO_CMD_BIT
{
	UINT32 CMDINDEX:6;    //00,Command Index
	UINT32 WAITRESP:2;    //06,WAITRESP[1:0] bits (Wait for response bits)
	UINT32 WAITINT:1;     //08,CPSM Waits for Interrupt Request
	UINT32 WAITPEND:1;    //09,CPSM Waits for ends of data transfer (CmdPend internal signal)
	UINT32 CPSMEN:1;      //10,Command path state machine (CPSM) Enable bit
	UINT32 SDIOSUSPEND:1; //11,SD I/O suspend command
	UINT32 ENCMDCOMPL:1;  //12,Enable CMD completion
	UINT32 NIEN:1;        //13,Not Interrupt Enable
	UINT32 CEATACMD:1;    //14,CE-ATA command
	UINT32 Reserved0:17;  //15,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_RESPCMD       0x00000000//0x010
struct SDIO_RESPCMD_BIT
{
	UINT32 RESPCMD:6;    //00,Response command index
	UINT32 Reserved0:26; //06,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_RESP1           0x00000000//0x014,bit0_31=CARDSTATUS=Card Status
#define RSTV_SDIO_RESP2           0x00000000//0x018,bit0_31=CARDSTATUS=Card Status
#define RSTV_SDIO_RESP3           0x00000000//0x01C,bit0_31=CARDSTATUS=Card Status
#define RSTV_SDIO_RESP4           0x00000000//0x020,bit0_31=CARDSTATUS=Card Status
#define RSTV_SDIO_RESP            0x00000000
#define RSTV_SDIO_DTIMER          0x00000000//0x024,bit0_31=DATATIME=Data timeout period
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_DLEN            0x00000000//0x028
struct SDIO_DLEN_BIT
{
	UINT32 DATALENGTH:25; //00,Data length value
	UINT32 Reserved0:7;   //25,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_DCTRL           0x00000000//0x02C
struct SDIO_DCTRL_BIT
{
	UINT32 DTEN:1;        //00,Data transfer enabled bit
	UINT32 DTDIR:1;       //01,Data transfer direction selection
	UINT32 DTMODE:1;      //02,Data transfer mode selection
	UINT32 DMAEN:1;       //03,DMA enabled bit
	UINT32 DBLOCKSIZE:4;  //04,DBLOCKSIZE[3:0] bits (Data block size)
	UINT32 RWSTART:1;     //08,Read wait start
	UINT32 RWSTOP:1;      //09,Read wait stop
	UINT32 RWMOD:1;       //10,Read wait mode
	UINT32 SDIOEN:1;      //11,SD I/O enable functions
	UINT32 Reserved0:20;  //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_DCOUNT          0x00000000//0x030
struct SDIO_DCOUNT_BIT
{
	UINT32 DATACOUNT:25;  //00,Data count value
	UINT32 Reserved0:7;   //25,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_STA             0x00000000//0x034
#define RSTV_SDIO_ICR             0x00000000//0x038
#define RSTV_SDIO_MASK            0x00000000//0x03C
struct SDIO_INT_BIT//0x034=STA,0x38=ICR(bit11_21=Reserved),0x3C=MASK
{
	UINT32 CCRCFAIL:1;    //00,Command response received (CRC check failed)
	UINT32 DCRCFAIL:1;    //01,Data block sent/received (CRC check failed)
	UINT32 CTIMEOUT:1;    //02,Command response timeout
	UINT32 DTIMEOUT:1;    //03,Data timeout
	UINT32 TXUNDERR:1;    //04,Transmit FIFO underrun error
	UINT32 RXOVERR:1;     //05,Received FIFO overrun error
	UINT32 CMDREND:1;     //06,Command response received (CRC check passed)
	UINT32 CMDSENT:1;     //07,Command sent (no response required)
	UINT32 DATAEND:1;     //08,Data end (data counter, SDIDCOUNT, is zero)
	UINT32 STBITERR:1;    //09,Start bit not detected on all data signals in wide bus mode
	UINT32 DBCKEND:1;     //10,Data block sent/received (CRC check passed)
	UINT32 CMDACT:1;      //11,Command transfer in progress
	UINT32 TXACT:1;       //12,Data transmit in progress
	UINT32 RXACT:1;       //13,Data receive in progress
	UINT32 TXFIFOHE:1;    //14,Transmit FIFO Half Empty: at least 8 words can be written into the FIFO
	UINT32 RXFIFOHF:1;    //15,Receive FIFO Half Full: there are at least 8 words in the FIFO
	UINT32 TXFIFOF:1;     //16,Transmit FIFO full
	UINT32 RXFIFOF:1;     //17,Receive FIFO full
	UINT32 TXFIFOE:1;     //18,Transmit FIFO empty
	UINT32 RXFIFOE:1;     //19,Receive FIFO empty
	UINT32 TXDAVL:1;      //20,Data available in transmit FIFO
	UINT32 RXDAVL:1;      //21,Data available in receive FIFO
	UINT32 SDIOIT:1;      //22,SDIO interrupt received
	UINT32 CEATAEND:1;    //23,CE-ATA command completion signal received for CMD61
	UINT32 Reserved0:8;   //24,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_FIFOCNT         0x00000000//0x048
struct SDIO_FIFOCNT_BIT
{
	UINT32 FIFOCOUNT:24;  //00,Remaining number of words to be written to or read from the FIFO
	UINT32 Reserved0:8;   //24,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SDIO_FIFO            0x00000000//0x080,bit0_31=FIFODATA=Receive and transmit FIFO data
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define SDIO_Struct Struct_SDIO
typedef struct Struct_SDIO//0x40018000
{
  union{UINT32 POWER;struct SDIO_POWER_BIT POWER_BIT;};//0x000(RW),
  union{UINT32 CLKCR;struct SDIO_CLKCR_BIT CLKCR_BIT;};//0x004(RW),
  union{UINT32 ARG;Type_BIT32 ARG_BIT;};//0x008(RW),
  union{UINT32 CMD;struct SDIO_CMD_BIT CMD_BIT;};//0x00C(RW),
  union{UINT32 RESPCMD;struct SDIO_RESPCMD_BIT RESPCMD_BIT;};//0x010(R),
  union{UINT32 RESP1;Type_BIT32 RESP1_BIT;};//0x014(R),
  union{UINT32 RESP2;Type_BIT32 RESP2_BIT;};//0x018(R),
  union{UINT32 RESP3;Type_BIT32 RESP3_BIT;};//0x01C(R),
  union{UINT32 RESP4;Type_BIT32 RESP4_BIT;};//0x020(R),
  union{UINT32 DTIMER;Type_BIT32 DTIMER_BIT;};//0x024(RW),
  union{UINT32 DLEN;struct SDIO_DLEN_BIT DLEN_BIT;};//0x028(RW),
  union{UINT32 DCTRL;struct SDIO_DCTRL_BIT DCTRL_BIT;};//0x02C(RW),
  union{UINT32 DCOUNT;struct SDIO_DCOUNT_BIT DCOUNT_BIT;};//0x030(R),
  union{UINT32 STA;struct SDIO_INT_BIT STA_BIT;};//0x034(R),
  union{UINT32 ICR;struct SDIO_INT_BIT ICR_BIT;};//0x038(RW),
  union{UINT32 MASK;struct SDIO_INT_BIT MASK_BIT;};//0x03C(RW),
  UINT32 Reserved0[2];  //0x040(R),
  union{UINT32 FIFOCNT;struct SDIO_FIFOCNT_BIT FIFOCNT_BIT;};//0x048(R),
  UINT32 Reserved1[13]; //0x04C(R),
  union{UINT32 FIFO;Type_BIT32 FIFO_BIT;};//0x080(RW),
} SDIO_Type,Type_SDIO;
#define PT_SDIO                 ((volatile Type_SDIO *)BASE_SDIO)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define SDIO_POWER              SDIO.POWER
#define SDIO_CLKCR              SDIO.CLKCR
#define SDIO_ARG                SDIO.ARG
#define SDIO_CMD                SDIO.CMD
#define SDIO_RESPCMD            SDIO.RESPCMD
#define SDIO_RESP1              SDIO.RESP1
#define SDIO_RESP2              SDIO.RESP2
#define SDIO_RESP3              SDIO.RESP3
#define SDIO_RESP4              SDIO.RESP4
#define SDIO_DTIMER             SDIO.DTIMER
#define SDIO_DLEN               SDIO.DLEN
#define SDIO_DCTRL              SDIO.DCTRL
#define SDIO_DCOUNT             SDIO.DCOUNT
#define SDIO_STA                SDIO.STA
#define SDIO_ICR                SDIO.ICR
#define SDIO_MASK               SDIO.MASK
#define SDIO_FIFOCNT            SDIO.FIFOCNT
#define SDIO_FIFO               SDIO.FIFO
//==============================================================================================================================
#define RSTV_SPI_CR1            0x00000000//0x000
struct SPI_CR1_BIT
{
	UINT32 CPHA:1;        //00,Clock Phase:0=first,1=second
	UINT32 CPOL:1;        //01,Clock Polarity,while idle CK level:0=CK_Low,1=CK_High
	UINT32 MSTR:1;        //02,Master Selection:0=Slave,1=Master
	UINT32 BR:3;          //03,BR[2:0] bits (Baud Rate Control)  FCLK div:0_7=/2^(BR+1)
	UINT32 SPE:1;         //06,SPI Enable:1=Enable
	UINT32 LSBFIRST:1;    //07,Frame Format,transfer first at:0=MSB ,1=LSB
	UINT32 SSI:1;         //08,Internal slave select,while SSM=1,PIN_NSS=SSI
	UINT32 SSM:1;         //09,Software slave management:1=Enable
	UINT32 RXONLY:1;      //10,Receive only:0=Full,1=RXonly
	UINT32 DFF:1;         //11,Data Frame Format:0=8bit,1=16bit
	UINT32 CRCNEXT:1;     //12,Transmit CRC next:1=next is CRC,0=next is data
	UINT32 CRCEN:1;       //13,Hardware CRC calculation enable:1=enable
	UINT32 BIDIOE:1;      //14,Output enable in bidirectional mode:0=Rx,1=TX
	UINT32 BIDIMODE:1;    //15,Bidirectional data mode enable:0=2-line unbidirectional,1=1-line bidirectional
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SPI_CR2            0x00000000//0x004
struct SPI_CR2_BIT
{
	UINT32 RXDMAEN:1;     //00,Rx Buffer DMA Enable:1=Enable
	UINT32 TXDMAEN:1;     //01,Tx Buffer DMA Enable:1=Enable
	UINT32 SSOE:1;        //02,SS Output Enable:1=Enable
	UINT32 Reserved0:2;   //03,
	UINT32 ERRIE:1;       //05,Error Interrupt Enable:1=Enable
	UINT32 RXNEIE:1;      //06,RX buffer Not Empty Interrupt Enable:1=Enable
	UINT32 TXEIE:1;       //07,Tx buffer Empty Interrupt Enable:1=Enable
	UINT32 Reserved1:24;  //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SPI_SR             0x00000002//0x008
struct SPI_SR_BIT
{
	UINT32 RXNE:1;        //00,Receive buffer Not Empty
	UINT32 TXE:1;         //01,Transmit buffer Empty
	UINT32 CHSIDE:1;      //02,Channel side:0=left,1=right
	UINT32 UDR:1;         //03,Underrun flag
	UINT32 CRCERR:1;      //04,CRC Error flag
	UINT32 MODF:1;        //05,Mode fault
	UINT32 OVR:1;         //06,Overrun flag
	UINT32 BSY:1;         //07,Busy flag
	UINT32 Reserved1:24;  //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SPI_DR             0x00000000//0x00C,Data Register
#define RSTV_SPI_CRCPR          0x00000007//0x010,CRC polynomial register
#define RSTV_SPI_RXCRCR         0x00000000//0x014,Rx CRC Register
#define RSTV_SPI_TXCRCR         0x00000000//0x018,Tx CRC Register
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SPI_I2SCFGR        0x00000000//0x01C
struct SPI_I2SCFGR_BIT
{
	UINT32 CHLEN:1;       //00,Channel length (number of bits per audio channel)
	UINT32 DATLEN:2;      //01,DATLEN[1:0] bits (Data length to be transferred)
	UINT32 CKPOL:1;       //03,steady state clock polarity
	UINT32 I2SSTD:2;      //04,I2SSTD[1:0] bits (I2S standard selection)
	UINT32 Reserved0:1;   //06,
	UINT32 PCMSYNC:1;     //07,PCM frame synchronization
	UINT32 I2SCFG:2;      //08,I2SCFG[1:0] bits (I2S configuration mode)
	UINT32 I2SE:1;        //10,I2S Enable
	UINT32 I2SMOD:1;      //11,I2S mode selection
	UINT32 Reserved1:20;  //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SPI_I2SPR          0x00000000//0x020,<LDY>
struct SPI_I2SPR_BIT
{
	UINT32 I2SDIV:8;      //00,I2S Linear prescaler
	UINT32 ODD:1;         //08,Odd factor for the prescaler
	UINT32 MCKOE:1;       //09,Master Clock Output Enable
	UINT32 Reserved0:22;  //10,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define SPI_Struct Struct_SPI
typedef struct Struct_SPI//0x40013000=SPI1,0x40003800=SPI2,0x40003C00=SPI3
{
  union{UINT32 CR1;struct SPI_CR1_BIT CR1_BIT;};                //0x000(RW),SPI control register 1 (not used in I2S mode)
  union{UINT32 CR2;struct SPI_CR2_BIT CR2_BIT;};                //0x004(RW),SPI control register 2
  union{UINT32 SR;struct SPI_SR_BIT SR_BIT;};                   //0x008(RW),SPI status register
  union{UINT32 DR;Type_UINT32_BIT16 DR_BIT;};                   //0x00C(RW),SPI data register
  union{UINT32 CRCPR;Type_UINT32_BIT16 CRCPR_BIT;};             //0x010(RW),SPI CRC polynomial register (not used in I2S mode)
  union{UINT32 RXCRCR;Type_UINT32_BIT16 RXCRCR_BIT;};           //0x014(RW),SPI RX CRC register (not used in I2S mode)
  union{UINT32 TXCRCR;Type_UINT32_BIT16 TXCRCR_BIT;};           //0x018(RW),SPI TX CRC register (not used in I2S mode)
  union{UINT32 I2SCFGR;struct SPI_I2SCFGR_BIT I2SCFGR_BIT;};    //0x01C(RW),SPI_I2S configuration register
  union{UINT32 I2SPR;struct SPI_I2SPR_BIT I2SPR_BIT;};          //0x020(RW),SPI_I2S prescaler register
} SPI_Type,Type_SPI;
