diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PT_SPI1                 ((volatile Type_SPI *)BASE_SPI1)
#define PT_SPI2                 ((volatile Type_SPI *)BASE_SPI2)
#define PT_SPI3                 ((volatile Type_SPI *)BASE_SPI3)
#define PT_SPI(i)               ((volatile Type_SPI *)BASE_SPI[i])
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define SPI_CR1(i)              (*SPI[i]).CR1//i=0_2
#define SPI_CR2(i)              (*SPI[i]).CR2
#define SPI_SR(i)               (*SPI[i]).SR
#define SPI_DR(i)               (*SPI[i]).DR
#define SPI_CRCPR(i)            (*SPI[i]).CRCPR
#define SPI_RXCRCR(i)           (*SPI[i]).RXCRCR
#define SPI_TXCRCR(i)           (*SPI[i]).TXCRCR
#define SPI_I2SCFGR(i)          (*SPI[i]).I2SCFGR
#define SPI_I2SPR(i)            (*SPI[i]).I2SPR
//==============================================================================================================================
#define RSTV_TIM_CR1            0x00000000//0x000
struct TIM_CR1_BIT
{
	UINT32 CEN:1;         //00,Counter enable.0= Counter disabled,1= Counter enabled
	UINT32 UDIS:1;        //01,Update disable.0= UEV enabled. The Update (UEV) event is generated by one of the following events:\
                           – Counter overflow/underflow;– Setting the UG bit;– Update generation through the slave mode controller\
                           Buffered registers are then loaded with their preload values.\
                           1= UEV disabled. The Update event is not generated, shadow registers keep their value\
                             (ARR, PSC, CCRx). However the counter and the prescaler are reinitialized if the UG bit is\
                             set or if a hardware reset is received from the slave mode controller.
	UINT32 URS:1;         //02,Update request source.0= Any of the following events generate an update interrupt or DMA request if enabled.\
                             These events can be: – Counter overflow/underflow; – Setting the UG bit; – Update generation through the slave mode controller\
                             1= Only counter overflow/underflow generates an update interrupt or DMA request if enabled.
	UINT32 OPM:1;         //03,One pulse mode.0= Counter is not stopped at update event,1= Counter stops counting at the next update event (clearing the bit CEN)
	UINT32 DIR:1;         //04,Direction.0= Counter used as upcounter,1= Counter used as downcounter
	UINT32 CMS:2;         //05,CMS[1:0] bits (Center-aligned mode selection).\
                           0= Edge-aligned mode. The counter counts up or down depending on the direction bit(DIR).\
                           1= Center-aligned mode 1. The counter counts up and down alternatively. Output compare interrupt flags of channels configured\
                              in output (CCxS=00 in TIMx_CCMRx register) are set only when the counter is counting down.\
                           2= Center-aligned mode 2. The counter counts up and down alternatively. Output compare interrupt flags of channels configured\
                             in output (CCxS=00 in TIMx_CCMRx register) are set only when the counter is counting up.\
                           3= Center-aligned mode 3. The counter counts up and down alternatively. Output compare interrupt flags of channels configured\
                             in output (CCxS=00 in TIMx_CCMRx register) are set both when the counter is counting up or down.
	UINT32 ARPE:1;        //07,Auto-reload preload enable.0= TIMx_ARR register is not buffered,1= TIMx_ARR register is buffered
	UINT32 CKD:2;         //08,CKD[1:0] bits (clock division).0= tDTS=tCK_INT, 1= tDTS=2*tCK_INT,2= tDTS=4*tCK_INT,3= Reserved, do not program this value
	UINT32 Reserved0:22;  //10,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_CR2            0x00000000//0x004
struct TIM_CR2_BIT
{
	UINT32 CCPC:1;        //00,Capture/Compare Preloaded Control
	UINT32 Reserved0:1;   //01,
	UINT32 CCUS:1;        //02,Capture/Compare Control Update Selection
	UINT32 CCDS:1;        //03,Capture/Compare DMA Selection
	UINT32 MMS:3;         //04,MMS[2:0] bits (Master Mode Selection)
	UINT32 TI1S:1;        //07,TI1 Selection
	UINT32 OIS1:1;        //08,Output Idle state 1 (OC1 output)
	UINT32 OIS1N:1;       //09,Output Idle state 1 (OC1N output)
	UINT32 OIS2:1;        //10,Output Idle state 2 (OC1 output)
	UINT32 OIS2N:1;       //11,Output Idle state 2 (OC1N output)
	UINT32 OIS3:1;        //12,Output Idle state 3 (OC1 output)
	UINT32 OIS3N:1;       //13,Output Idle state 3 (OC1N output)
	UINT32 OIS4:1;        //14,Output Idle state 4 (OC1 output)
	UINT32 Reserved1:17;  //15,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_SMCR           0x00000000//0x008
struct TIM_SMCR_BIT
{
	UINT32 SMS:3;         //00,SMS[2:0] bits (Slave mode selection)
	UINT32 Reserved0:1;   //03,
	UINT32 TS:3;          //04,TS[2:0] bits (Trigger selection)
	UINT32 MSM:1;         //07,Master/slave mode
	UINT32 ETF:4;         //08,ETF[3:0] bits (External trigger filter)
	UINT32 ETPS:2;        //12,ETPS[1:0] bits (External trigger prescaler)
	UINT32 ECE:1;         //14,External clock enable
	UINT32 ETP:1;         //15,External trigger polarity
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_DIER           0x00000000//0x00C
struct TIM_DIER_BIT
{
	UINT32 UIE:1;         //00,Update interrupt enable
	UINT32 CC1IE:1;       //01,Capture/Compare 1 interrupt enable
	UINT32 CC2IE:1;       //02,Capture/Compare 2 interrupt enable
	UINT32 CC3IE:1;       //03,Capture/Compare 3 interrupt enable
	UINT32 CC4IE:1;       //04,Capture/Compare 4 interrupt enable
	UINT32 COMIE:1;       //05,COM interrupt enable
	UINT32 TIE:1;         //06,Trigger interrupt enable
	UINT32 BIE:1;         //07,Break interrupt enable
	UINT32 UDE:1;         //08,Update DMA request enable
	UINT32 CC1DE:1;       //09,Capture/Compare 1 DMA request enable
	UINT32 CC2DE:1;       //10,Capture/Compare 2 DMA request enable
	UINT32 CC3DE:1;       //11,Capture/Compare 3 DMA request enable
	UINT32 CC4DE:1;       //12,Capture/Compare 4 DMA request enable
	UINT32 COMDE:1;       //13,COM DMA request enable
	UINT32 TDE:1;         //14,Trigger DMA request enable
	UINT32 Reserved0:17;  //15,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_SR             0x00000000//0x010
struct TIM_SR_BIT
{
	UINT32 UIF:1;         //00,Update interrupt Flag
	UINT32 CC1IF:1;       //01,Capture/Compare 1 interrupt Flag
	UINT32 CC2IF:1;       //02,Capture/Compare 2 interrupt Flag
	UINT32 CC3IF:1;       //03,Capture/Compare 3 interrupt Flag
	UINT32 CC4IF:1;       //04,Capture/Compare 4 interrupt Flag
	UINT32 COMIF:1;       //05,COM interrupt Flag
	UINT32 TIF:1;         //06,Trigger interrupt Flag
	UINT32 BIF:1;         //07,Break interrupt Flag
	UINT32 Reserved0:1;   //08,
	UINT32 CC1OF:1;       //09,Capture/Compare 1 Overcapture Flag
	UINT32 CC2OF:1;       //10,Capture/Compare 2 Overcapture Flag
	UINT32 CC3OF:1;       //11,Capture/Compare 3 Overcapture Flag
	UINT32 CC4OF:1;       //12,Capture/Compare 4 Overcapture Flag
	UINT32 Reserved1:19;  //13,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_EGR            0x00000000//0x014
struct TIM_EGR_BIT
{
	UINT32 UG:1;          //00,Update Generation
	UINT32 CC1G:1;        //01,Capture/Compare 1 Generation
	UINT32 CC2G:1;        //02,Capture/Compare 2 Generation
	UINT32 CC3G:1;        //03,Capture/Compare 3 Generation
	UINT32 CC4G:1;        //04,Capture/Compare 4 Generation
	UINT32 COMG:1;        //05,Capture/Compare Control Update Generation
	UINT32 TG:1;          //06,Trigger Generationag
	UINT32 BG:1;          //07,Break Generation
	UINT32 Reserved0:24;  //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_CCMR1          0x00000000//0x018
#define RSTV_TIM_CCMR2          0x00000000//0x01C
struct TIM_CCMR_BITO//0x018=CCMR1,0x01C=CCMR2
{
	UINT32 CC1S:2;        //00,CC1S[1:0] bits (Capture/Compare 1 Selection)
	UINT32 OC1FE:1;       //02,Output Compare 1 Fast enable
	UINT32 OC1PE:1;       //03,Output Compare 1 Preload enable
	UINT32 OC1M:3;        //04,OC1M[2:0] bits (Output Compare 1 Mode)
	UINT32 OC1CE:1;       //07,Output Compare 1Clear Enable
	UINT32 CC2S:2;        //08,CC2S[1:0] bits (Capture/Compare 2 Selection)
	UINT32 OC2FE:1;       //10,Output Compare 2 Fast enable
	UINT32 OC2PE:1;       //11,Output Compare 2 Preload enable
	UINT32 OC2M:3;        //12,OC2M[2:0] bits (Output Compare 2 Mode)
	UINT32 OC2CE:1;       //15,Output Compare 2 Clear Enable
	UINT32 Reserved0:16;  //16,
};
