diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
struct TIM_CCMR_BITI//0x018=CCMR1,0x01C=CCMR2
{
	UINT32 CC1S:2;        //00,CC1S[1:0] bits (Capture/Compare 1 Selection)
	UINT32 IC1PSC:2;      //02,IC1PSC[1:0] bits (Input Capture 1 Prescaler)
	UINT32 IC1F:4;        //04,IC1F[3:0] bits (Input Capture 1 Filter)
	UINT32 CC2S:2;        //08,CC2S[1:0] bits (Capture/Compare 2 Selection)
	UINT32 IC2PSC:2;      //10,IC2PSC[1:0] bits (Input Capture 2 Prescaler)
	UINT32 IC2F:4;        //12,IC2F[3:0] bits (Input Capture 2 Filter)
	UINT32 Reserved0:16;  //16,
};
#define TIM_CCMR_OCXM_FROZEN    0
#define TIM_CCMR_OCXM_SETH      1
#define TIM_CCMR_OCXM_SETL      2
#define TIM_CCMR_OCXM_TOGLE     3
#define TIM_CCMR_OCXM_FORCEL    4
#define TIM_CCMR_OCXM_FORCEH    5
#define TIM_CCMR_OCXM_PWM1      6
#define TIM_CCMR_OCXM_PWM2      7
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_CCER           0x00000000//0x020
struct TIM_CCER_BIT
{
	UINT32 CC1E:1;        //00,Capture/Compare 1 output enable
	UINT32 CC1P:1;        //01,Capture/Compare 1 output Polarity
	UINT32 CC1NE:1;       //02,Capture/Compare 1 Complementary output enable
	UINT32 CC1NP:1;       //03,Capture/Compare 1 Complementary output Polarity
	UINT32 CC2E:1;        //04,Capture/Compare 2 output enable
	UINT32 CC2P:1;        //05,Capture/Compare 2 output Polarity
	UINT32 CC2NE:1;       //06,Capture/Compare 2 Complementary output enable
	UINT32 CC2NP:1;       //07,Capture/Compare 2 Complementary output Polarity
	UINT32 CC3E:1;        //08,Capture/Compare 3 output enable
	UINT32 CC3P:1;        //09,Capture/Compare 3 output Polarity
	UINT32 CC3NE:1;       //10,Capture/Compare 3 Complementary output enable
	UINT32 CC3NP:1;       //11,Capture/Compare 3 Complementary output Polarity
	UINT32 CC4E:1;        //12,Capture/Compare 4 output enable
	UINT32 CC4P:1;        //13,Capture/Compare 4 output Polarity
	UINT32 CC4NE:1;       //14,Capture/Compare 4 Complementary output enable,<LDY>
	UINT32 CC4NP:1;       //15,Capture/Compare 4 Complementary output Polarity,<LDY>
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_CNT            0x00000000//0x024
struct TIM_CNT_BIT
{
	UINT32 CNT:16;        //00,Counter Value
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_PSC            0x00000000//0x028
struct TIM_PSC_BIT
{
	UINT32 PSC:16;        //00,Prescaler Value:CLK_TIMx/(PSC+1)
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_ARR            0x00000000//0x02C
struct TIM_ARR_BIT
{
	UINT32 ARR:16;        //00,actual auto-reload Value
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_RCR              0x00000000//0x030
struct TIM_RCR_BIT
{
	UINT32 REP:8;         //00,Repetition Counter Value
	UINT32 Reserved0:24;  //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_CCR1             0x00000000//0x034
#define RSTV_TIM_CCR2             0x00000000//0x038
#define RSTV_TIM_CCR3             0x00000000//0x03C
#define RSTV_TIM_CCR4             0x00000000//0x040
#define RSTV_TIM_CCR              0x00000000
struct TIM_CCR_BIT//0x034=CCR1,0x38=CCR2,0x3C=CCR3,0x40=CCR4
{
	UINT32 CCR:16;        //00,Capture/Compare 1_4 Value
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_BDTR             0x00000000//0x044
struct TIM_BDTR_BIT
{
	UINT32 DTG:8;         //00,DTG[0:7] bits (Dead-Time Generator set-up)
	UINT32 LOCK:2;        //08,LOCK[1:0] bits (Lock Configuration)
	UINT32 OSSI:1;        //10,Off-State Selection for Idle mode
	UINT32 OSSR:1;        //11,Off-State Selection for Run mode
	UINT32 BKE:1;         //12,Break enable
	UINT32 BKP:1;         //13,Break Polarity
	UINT32 AOE:1;         //14,Automatic Output enable
	UINT32 MOE:1;         //15,Main Output enable
	UINT32 Reserved0:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_DCR              0x00000000//0x048
struct TIM_DCR_BIT
{
	UINT32 DBA:5;         //00,DBA[4:0] bits (DMA Base Address)
	UINT32 Reserved0:3;   //05,
	UINT32 DBL:5;         //08,DBL[4:0] bits (DMA Burst Length)
	UINT32 Reserved1:19;  //13,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_TIM_DMAR           0x00000000//0x04C,bit0_15=DMA register for burst accesses
struct TIM_DMAR_BIT
{
	UINT32 DMAB:16;       //00,
	UINT32 Reserved0:16;  //16,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define TIM_Struct Struct_TIM
typedef struct Struct_TIM//0x40012C00=TIM1,0x40000000(Step=0x400)=TIM2_7,...
{
  union{UINT32 CR1;struct TIM_CR1_BIT CR1_BIT;};        //0x000(RW),
  union{UINT32 CR2;struct TIM_CR2_BIT CR2_BIT;};        //0x004(RW),
  union{UINT32 SMCR;struct TIM_SMCR_BIT SMCR_BIT;};     //0x008(RW),
  union{UINT32 DIER;struct TIM_DIER_BIT DIER_BIT;};     //0x00C(RW),
  union{UINT32 SR;struct TIM_SR_BIT SR_BIT;};           //0x010(RW),
  union{UINT32 EGR;struct TIM_EGR_BIT EGR_BIT;};        //0x014(RW),
  union{UINT32 CCMR[2];struct TIM_CCMR_BITO CCMR_BITO[2];struct TIM_CCMR_BITI CCMR_BITI[2];}; //0x018(RW),
  union{UINT32 CCER;struct TIM_CCER_BIT CCER_BIT;};     //0x020(RW),
  union{UINT32 CNT;struct TIM_CNT_BIT CNT_BIT;};        //0x024(RW),
  union{UINT32 PSC;struct TIM_PSC_BIT PSC_BIT;};        //0x028(RW),
  union{UINT32 ARR;struct TIM_ARR_BIT ARR_BIT;};        //0x02C(RW),
  union{UINT32 RCR;struct TIM_RCR_BIT RCR_BIT;};        //0x030(RW),
  union{UINT32 CCR[4];struct TIM_CCR_BIT CCR_BIT[4];};  //0x034(RW),
  union{UINT32 BDTR;struct TIM_BDTR_BIT BDTR_BIT;};     //0x044(RW),
  union{UINT32 DCR;struct TIM_DCR_BIT DCR_BIT;};        //0x048(RW),
  union{UINT32 DMAR;struct TIM_DMAR_BIT DMAR_BIT;};     //0x04C(RW),
} TIM_Type,Type_TIM;
