diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PT_TIM1                 ((volatile Type_TIM *)BASE_TIM1)
#define PT_TIM2                 ((volatile Type_TIM *)BASE_TIM2)
#define PT_TIM3                 ((volatile Type_TIM *)BASE_TIM3)
#define PT_TIM4                 ((volatile Type_TIM *)BASE_TIM4)
#define PT_TIM5                 ((volatile Type_TIM *)BASE_TIM5)
#define PT_TIM6                 ((volatile Type_TIM *)BASE_TIM6)
#define PT_TIM7                 ((volatile Type_TIM *)BASE_TIM7)
#define PT_TIM8                 ((volatile Type_TIM *)BASE_TIM8)
#define PT_TIM9                 ((volatile Type_TIM *)BASE_TIM9)
#define PT_TIM10                ((volatile Type_TIM *)BASE_TIM10)
#define PT_TIM11                ((volatile Type_TIM *)BASE_TIM11)
#define PT_TIM12                ((volatile Type_TIM *)BASE_TIM12)
#define PT_TIM13                ((volatile Type_TIM *)BASE_TIM13)
#define PT_TIM14                ((volatile Type_TIM *)BASE_TIM14)
#define PT_TIM15                ((volatile Type_TIM *)BASE_TIM15)
#define PT_TIM16                ((volatile Type_TIM *)BASE_TIM16)
#define PT_TIM17                ((volatile Type_TIM *)BASE_TIM17)
#define PT_TIM(i)               ((volatile Type_TIM *)BASE_TIM[i])
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define TIM_CR1(i)              (*TIM[i]).CR1//i=0_16
#define TIM_CR2(i)              (*TIM[i]).CR2//i=0_16
#define TIM_SMCR(i)             (*TIM[i]).SMCR//i=0_16
#define TIM_DIER(i)             (*TIM[i]).DIER//i=0_16
#define TIM_SR(i)               (*TIM[i]).SR//i=0_16
#define TIM_EGR(i)              (*TIM[i]).EGR//i=0_16
#define TIM_CCMR(i,j)           (*TIM[i]).CCMR[j]//i=0_16,j=0_1
#define TIM_CCER(i)             (*TIM[i]).CCER//i=0_16
#define TIM_CNT(i)              (*TIM[i]).CNT//i=0_16
#define TIM_PSC(i)              (*TIM[i]).PSC//i=0_16
#define TIM_ARR(i)              (*TIM[i]).ARR//i=0_16
#define TIM_RCR(i)              (*TIM[i]).RCR//i=0_16
#define TIM_CCR(i,j)            (*TIM[i]).CCR[j]//i=0_16,j=0_3
#define TIM_BDTR(i)             (*TIM[i]).BDTR//i=0_16
#define TIM_DCR(i)              (*TIM[i]).DCR//i=0_16
#define TIM_DMAR(i)             (*TIM[i]).DMAR//i=0_16
//==============================================================================================================================
#define RSTV_USART_SR           0x00000000//0x000
struct USART_SR_BIT
{
	UINT32 PE:1;          //00,Parity Error Flag
	UINT32 FE:1;          //01,Framing Error Flag
	UINT32 NE:1;          //02,Noise Error Flag
	UINT32 ORE:1;         //03,OverRun Error Flag
	UINT32 IDLE:1;        //04,IDLE line detected Flag
	UINT32 RXNE:1;        //05,Read Data Register Not Empty Flag
	UINT32 TC:1;          //06,Transmission Complete Flag
	UINT32 TXE:1;         //07,Transmit Data Register Empty Flag
	UINT32 LBD:1;         //08,LIN Break Detection Flag
	UINT32 CTS:1;         //09,CTS Flag
	UINT32 Reserved0:22;  //10,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USART_DR           0x00000000//0x004
struct USART_DR_BIT
{
	UINT32 DR:9;          //00,Data value
	UINT32 Reserved0:23;  //09,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USART_BRR          0x00000000//0x008
struct USART_BRR_BIT
{
	UINT32 DIVF:4;        //00,Fraction of USARTDIV
	UINT32 DIVM:12;       //04,Mantissa of USARTDIV
	UINT32 Reserved0:16;  //16
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USART_CR1          0x00000000//0x00C
struct USART_CR1_BIT
{
	UINT32 SBK:1;         //00,Send Break
	UINT32 RWU:1;         //01,Receiver wakeup
	UINT32 RE:1;          //02,Receiver Enable
	UINT32 TE:1;          //03,Transmitter Enable
	UINT32 IDLEIE:1;      //04,IDLE Interrupt Enable
	UINT32 RXNEIE:1;      //05,RXNE Interrupt Enable
	UINT32 TCIE:1;        //06,Transmission Complete Interrupt Enable
	UINT32 TXEIE:1;       //07,TXE Interrupt Enable
	UINT32 PEIE:1;        //08,PE Interrupt Enable
	UINT32 PS:1;          //09,Parity Selection
	UINT32 PCE:1;         //10,Parity Control Enable
	UINT32 WAKE:1;        //11,Wakeup method
	UINT32 M:1;           //12,Word length
	UINT32 UE:1;          //13,USART Enable
	UINT32 Reserved0:1;   //14,
	UINT32 OVER8:1;       //15,USART Oversmapling 8-bits
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USART_CR2          0x00000000//0x010
struct USART_CR2_BIT  
{
	UINT32 ADD:4;         //00,Address of the USART node
	UINT32 Reserved0:1;   //04,
	UINT32 LBDL:1;        //05,LIN Break Detection Length
	UINT32 LBDIE:1;       //06,LIN Break Detection Interrupt Enable
	UINT32 Reserved1:1;   //07,
	UINT32 LBCL:1;        //08,Last Bit Clock pulse
	UINT32 CPHA:1;        //09,Clock Phase
	UINT32 CPOL:1;        //10,Clock Polarity
	UINT32 CLKEN:1;       //11,Clock Enable
	UINT32 STOP:2;        //12,STOP[1:0] bits (STOP bits):0=1,1=0.5,2=2,3=1.5
	UINT32 LINEN:1;       //14,LIN mode enable
	UINT32 Reserved2:17;  //15,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USART_CR3          0x00000000//0x014
struct USART_CR3_BIT
{
	UINT32 EIE:1;         //00,Error Interrupt Enable
	UINT32 IREN:1;        //01,IrDA mode Enable
	UINT32 IRLP:1;        //02,IrDA Low-Power
	UINT32 HDSEL:1;       //03,Half-Duplex Selection
	UINT32 NACK:1;        //04,Smartcard NACK enable
	UINT32 SCEN:1;        //05,Smartcard mode enable
	UINT32 DMAR:1;        //06,DMA Enable Receiver
	UINT32 DMAT:1;        //07,DMA Enable Transmitter
	UINT32 RTSE:1;        //08,RTS Enable
	UINT32 CTSE:1;        //09,CTS Enable
	UINT32 CTSIE:1;       //10,CTS Interrupt Enable
	UINT32 ONEBIT:1;      //11,USART One bit method enable,<LDY>
	UINT32 Reserved0:20;  //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USART_GTPR         0x00000000//0x018
struct USART_GTPR_BIT
{
	UINT32 PSC:8;         //00,PSC[7:0] bits (Prescaler value)
	UINT32 GT:8;          //08,Guard time value
	UINT32 Reserved0:16;  //16,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define UART_Struct Struct_UART
typedef struct Struct_UART//UART1=0x40013800,UART2_5=0x40004400,Step=0x400
{
  union{UINT32 SR;struct USART_SR_BIT SR_BIT;};         //0x000(RW),USART Status register
  union{UINT32 DR;struct USART_DR_BIT DR_BIT;};         //0x004(RW),USART Data register
  union{UINT32 BRR;struct USART_BRR_BIT BRR_BIT;};      //0x008(RW),USART Baud rate register
  union{UINT32 CR1;struct USART_CR1_BIT CR1_BIT;};      //0x00C(RW),USART Control register 1
  union{UINT32 CR2;struct USART_CR2_BIT CR2_BIT;};      //0x010(RW),USART Control register 2
  union{UINT32 CR3;struct USART_CR3_BIT CR3_BIT;};      //0x014(RW),USART Control register 3
  union{UINT32 GTPR;struct USART_GTPR_BIT GTPR_BIT;};   //0x018(RW),USART Guard time and prescaler register
} UART_Type,Type_UART;
#define PT_UART1                ((volatile Type_UART *)BASE_UART1)
#define PT_UART2                ((volatile Type_UART *)BASE_UART2)
#define PT_UART3                ((volatile Type_UART *)BASE_UART3)
#define PT_UART4                ((volatile Type_UART *)BASE_UART4)
#define PT_UART5                ((volatile Type_UART *)BASE_UART5)
#define PT_UART(i)              ((volatile Type_UART *)BASE_UART[i])
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define UART_SR(i)              (*UART[i]).SR
#define UART_DR(i)              (*UART[i]).DR
#define UART_BRR(i)             (*UART[i]).BRR
#define UART_CR1(i)             (*UART[i]).CR1
#define UART_CR2(i)             (*UART[i]).CR2
#define UART_CR3(i)             (*UART[i]).CR3
#define UART_GTPR(i)            (*UART[i]).GTPR
//==============================================================================================================================
#define RSTV_USB_EP0R           0x00000000//0x000
#define RSTV_USB_EP1R           0x00000000//0x004
#define RSTV_USB_EP2R           0x00000000//0x008
#define RSTV_USB_EP3R           0x00000000//0x00C
#define RSTV_USB_EP4R           0x00000000//0x010
#define RSTV_USB_EP5R           0x00000000//0x014
#define RSTV_USB_EP6R           0x00000000//0x018
#define RSTV_USB_EP7R           0x00000000//0x01C
#define RSTV_USB_EPR            0x00000000

struct USB_EPR_BIT//0x000=EP0R,0x004=EP1R,...,0x01C=EP7R
{
	UINT32 EA:4;          //00,Endpoint Address
	UINT32 TXSTAT:2;      //04,STAT_TX[1:0] bits (Status bits, for transmission transfers):0=Disable,1=Stall,2=NAK,3=VALID//bit4_5=DTOG1,DTOG2
	UINT32 TXDTOG:1;      //06,Data Toggle, for transmission transfers
	UINT32 TXCTR:1;       //07,Correct Transfer for transmission
	UINT32 KIND:1;        //08,Endpoint Kind
	UINT32 TYPE:2;        //09,EP_TYPE[1:0] bits (Endpoint type):0=BULK,1=CONTROL,2=ISOCHRONOUS,3=INTERRUPT
	UINT32 SETUP:1;       //11,Setup transaction completed
	UINT32 RXSTAT:2;      //12,STAT_RX[1:0] bits (Status bits, for reception transfers):0=Disable,1=Stall,2=NAK,3=VALID//bit12_13=DTOG1,DTOG2
	UINT32 RXDTOG:1;      //14,Data Toggle, for reception transfers
	UINT32 RXCTR:1;       //15,Correct Transfer for reception
	UINT32 Reserved0:16;  //16,
};
#define USB_EPR_TYPE_BULK               0//EndPoint BULK
#define USB_EPR_TYPE_CONTROL            1//EndPoint CONTROL
#define USB_EPR_TYPE_ISOCHRONOUS        2//EndPoint ISOCHRONOUS
#define USB_EPR_TYPE_INTERRUPT          3//EndPoint INTERRUPT
#define USB_EPR_STAT_DIS                0//EndPoint RX/TX DISabled
#define USB_EPR_STAT_STALL              1//EndPoint RX/TX STALLed,DTOG1
#define USB_EPR_STAT_NAK                2//EndPoint RX/TX NAKed,DTOG2
#define USB_EPR_STAT_VALID              3//EndPoint RX/TX VALID
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USB_CNTR           0x00000003//0x040
struct USB_CNTR_BIT
{
	UINT32 FRES:1;        //00,Force USB Reset
	UINT32 PDWN:1;        //01,Power down
	UINT32 LPMODE:1;      //02,Low-power mode
	UINT32 FSUSP:1;       //03,Force suspend
	UINT32 RESUME:1;      //04,Resume request
	UINT32 Reserved0:3;   //05,
	UINT32 ESOFM:1;       //08,Expected Start Of Frame Interrupt Mask
	UINT32 SOFM:1;        //09,Start Of Frame Interrupt Mask
	UINT32 RSTM:1;        //10,=RESETM,RESET Interrupt Mask
	UINT32 SUSPM:1;       //11,Suspend mode Interrupt Mask,1=Enable
	UINT32 WKUPM:1;       //12,Wakeup Interrupt Mask,1=Enable
	UINT32 ERRM:1;        //13,Error Interrupt Mask,1=Enable
	UINT32 DOVRM:1;       //14,=DOVM,Packet Memory Area Over / Underrun Interrupt Mask,1=Enable
	UINT32 CTRM:1;        //15,Correct Transfer Interrupt Mask,1=Enable
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USB_ISTR           0x00000000//0x044
struct USB_ISTR_BIT
{
	UINT32 EPID:4;        //00,Endpoint Identifier
	UINT32 DIR:1;         //04,Direction of transaction
	UINT32 Reserved0:3;   //05,
	UINT32 ESOF:1;        //08,Expected Start Of Frame
	UINT32 SOF:1;         //09,Start Of Frame
	UINT32 RST:1;         //10,=RESET,USB RESET request
	UINT32 SUSP:1;        //11,Suspend mode request
	UINT32 WKUP:1;        //12,Wake up
	UINT32 ERR:1;         //13,Error
	UINT32 DOVR:1;        //14,PDMOVR=DOVR,Packet Memory Area Over / Underrun
	UINT32 CTR:1;         //15,Correct Transfer
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USB_FNR            0x00000000//0x048
struct USB_FNR_BIT
{
	UINT32 FN:11;         //00,Frame Number
	UINT32 LSOF:2;        //11,Lost SOF
	UINT32 LCK:1;         //13,Locked
	UINT32 RXDM:1;        //14,Receive Data - Line Status
	UINT32 RXDP:1;        //15,Receive Data + Line Status
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USB_DADDR          0x00000000//0x04C
struct USB_DADDR_BIT
{
	UINT32 ADD:7;         //00,ADD[6:0] bits (Device Address),Enable EP0_6
	UINT32 EF:1;          //07,Enable Function
	UINT32 Reserved1:24;  //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USB_BUFTAB         0x00000000//0x050
struct USB_BUFTAB_BIT
{
	UINT32 Reserved0:3;   //00,
	UINT32 TADDR:13;      //03,Buffer Table
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USB_TXADDR0        0x00000000//
#define RSTV_USB_TXADDR1        0x00000000//
#define RSTV_USB_TXADDR2        0x00000000//
#define RSTV_USB_TXADDR3        0x00000000//
#define RSTV_USB_TXADDR4        0x00000000//
#define RSTV_USB_TXADDR5        0x00000000//
#define RSTV_USB_TXADDR6        0x00000000//
#define RSTV_USB_TXADDR7        0x00000000//
#define RSTV_USB_TXADDR         0x00000000//

#define RSTV_USB_RXADDR0        0x00000000//Reception Buffer Address 0
#define RSTV_USB_RXADDR1        0x00000000//Reception Buffer Address 1
#define RSTV_USB_RXADDR2        0x00000000//Reception Buffer Address 2
#define RSTV_USB_RXADDR3        0x00000000//Reception Buffer Address 3
#define RSTV_USB_RXADDR4        0x00000000//Reception Buffer Address 4
#define RSTV_USB_RXADDR5        0x00000000//Reception Buffer Address 5
#define RSTV_USB_RXADDR6        0x00000000//Reception Buffer Address 6
#define RSTV_USB_RXADDR7        0x00000000//Reception Buffer Address 7
#define RSTV_USB_RXADDR         0x00000000//
struct USB_ADDR_BIT//TXADDR0_TXADDR7,RXADDR0_RXADDR7
{
	UINT32 Reserved0:1;   //00,
	UINT32 ADDR:15;       //01,Transmission Buffer Address 0
	UINT32 Reserved1:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USB_TXCOUNT0       0x00000000//
#define RSTV_USB_TXCOUNT1       0x00000000//
#define RSTV_USB_TXCOUNT2       0x00000000//
#define RSTV_USB_TXCOUNT3       0x00000000//
#define RSTV_USB_TXCOUNT4       0x00000000//
#define RSTV_USB_TXCOUNT5       0x00000000//
#define RSTV_USB_TXCOUNT6       0x00000000//
#define RSTV_USB_TXCOUNT7       0x00000000//
#define RSTV_USB_TXCOUNT        0x00000000
struct USB_TXCOUNT_BIT //COUNT0_COUNT7
{
	UINT32 TX0:10;        //00,Transmission Byte Count 0 (low)
	UINT32 Reserved0:6;   //10,
	UINT32 TX1:10;        //16,Transmission Byte Count 0 (high)
	UINT32 Reserved1:6;   //26,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USB_RXCOUNT0       0x00000000//
#define RSTV_USB_RXCOUNT1       0x00000000//
#define RSTV_USB_RXCOUNT2       0x00000000//
#define RSTV_USB_RXCOUNT3       0x00000000//
#define RSTV_USB_RXCOUNT4       0x00000000//
#define RSTV_USB_RXCOUNT5       0x00000000//
#define RSTV_USB_RXCOUNT6       0x00000000//
#define RSTV_USB_RXCOUNT7       0x00000000//
#define RSTV_USB_RXCOUNT        0x00000000
struct USB_RXCOUNT_BIT //RXCOUNT0_RXCOUNT7
{
	UINT32 RX0:10;        //00,Reception Byte Count(low),
	UINT32 NUMBLOCK0:5;   //10,NUM_BLOCK[4:0] (low), while BLSIZE=1, 0_15=32*(NUMBLOCK+1)=32_512;while BLSIZE=0,1_32=2*NUMBLOCK=2_62
	UINT32 BLSIZE0:1;     //15,BLock SIZE(low)
	UINT32 RX1:10;        //16,Reception Byte Count(high)
	UINT32 NUMBLOCK1:5;   //26,NUM_BLOCK[4:0] (high), while BLSIZE=1, 0_15=32*(NUMBLOCK+1)=32_512;while BLSIZE=0,1_32=2*NUMBLOCK=2_62
	UINT32 BLSIZE1:1;     //31,BLock SIZE(high)
};
//------------------------------------------------------------------------------------------------------------------------------
#define USB_EPCount    3
#define USB_EP0_Size   0x40
#define USB_EP1_Size   0x40
#define USB_EP2_Size   0x40
#define USB_EP3_Size   0x20
#define USB_EP4_Size   0x20
#define USB_EP5_Size   0x20
#define USB_EP6_Size   0x20
#define USB_EP7_Size   0x20//Sum of EP0_7_Size <=0x1C0
#define USB_BUFTAB_Value        0x00000000//8*k,bit0_2=0
//------------------------------------------------------------------------------------------------------------------------------
typedef struct Struct_USBCH//0x40006000
{
  union{UINT32 TXADDR;struct USB_ADDR_BIT TXADDR_BIT;};
  union{UINT32 TXCOUNT;struct USB_TXCOUNT_BIT TXCOUNT_BIT;};
  union{UINT32 RXADDR;struct USB_ADDR_BIT RXADDR_BIT;};
  union{UINT32 RXCOUNT;struct USB_RXCOUNT_BIT RXCOUNT_BIT;};
} USBCH_Type,Type_USBCH;
#define PT_USBCH(i)            ((volatile Type_USBCH *)(BASE_USBRAM+USB_BTABLE_Value*2+i*16))//i=0_7
//------------------------------------------------------------------------------------------------------------------------------
#define USB_Struct  Struct_USB
typedef struct Struct_USB//0x40005C00
{
	union{UINT32 EPR[8];struct USB_EPR_BIT EPR_BIT[8];Type_UINT32_LH EPR_LH[8];}; //0x40005C00(RW),USB Endpoint 0_7 register
	UINT32 Reserved0[8];   //0x40005C20
  union{UINT32 CNTR;struct USB_CNTR_BIT CNTR_BIT;Type_UINT32_LH CNTR_LH;};      //0x40005C40(RW),Control register
	union{UINT32 ISTR;struct USB_ISTR_BIT ISTR_BIT;Type_UINT32_LH ISTR_LH;};      //0x40005C44(RW),Interrupt status register
	union{UINT32 FNR;struct USB_FNR_BIT FNR_BIT;Type_UINT32_LH FNR_LH;};          //0x40005C48(RW),Frame number register
	union{UINT32 DADDR;struct USB_DADDR_BIT DADDR_BIT;};                          //0x40005C4C(RW),Device address register
	union{UINT32 BUFTAB;struct USB_BUFTAB_BIT BUFTAB_BIT;};                       //0x40005C50(RW),=BTABLE,Channel table startpos
  UINT32 Reserved1[43+USB_BUFTAB_Value/2];                                      //0x40005C54(R),
	union{UINT32 MDL;};//0x40005D00(RW),Module_Choose,0=USB1(cann't use with can),1=USB2(can use with can)
	UINT32 Reserved2[191];//0x40005D04(R),
  struct Struct_USBCH CH[USB_EPCount];//0x40006000+USB_BUFTAB_Value*2,Channel table register
  UINT32 RXBUF0[USB_EP0_Size/2];//40006030
  UINT32 TXBUF0[USB_EP0_Size/2];
  UINT32 RXBUF1[USB_EP1_Size/2];
  UINT32 TXBUF1[USB_EP1_Size/2];
  UINT32 RXBUF2[USB_EP2_Size/2];
  UINT32 TXBUF2[USB_EP2_Size/2];
} USB_Type,Type_USB;
#define PT_USB                  ((volatile Type_USB *)BASE_USB)
//------------------------------------------------------------------------------------------------------------------------------
#define USB_EPR(i)              USB.EPR[i]//i=0_7
#define USB_CNTR                USB.CNTR
#define USB_ISTR                USB.ISTR
#define USB_FNR                 USB.FNR
#define USB_DADDR               USB.DADDR
#define USB_BUFTAB              USB.BUFTAB
#define USB_MDL                 USB.MDL
#define USB_TXADDR(i)           USB.CH[i].TXADDR//i=0_7
#define USB_TXCOUNT(i)          USB.CH[i].TXCOUNT//i=0_7
#define USB_RXADDR(i)           USB.CH[i].RXADDR//i=0_7
#define USB_RXCOUNT(i)          USB.CH[i].RXCOUNT//i=0_7
//==============================================================================================================================
#define RSTV_USBFS_GOTGCTL      0x00010000//0x000
struct USBFS_GOTGCTL_BIT
{
	UINT32 SRQSCS:1;     //00,
	UINT32 SRQ:1;        //01,
	UINT32 Reserved0:6;  //02,
	UINT32 HNGSCS:1;     //08,
	UINT32 HNPRQ:1;      //09,
	UINT32 HSHNPEN:1;    //10,
	UINT32 DHNPEN:1;     //11,
	UINT32 Reserved1:4;  //12,
	UINT32 CIDSTS:1;     //16,
	UINT32 DBCT:1;       //17,
	UINT32 ASVLD:1;      //18,
	UINT32 BSVLD:1;      //19,
	UINT32 Reserved2:12; //20,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_GOTGINT      0x00000000//0x004
struct USBFS_GOTGINT_BIT
{
	UINT32 Reserved0:2;  //00,
	UINT32 SEDET:1;      //02,
	UINT32 Reserved1:5;  //03,
	UINT32 SRSSCHG:1;    //08,
	UINT32 HNSSCHG:1;    //09,
	UINT32 Reserved2:7;  //10,
	UINT32 HNGDET:1;     //17,
	UINT32 ADTOCHG:1;    //18,
	UINT32 DBCDNE:1;     //19,
	UINT32 Reserved3:12; //20,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_GAHBCFG      0x00000000//0x008
struct USBFS_GAHBCFG_BIT
{
	UINT32 GINTMSK:1;    //00,
	UINT32 Reserved0:6;  //01,
	UINT32 TXFELVL:1;    //07,
	UINT32 PTXFELVL:1;   //08,
	UINT32 Reserved1:23; //09,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_GUSBCFG      0x00001440//0x00C
struct USBFS_GUSBCFG_BIT
{
	UINT32 TOCAL:3;      //00,
	UINT32 Reserved0:3;  //03,
	UINT32 PHYSEL:1;     //06,
	UINT32 Reserved1:1;  //07,
	UINT32 SRPCAP:1;     //08,
	UINT32 HNPCAP:1;     //09,
	UINT32 TRDT:4;       //10,
	UINT32 Reserved2:15; //14,
	UINT32 FHMOD:1;      //29,
	UINT32 FDMOD:1;      //30,
	UINT32 CTXPKT:1;     //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_GRSTCTL      0x00000000//0x010
struct USBFS_GRSTCTL_BIT
{
	UINT32 CSRST:1;      //00,
	UINT32 HSRST:1;      //01,
	UINT32 FCRST:1;      //02,
	UINT32 Reserved0:1;  //03,
	UINT32 RXFFLSH:1;    //04,
	UINT32 TXFFLSH:1;    //05,
	UINT32 TXFNUM:5;     //06,
	UINT32 Reserved1:20; //11,
	UINT32 AHBIDL:1;     //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_GINTSTS      0x00000000//0x014
#define RSTV_USBFS_GINTMSK      0x00000000//0x018
struct USBFS_GINT_BIT//0x014=GINTSTS,0x18=GINTMSK
{
	UINT32 CMOD:1;       //00, no in  GINTMSK
	UINT32 MMIS:1;       //01,
	UINT32 OTGINT:1;     //02,
	UINT32 SOF:1;        //03,
	UINT32 RXFLVL:1;     //04,
	UINT32 NPTXFE:1;     //05,
	UINT32 GINAKEFF:1;   //06,
	UINT32 GONAKEFF:1;   //07,
	UINT32 Reserved0:2;  //08,
	UINT32 ESUSP:1;      //10,
	UINT32 USBSUSP:1;    //11,
	UINT32 USBRST:1;     //12,
	UINT32 ENUMDNE:1;    //13,
	UINT32 ISOODRP:1;    //14,
	UINT32 EOPF:1;       //15,
	UINT32 Reserved1:2;  //16,
	UINT32 IEPINT:1;     //18,
	UINT32 OEPINT:1;     //19,
	UINT32 IISOIXFR:1;   //20,
	UINT32 IPXFR_INCO:1; //21,also named=IPXFR_INCCOMPISOOUT
	UINT32 Reserved2:2;  //22,
	UINT32 HPRTINT:1;    //24,
	UINT32 HCINT:1;      //25,
	UINT32 PTXFE:1;      //26,
	UINT32 Reserved3:1;  //27,
	UINT32 CIDSCHG:1;    //28,
	UINT32 DISCINT:1;    //29,
	UINT32 SRQINT:1;     //30,
	UINT32 WKUINT:1;     //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_GRXSTSR      0x00000000//0x01C
#define RSTV_USBFS_GRXSTSP      0x00000000//0x020
struct USBFS_GRXSTS_BITH//0x01C=GRXSTSR,0x020=GRXSTSP
{
	UINT32 CHNUM:4;      //00,
	UINT32 BCNT:11;      //04,
	UINT32 DPID:2;       //15,
	UINT32 PKTSTS:4;     //17,
	UINT32 Reserved0:11; //21,
};
struct USBFS_GRXSTS_BITD//0x01C=GRXSTSR,0x020=GRXSTSP
{
	UINT32 EPNUM:4;      //00,
	UINT32 BCNT:11;      //04,
	UINT32 DPID:2;       //15,
	UINT32 PKTSTS:4;     //17,
	UINT32 FRMNUM:4;     //21,
	UINT32 Reserved0:7;  //25,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_GRXFSIZ      0x00000200//0x024
struct USBFS_GRXFSIZ_BIT
{
	UINT32 RXFD:16;      //00,
	UINT32 Reserved0:16; //16,
};
