diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DIEPTXF0     0x00000200//0x028,also named HNPTXFSIZ
struct USBFS_HNPTXFSIZ_BIT
{
	UINT32 NPTXFSA:16;   //00,
	UINT32 NPTXFD:16;    //16,
};
struct USBFS_DIEPTXF0_BIT
{
	UINT32 TX0FSA:16;    //00,
	UINT32 TX0FD:16;     //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HNPTXSTS     0x00040200//0x02C,
struct USBFS_HNPTXSTS_BIT
{
	UINT32 NPTXFSA:16;   //00,
	UINT32 NPTQXSAV:8;   //16,
	UINT32 NPTXQTOP:7;   //24,
	UINT32 Reserved0:1;  //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_GCCFG        0x00000000//0x038,
struct USBFS_GCCFG_BIT
{
	UINT32 Reserved0:16; //00,
	UINT32 PWRDWN:1;     //16,
	UINT32 Reserved1:1;  //17,
	UINT32 VBUSASEN:1;   //18,
	UINT32 VBUSBSEN:1;   //19,
	UINT32 SOFOUTEN:1;   //20,
	UINT32 Reserved2:11; //21,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_CID          0x00001200//0x03C,
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HPTXFSIZ     0x02000400//0x100,
struct USBFS_HPTXFSIZ_BIT
{
	UINT32 PTXSA:16;     //00,
	UINT32 PTXFSIZ:16;   //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DIEPTXF1     0x02000200//0x104,
#define RSTV_USBFS_DIEPTXF2     0x02000400//0x108,
#define RSTV_USBFS_DIEPTXF3     0x02000400//0x10C,
struct USBFS_DIEPTXF_BIT//0x104=DIEPTXF1,0x108=DIEPTXF2,0x10C=DIEPTXF3
{
	UINT32 INEPTXSA:16;  //00,
	UINT32 INEPTXFD:16;  //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HCFG         0x00000000//0x400,
struct USBFS_HCFG_BIT
{
	UINT32 FSLSPCS:2;    //00,
	UINT32 FSLSS:1;      //02,
	UINT32 Reserved0:29; //03,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HFIR         0x0000EA60//0x404,
struct USBFS_HFIR_BIT
{
	UINT32 FRIVL:16;     //00,
	UINT32 Reserved0:16; //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HFNUM        0x00003FFF//0x408,
struct USBFS_HFNUM_BIT
{
	UINT32 FRNUM:16;     //00,
	UINT32 FTREM:16;     //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HPTXSTS      0x00000000//0x410,
struct USBFS_HPTXSTS_BIT
{
	UINT32 PTXFSAVL:16;  //00,
	UINT32 PTXQSAV:8;    //16,
	UINT32 PTXQTOP:8;    //24,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HAINT        0x00000000//0x414,
#define RSTV_USBFS_HAINTMSK     0x00000000//0x418,
struct USBFS_HAINT_BIT//0x414=HAINT,0x418=HAINTMSK
{
	UINT32 HAINT:16;     //00,
	UINT32 Reserved0:16; //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HPRT         0x00000000//0x440,
struct USBFS_HPRT_BIT
{
	UINT32 PCSTS:1;      //00,
	UINT32 PCDET:1;      //01,
	UINT32 PENA:1;       //02,
	UINT32 PENCHNG:1;    //03,
	UINT32 POCA:1;       //04,
	UINT32 POCCHNG:1;    //05,
	UINT32 PRES:1;       //06,
	UINT32 PSUSP:1;      //07,
	UINT32 PRST:1;       //08,
	UINT32 Reserved0:1;  //09,
	UINT32 PLSTS:2;      //10,
	UINT32 PPWR:1;       //12,
	UINT32 PTCTL:4;      //13,
	UINT32 PSPD:2;       //17,
	UINT32 Reserved1:13; //19,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HCCHAR0      0x00000000//0x500,
#define RSTV_USBFS_HCCHAR1      0x00000000//0x520,
#define RSTV_USBFS_HCCHAR2      0x00000000//0x540,
#define RSTV_USBFS_HCCHAR3      0x00000000//0x560,
#define RSTV_USBFS_HCCHAR4      0x00000000//0x580,
#define RSTV_USBFS_HCCHAR5      0x00000000//0x5A0,
#define RSTV_USBFS_HCCHAR6      0x00000000//0x5C0,
#define RSTV_USBFS_HCCHAR7      0x00000000//0x5E0,
#define RSTV_USBFS_HCCHAR       0x00000000
struct USBFS_HCCHAR_BIT//HCCHAR0_HCCHAR7
{
	UINT32 MPSIZ:11;     //00,
	UINT32 EPNUM:4;      //11,
	UINT32 EPDIR:1;      //15,
	UINT32 Reserved0:1;  //16,
	UINT32 LSDEV:1;      //17,
	UINT32 EPTYP:2;      //18,
	UINT32 MCNT:2;       //20,
	UINT32 DAD:7;        //22,
	UINT32 ODDFRM:1;     //29,
	UINT32 CHDIS:1;      //30,
	UINT32 CHENA:1;      //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HCINT0       0x00000000//0x508,
#define RSTV_USBFS_HCINT1       0x00000000//0x528,
#define RSTV_USBFS_HCINT2       0x00000000//0x548,
#define RSTV_USBFS_HCINT3       0x00000000//0x568,
#define RSTV_USBFS_HCINT4       0x00000000//0x588,
#define RSTV_USBFS_HCINT5       0x00000000//0x5A8,
#define RSTV_USBFS_HCINT6       0x00000000//0x5C8,
#define RSTV_USBFS_HCINT7       0x00000000//0x5E8,
#define RSTV_USBFS_HCINT        0x00000000
#define RSTV_USBFS_HCINTMSK0    0x00000000//0x50C,
#define RSTV_USBFS_HCINTMSK1    0x00000000//0x52C,
#define RSTV_USBFS_HCINTMSK2    0x00000000//0x54C,
#define RSTV_USBFS_HCINTMSK3    0x00000000//0x56C,
#define RSTV_USBFS_HCINTMSK4    0x00000000//0x58C,
#define RSTV_USBFS_HCINTMSK5    0x00000000//0x5AC,
#define RSTV_USBFS_HCINTMSK6    0x00000000//0x5CC,
#define RSTV_USBFS_HCINTMSK7    0x00000000//0x5EC,
#define RSTV_USBFS_HCINTMSK     0x00000000
struct USBFS_HCINT_BIT//0x508=HCINT0,Step=0x20;0x50C=HCINTMSK0,Step=0x20
{
	UINT32 XFRC:1;       //00,
	UINT32 CHH:1;        //01,
	UINT32 Reserved0:1;  //02,
	UINT32 STALL:1;      //03,
	UINT32 NAK:1;        //04,
	UINT32 ACK:1;        //05,
	UINT32 Reserved1:1;  //06,
	UINT32 TXERR:1;      //07,
	UINT32 BBERR:1;      //08,
	UINT32 FRMOR:1;      //09,
	UINT32 DTERR:1;      //10,
	UINT32 Reserved2:21; //11,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_HCTSIZ0      0x00000000//0x510,
#define RSTV_USBFS_HCTSIZ1      0x00000000//0x530,
#define RSTV_USBFS_HCTSIZ2      0x00000000//0x550,
#define RSTV_USBFS_HCTSIZ3      0x00000000//0x570,
#define RSTV_USBFS_HCTSIZ4      0x00000000//0x590,
#define RSTV_USBFS_HCTSIZ5      0x00000000//0x5B0,
#define RSTV_USBFS_HCTSIZ6      0x00000000//0x5D0,
#define RSTV_USBFS_HCTSIZ7      0x00000000//0x5F0,
#define RSTV_USBFS_HCTSIZ       0x00000000
struct USBFS_HCTSIZ_BIT//0x508=HCTSIZ0,Step=0x20
{
	UINT32 XFRSIZ:19;    //00,
	UINT32 PKTCNT:10;    //19,
	UINT32 DPID:2;       //29,
	UINT32 Reserved0:1;  //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DCFG         0x00000000//0x800
struct USBFS_DCFG_BIT
{
	UINT32 DSPD:2;       //00,
	UINT32 NZLSOHSK:1;   //02,
	UINT32 Reserved0:1;  //03,
	UINT32 DAD:7;        //04,
	UINT32 PFVL:2;       //11,
	UINT32 Reserved1:19; //13,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DCTL         0x00000000//0x804
struct USBFS_DCTL_BIT
{
	UINT32 RWUSIG:1;     //00,
	UINT32 SDIS:1;       //01,
	UINT32 GINSTS:1;     //02,
	UINT32 GONSTS:1;     //03,
	UINT32 TCTL:3;       //04,
	UINT32 SGINAK:1;     //07,
	UINT32 CGINAK:1;     //08,
	UINT32 SGONAK:1;     //09,
	UINT32 CGONAK:1;     //10,
	UINT32 POPRGDNE:1;   //11,
	UINT32 Reserved0:20; //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DSTS         0x00000000//0x808
struct USBFS_DSTS_BIT
{
	UINT32 SUSPSTS:1;    //00,
	UINT32 ENUMSPD:2;    //01,
	UINT32 EERR:1;       //03,
	UINT32 Reserved0:4;  //04,
	UINT32 FNSOF:14;     //08,
	UINT32 Reserved1:10; //22,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DIEPMSK      0x00000000//0x810
struct USBFS_DIEPMSK_BIT
{
	UINT32 XFRCM:1;      //00,
	UINT32 EPDM:1;       //01,
	UINT32 Reserved0:1;  //02,
	UINT32 TOM:1;        //03,
	UINT32 ITTXFEM:1;    //04,
	UINT32 INEPNMM:1;    //05,
	UINT32 INEPNEM:1;    //06,
	UINT32 Reserved1:6;  //07,
	UINT32 NAKM:1;       //13,
	UINT32 Reserved2:18; //14,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DOEPMSK      0x00000000//0x814
struct USBFS_DOEPMSK_BIT
{
	UINT32 XFRCM:1;      //00,
	UINT32 EPDM:1;       //01,
	UINT32 Reserved0:1;  //02,
	UINT32 STUPM:1;      //03,
	UINT32 OTEPDM:1;     //04,
	UINT32 STSPHSRXM:1;  //05,
	UINT32 Reserved1:2;  //06,
	UINT32 OUTPKTERRM:1; //08,
	UINT32 Reserved2:3;  //09,
	UINT32 BERRM:1;      //12,
	UINT32 NAKM:1;       //13,
	UINT32 Reserved3:18; //14,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DAINT        0x00000000//0x818
#define RSTV_USBFS_DAINTMSK     0x00000000//0x81C
struct USBFS_DAINT_BIT//0x818=DAINT,0x81C=DAINMSK
{
	UINT32 IEPINT:16;    //00,
	UINT32 OEPINT:16;    //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DVBUSDIS     0x000017D7//0x828
struct USBFS_DVBUSDIS_BIT
{
	UINT32 VBUSDT:16;    //00,
	UINT32 Reserved0:16; //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DVBUSPULSE   0x000005B8//0x82C
struct USBFS_DVBUSPULSE_BIT
{
	UINT32 DVBUSP:12;    //00,
	UINT32 Reserved0:20; //12,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DIEPEMPMSK   0x00000000//0x834
struct USBFS_DIEPEMPMSK_BIT
{
	UINT32 INEPTXFEM:16; //00,
	UINT32 Reserved0:16; //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DIEPCTL0     0x00008000//0x900
#define RSTV_USBFS_DIEPCTL1     0x00000000//0x920
#define RSTV_USBFS_DIEPCTL2     0x00000000//0x940
#define RSTV_USBFS_DIEPCTL3     0x00000000//0x960
#define RSTV_USBFS_DIEPCTL      0x00000000
struct USBFS_DIEPCTL_BITA//DIEPCTL0
{
	UINT32 MPSIZ:2;      //00,
	UINT32 Reserved0:13; //12,
	UINT32 USBAEP:1;     //15,
	UINT32 Reserved1:1;  //16,
	UINT32 NAKSTS:1;     //17,
	UINT32 EPTYP:2;      //18,
	UINT32 Reserved2:1;  //20,
	UINT32 STALL:1;      //21,
	UINT32 TXFNUM:4;     //22,
	UINT32 CNAK:1;       //26,
	UINT32 SNAK:1;       //27,
	UINT32 Reserved3:2;  //28,
	UINT32 EPDIS:1;      //30,
	UINT32 EPENA:1;      //31,
};
struct USBFS_DIEPCTL_BITB//DIEPCTL1_DIEPCTL3
{
	UINT32 MPSIZ:11;     //00,w=2 in DIEPCTL0
	UINT32 Reserved0:4;  //11,
	UINT32 USBAEP:1;     //15,
	UINT32 EONUM_DPID:1; //16,no in DIEPCTL0
	UINT32 NAKSTS:1;     //17,
	UINT32 EPTYP:2;      //18,
	UINT32 Reserved2:1;  //20,
	UINT32 STALL:1;      //21,
	UINT32 TXFNUM:4;     //22,
	UINT32 CNAK:1;       //26,
	UINT32 SNAK:1;       //27,
	UINT32 SD0PID:1;     //28,no in DIEPCTL0
	UINT32 SODDFR:1;     //29,no in DIEPCTL0
	UINT32 EPDIS:1;      //30,
	UINT32 EPENA:1;      //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DIEPINT0      0x00000080//0x908
#define RSTV_USBFS_DIEPINT1      0x00000080//0x928
#define RSTV_USBFS_DIEPINT2      0x00000080//0x948
#define RSTV_USBFS_DIEPINT3      0x00000080//0x968
#define RSTV_USBFS_DIEPINT       0x00000080
struct USBFS_DIEPINT_BIT//0x908=DIEPINT0,0x928=DIEPINT1,0x948=DIEPINT2,0x968=DIEPINT3
{
	UINT32 XFRC:1;       //00,
	UINT32 EPDISD:1;     //01,
	UINT32 Reserved0:1;  //02,
	UINT32 TOC:1;        //03,
	UINT32 ITTXFE:1;     //04,
	UINT32 INEPNM:1;     //05,
	UINT32 INEPNE:1;     //06,
	UINT32 TXFE:1;       //07,
	UINT32 Reserved1:3;  //08,
	UINT32 PKDTRPSTS:1;  //11,
	UINT32 Reserved2:1;  //12,
	UINT32 NAK:1;        //13,
	UINT32 Reserved3:18; //14,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DIEPTSIZ0     0x00000000//0x910
#define RSTV_USBFS_DIEPTSIZ1     0x00000000//0x930
#define RSTV_USBFS_DIEPTSIZ2     0x00000000//0x950
#define RSTV_USBFS_DIEPTSIZ3     0x00000000//0x970
#define RSTV_USBFS_DIEPTSIZ      0x00000000
struct USBFS_DIEPTSIZ_BITA//0x910=DIEPTSIZ0
{
	UINT32 XFRSIZ:7;     //00,
	UINT32 Reserved0:12; //07,
	UINT32 PKTCNT:2;     //19,
	UINT32 Reserved3:11; //21,
};
struct USBFS_DIEPTSIZ_BITB//0x930=DIEPTSIZ1,0x950=DIEPTSIZ2,0x970=DIEPTSIZ3
{
	UINT32 XFRSIZ:19;    //00,
	UINT32 PKTCNT:10;    //19,
	UINT32 Reserved0:3; //29,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DTXFSTS0      0x00000200//0x918
#define RSTV_USBFS_DTXFSTS1      0x00000200//0x938
#define RSTV_USBFS_DTXFSTS2      0x00000200//0x958
#define RSTV_USBFS_DTXFSTS3      0x00000200//0x978
#define RSTV_USBFS_DTXFSTS       0x00000200
struct USBFS_DTXFSTS_BIT//0x918=DTXFSTS0,0x938=DTXFSTS1,0x958=DTXFSTS2,0x978=DTXFSTS3
{
	UINT32 INEPTFSAV:16; //00,
	UINT32 Reserved0:16; //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DOEPCTL0      0x00008000//0xB00
#define RSTV_USBFS_DOEPCTL1      0x00000000//0xB20
#define RSTV_USBFS_DOEPCTL2      0x00000000//0xB40
#define RSTV_USBFS_DOEPCTL3      0x00000000//0xB60
#define RSTV_USBFS_DOEPCTL       0x00000000
struct USBFS_DOEPCTL_BITA//0xB00=DOEPCTL0
{
	UINT32 MPSIZ:2;      //00,
	UINT32 Reserved0:13; //02,
	UINT32 USBAEP:1;     //15,
	UINT32 Reserved1:1;  //16,
	UINT32 NAKSTS:1;     //17,
	UINT32 EPTYP:2;      //18,
	UINT32 SNPM:1;       //20,
	UINT32 STALL:1;      //21,
	UINT32 Reserved2:4;  //22,
	UINT32 CNAK:1;       //26,
	UINT32 SNAK:1;       //27,
	UINT32 Reserved3:2;  //28,
	UINT32 EPDIS:1;      //30,
	UINT32 EPENA:1;      //31,
};
struct USBFS_DOEPCTL_BITB//0xB20=DOEPCTL1,0xB40=DOEPCTL2,0xB60=DOEPCTL3
{
	UINT32 MPSIZ:11;     //00,w=2 in DOEPCTL0
	UINT32 Reserved0:4;  //11,
	UINT32 USBAEP:1;     //15,
	UINT32 EONUM_DPID:1; //16,no in DOEPCTL0
	UINT32 NAKSTS:1;     //17,
	UINT32 EPTYP:2;      //18,
	UINT32 SNPM:1;       //20,
	UINT32 STALL:1;      //21,
	UINT32 Reserved2:4;  //22,
	UINT32 CNAK:1;       //26,
	UINT32 SNAK:1;       //27,
	UINT32 SD0PID:1;     //28,,no in DOEPCTL0
	UINT32 SODDFRM:1;    //29,,no in DOEPCTL0,also named SEVNFRM
	UINT32 EPDIS:1;      //30,
	UINT32 EPENA:1;      //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DOEPINT0      0x00008000//0xB08
#define RSTV_USBFS_DOEPINT1      0x00000000//0xB28
#define RSTV_USBFS_DOEPINT2      0x00000000//0xB48
#define RSTV_USBFS_DOEPINT3      0x00000000//0xB68
#define RSTV_USBFS_DOEPINT       0x00000000
struct USBFS_DOEPINT_BIT//0xB08=DOEPINT0,0xB28=DOEPINT1,0xB48=DOEPINT2,0xB68=DOEPINT3
{
	UINT32 XFRC:1;       //00,
	UINT32 EPDISD:1;     //01,
	UINT32 Reserved0:1;  //02,
	UINT32 STUP:1;       //03,
	UINT32 OTEPDIS:1;    //04,
	UINT32 STSPHSRX:1;   //05,
	UINT32 Reserved1:2;  //06,
	UINT32 OUTPKTERR:1;  //08,
	UINT32 Reserved2:3;  //09,
	UINT32 BERR:1;       //12,
	UINT32 NAK:1;        //13,
	UINT32 Reserved3:18; //14,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_DOEPTSIZ0     0x00008000//0xB10
#define RSTV_USBFS_DOEPTSIZ1     0x00000000//0xB30
#define RSTV_USBFS_DOEPTSIZ2     0x00000000//0xB50
#define RSTV_USBFS_DOEPTSIZ3     0x00000000//0xB70
#define RSTV_USBFS_DOEPTSIZ      0x00000000
struct USBFS_DOEPTSIZ_BITA//0xB10=DOEPTSIZ0
{
	UINT32 XFRSIZ:7;     //00,
	UINT32 Reserved0:12; //07,
	UINT32 PKTCNT:1;     //19,
	UINT32 Reserved1:9;  //20,
	UINT32 STUPCNT:2;    //29,
	UINT32 Reserved2:1;  //31,
};
struct USBFS_DOEPTSIZ_BITB//0xB30=DOEPTSIZ1,0xB50=DOEPTSIZ2,0xB70=DOEPTSIZ3
{
	UINT32 XRFSIZ:19;    //00,w=7 in DOEPTSIZ0
	UINT32 PKTCNT:10;    //19,
	UINT32 STUPCNT:1;    //29,
	UINT32 RXDPID:1;     //30,
	UINT32 Reserved0:1;  //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_USBFS_PCGCCTL       0x00000000//0xE00
struct USBFS_PCGCCTL_BIT
{
	UINT32 STPPCLK:1;    //00,
	UINT32 GATEHCLK:1;   //01,
	UINT32 Reserved0:2;  //02,
	UINT32 PHYSUSP:1;    //04,
	UINT32 Reserved1:27; //05,
};
//------------------------------------------------------------------------------------------------------------------------------
struct Struct_USBFS_HC//HC[0]=0x500,HC[1]=0x520,...,HC[7]=0x5E0
{
	union{UINT32 HCCHAR;struct USBFS_HCCHAR_BIT HCCHAR_BIT;};
	UINT32 Reserved0[1];
	union{UINT32 HCINT;struct USBFS_HCINT_BIT HCINT_BIT;};
	union{UINT32 HCINTMSK;struct USBFS_HCINT_BIT HCINTMSK_BIT;};
	union{UINT32 HCTSIZ;struct USBFS_HCTSIZ_BIT HCTSIZ_BIT;};
	UINT32 Reserved1[3];
};
//------------------------------------------------------------------------------------------------------------------------------
struct Struct_USBFS_DINEPS//0x900
{
  union{UINT32 DIEPCTL;struct USBFS_DIEPCTL_BITA DIEPCTL_BITA;struct USBFS_DIEPCTL_BITB DIEPCTL_BITB;};     //0x00,dev IN EP Ctl Reg
  UINT32 Reserved0[1];  //0x04,Reserved 
  union{UINT32 DIEPINT;struct USBFS_DIEPINT_BIT DIEPINT_BIT;};//0x08,dev IN EP Itr Reg
  UINT32 Reserved1[1];  //0x0C,Reserved
  union{UINT32 DIEPTSIZ;struct USBFS_DIEPTSIZ_BITA DIEPTSIZ_BITA;struct USBFS_DIEPTSIZ_BITB DIEPTSIZ_BITB;};//0x10,dev IN EP Tx Size
  UINT32 Reserved2[1];  //0x14,Reserved
  union{UINT32 DTXFSTS;struct USBFS_DTXFSTS_BIT DTXFSTS_BIT;};//0x18,IN EP TxFIFO Sts
  UINT32 Reserved3[1];  //0x1C,Reserved
};
//------------------------------------------------------------------------------------------------------------------------------
struct Struct_USBFS_DOUTEPS//0xB00
{
  union{UINT32 DOEPCTL;struct USBFS_DOEPCTL_BITA DOEPCTL_BITA;struct USBFS_DOEPCTL_BITA DOEPCTL_BITB;};//0x00,OUT EP Ctl Reg
  UINT32 Reserved0[1];  //0x04,Reserved
  union{UINT32 DOEPINT;struct USBFS_DOEPINT_BIT DOEPINT_BIT;};//0x08,OUT EP Itr Reg
  UINT32 Reserved1[1];  //0x0C,Reserved
  union{UINT32 DOEPTSIZ;struct USBFS_DOEPTSIZ_BITA DOEPTSIZ_BITA;struct USBFS_DOEPTSIZ_BITB DOEPTSIZ_BITB;}; //0x10,OUT EP Tx Size
  UINT32 Reserved2[3];  //0x14,Reserved
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define USBFS_Struct Struct_USBFS
typedef struct Struct_USBFS//0x50000000
{
  union{UINT32 GOTGCTL;struct USBFS_GOTGCTL_BIT GOTGCTL_BIT;};  //0x000,USB_OTG Control and Status reg
  union{UINT32 GOTGINT;struct USBFS_GOTGINT_BIT GOTGINT_BIT;};  //0x004,USB_OTG Interrupt Register
  union{UINT32 GAHBCFG;struct USBFS_GAHBCFG_BIT GAHBCFG_BIT;};  //0x008,Core AHB Configuration Register
  union{UINT32 GUSBCFG;struct USBFS_GUSBCFG_BIT GUSBCFG_BIT;};  //0x00C,Core USB Configuration Register
  union{UINT32 GRSTCTL;struct USBFS_GRSTCTL_BIT GRSTCTL_BIT;};  //0x010,Core Reset Register
  union{UINT32 GINTSTS;struct USBFS_GINT_BIT GINTSTS_BIT;};     //0x014,Core Interrupt Register
  union{UINT32 GINTMSK;struct USBFS_GINT_BIT GINTMSK_BIT;};     //0x018,Core Interrupt Mask Register
  union{UINT32 GRXSTSR;struct USBFS_GRXSTS_BITH GRXSTSR_BITH;struct USBFS_GRXSTS_BITD GRXSTSR_BITD;};   //0x01C,Receive Sts Q Read Register
  union{UINT32 GRXSTSP;struct USBFS_GRXSTS_BITH GRXSTSP_BITH;struct USBFS_GRXSTS_BITD GRXSTSP_BITD;};   //0x020,Receive Sts Q Read & POP Register
  union{UINT32 GRXFSIZ;struct USBFS_GRXFSIZ_BIT GRXFSIZ_BIT;};  //0x024,Receive FIFO Size Register
  union{UINT32 DIEPTXF0;struct USBFS_HNPTXFSIZ_BIT HNPTXFSIZ_BIT;struct USBFS_DIEPTXF0_BIT DIEPTXF0_BIT;};//0x028,EP0 Tx FIFO Size Register
  union{UINT32 HNPTXSTS;struct USBFS_HNPTXSTS_BIT HNPTXSTS_BIT;};//0x02C,Non Periodic Tx FIFO/Queue Sts reg
  UINT32 Reserved0[2];  //0x030,Reserved
  union{UINT32 GCCFG;struct USBFS_GCCFG_BIT GCCFG_BIT;};                //0x038,General Core configuration reg
  union{UINT32 CID;Type_BIT32 CID_BIT;};                                //0x03C,User ID Register
  UINT32 Reserved1[48]; //0x040,Reserved
  union{UINT32 HPTXFSIZ;struct USBFS_HPTXFSIZ_BIT HPTXFSIZ_BIT;};       //0x100,Host Periodic Tx FIFO Size Reg
  union{UINT32 DIEPTXF[3];struct USBFS_DIEPTXF_BIT DIEPTXF_BIT[3];};    //0x104,dev Transmit FIFO
	UINT32 Reserved2[188];//0x110,
	union{UINT32 HCFG;struct USBFS_HCFG_BIT HCFG_BIT;};           //0x400,
	union{UINT32 HFIR;struct USBFS_HFIR_BIT HFIR_BIT;};           //0x404,
	union{UINT32 HFNUM;struct USBFS_HFNUM_BIT HFNUM_BIT;};        //0x408,
	UINT32 Reserved3[1];  //0x40C,
	union{UINT32 HPTXSTS;struct USBFS_HPTXSTS_BIT HPTXSTS_BIT;};  //0x410,
	union{UINT32 HAINT;struct USBFS_HAINT_BIT HAINT_BIT;};        //0x414,
	union{UINT32 HAINTMSK;struct USBFS_HAINT_BIT HAINTMSK_BIT;};  //0x418,
	UINT32 Reserved4[9];  //0x41C,
	union{UINT32 HPRT;struct USBFS_HPRT_BIT HPRT_BIT;};           //0x440,
	UINT32 Reserved5[47]; //0x444,
	struct Struct_USBFS_HC HC[8]; //0x500,
	UINT32 Reserved6[128];//0x600,
  union{UINT32 DCFG;struct USBFS_DCFG_BIT DCFG_BIT;};           //0x800,dev Configuration Register
  union{UINT32 DCTL;struct USBFS_DCTL_BIT DCTL_BIT;};           //0x804,dev Control Register
  union{UINT32 DSTS;struct USBFS_DSTS_BIT DSTS_BIT;};           //0x808,dev Status Register (RO)
  UINT32 Reserved7[1];  //0x80C,Reserved
  union{UINT32 DIEPMSK;struct USBFS_DIEPMSK_BIT DIEPMSK_BIT;};  //0x810,dev IN Endpoint Mask
  union{UINT32 DOEPMSK;struct USBFS_DOEPMSK_BIT DOEPMSK_BIT;};  //0x814,dev OUT Endpoint Mask
  union{UINT32 DAINT;struct USBFS_DAINT_BIT DAINT_BIT;};        //0x818,dev All Endpoints Itr Reg
  union{UINT32 DAINTMSK;struct USBFS_DAINT_BIT DAINTMSK_BIT;};  //0x81C,dev All Endpoints Itr Mask
  UINT32 Reserved8[2];  //0x820,Reserved
  union{UINT32 DVBUSDIS;struct USBFS_DVBUSDIS_BIT DVBUSDIS_BIT;};       //0x828,dev VBUS discharge Register
  union{UINT32 DVBUSPULSE;struct USBFS_DVBUSPULSE_BIT DVBUSPULSE_BIT;}; //0x82C,dev VBUS Pulse Register
  UINT32 Reserved9[1];  //0x830,Reserved
  union{UINT32 DIEPEMPMSK;struct USBFS_DIEPEMPMSK_BIT DIEPEMPMSK_BIT;}; //0x834,IN EP FIFO empty int mask	
	UINT32 Reserved10[50];//0x838,
	struct Struct_USBFS_DINEPS    DI[4];//0x900,
	UINT32 Reserved11[96];//0x980,
	struct Struct_USBFS_DOUTEPS   DO[4];//0xB00,
	UINT32 Reserved12[160];//0xB80,
	union{UINT32 PCGCCTL;struct USBFS_PCGCCTL_BIT PCGCCTL_BIT;};  //0xE00,
} USBFS_Type,Type_USBFS;
