diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PT_USBFS                ((volatile Type_USBFS *)BASE_USBFS) 
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define USBFS_GOTGCTL           USBFS.GOTGCTL
#define USBFS_GOTGINT           USBFS.GOTGINT
#define USBFS_GAHBCFG           USBFS.GAHBCFG
#define USBFS_GUSBCFG           USBFS.GUSBCFG
#define USBFS_GRSTCTL           USBFS.GRSTCTL
#define USBFS_GINTSTS           USBFS.GINTSTS
#define USBFS_GINTMSK           USBFS.GINTMSK
#define USBFS_GRXSTSR           USBFS.GRXSTSR
#define USBFS_GRXSTSP           USBFS.GRXSTSP
#define USBFS_GRXFSIZ           USBFS.GRXFSIZ
#define USBFS_DIEPTXF0          USBFS.DIEPTXF0
#define USBFS_HNPTXSTS          USBFS.HNPTXSTS
#define USBFS_GCCFG             USBFS.GCCFG
#define USBFS_CID               USBFS.CID
#define USBFS_HPTXFSIZ          USBFS.HPTXFSIZ
#define USBFS_DIEPTXF(i)        USBFS.DIEPTXF[i]//i=0_2
#define USBFS_HCFG              USBFS.HCFG
#define USBFS_HFIR              USBFS.HFIR
#define USBFS_HFNUM             USBFS.HFNUM
#define USBFS_HPTXSTS           USBFS.HPTXSTS
#define USBFS_HAINT             USBFS.HAINT
#define USBFS_HAINTMSK          USBFS.HAINTMSK
#define USBFS_HPRT              USBFS.HPRT
#define USBFS_HCCHAR(i)         USBFS.HC[i].HCCHAR//i=0_7
#define USBFS_HCINT(i)          USBFS.HC[i].HCINT//i=0_7
#define USBFS_HCINTMSK(i)       USBFS.HC[i].HCINTMSK//i=0_7
#define USBFS_HCTSIZ(i)         USBFS.HC[i].HCTSIZ//i=0_7
#define USBFS_DCFG              USBFS.DCFG
#define USBFS_DCTL              USBFS.DCTL
#define USBFS_DSTS              USBFS.DSTS
#define USBFS_DIEPMSK           USBFS.DIEPMSK
#define USBFS_DOEPMSK           USBFS.DOEPMSK
#define USBFS_DAINT             USBFS.DAINT
#define USBFS_DAINTMSK          USBFS.DAINTMSK
#define USBFS_DVBUSDIS          USBFS.DVBUSDIS
#define USBFS_DVBUSPULSE        USBFS.DVBUSPULSE
#define USBFS_DIEPEMPMSK        USBFS.DIEPEMPMSK
#define USBFS_DIEPCTL(i)        USBFS.DI[i].DIEPCTL//i=0_3
#define USBFS_DIEPINT(i)        USBFS.DI[i].DIEPINT//i=0_3
#define USBFS_DIEPTSIZ(i)       USBFS.DI[i].DIEPTSIZ//i=0_3
#define USBFS_DTXFSTS(i)        USBFS.DI[i].DTXFSTS//i=0_3
#define USBFS_DOEPCTL(i)        USBFS.DO[i].DOEPCTL//i=0_3
#define USBFS_DOEPINT(i)        USBFS.DO[i].DOEPINT//i=0_3
#define USBFS_DOEPTSIZ(i)       USBFS.DO[i].DOEPTSIZ//i=0_3
#define USBFS_PCGCCTL           USBFS.PCGCCTL
//==============================================================================================================================
#define RSTV_DES_FLASHSIZE        0x00000000//0x1FFFF7E0,FLASH Size in kbytes
struct DES_FLASHSIZE_BIT
{
	UINT32 SIZE:16;      //00,FLASH memory Size of the device in Kbytes
	UINT32 Reserved0:16; //04,
};
//------------------------------------------------------------------------------------------------------------------------------
#define DES_Struct Struct_DES
typedef struct Struct_DES//0x1FFFF7E0,Device electronic signature
{
  union{UINT32 FLASHSIZE;struct DES_FLASHSIZE_BIT FLASHSIZE_BIT;};//0x000(R),Flash size
  UINT32 Reserved0[1];      //0x004(R),
  union{UINT32 UID[3];};    //0x008(R),96 bits
} DES_Type,Type_DES;
#define PT_DES                  ((volatile Type_DES *)BASE_DES)
//------------------------------------------------------------------------------------------------------------------------------
#define DES_FLASHSIZE           DES.FLASHSIZE
#define DES_UID(i)              DES.UID[i]
//==============================================================================================================================
//Core_CM3 CPU
//CPU Register
#define RSTV_APSR               0x00000000
typedef union CPU_APSR_REG//0x000
{
  struct CPU_APSR_BIT
  {
    UINT32 Reserved0:27;  //
    UINT32 Q:1;           //27,粘着饱和状态(sticky saturation)
    UINT32 V:1;           //28,溢出
    UINT32 C:1;           //02,进位/借位
    UINT32 Z:1;           //03,零
    UINT32 N:1;           //04,负数
  }BIT;
  UINT32 VAL;
} APSR_Type,Type_APSR;
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_IPSR               0x00000000
typedef union CPU_IPSR_REG//0x000
{
  struct CPU_IPSR_BIT
  {
    UINT32 IRQN:9;        //中断号:基础=0，NMI=2，SVCall=11,INTISR[0]=16,INTISR[1]=17,...
    UINT32 Reserved0:23;  //
  }BIT;
  UINT32 VAL;
} IPSR_Type,Type_IPSR;
//------------------------------------------------------------------------------------------------------------------------------
typedef union CPU_EPSR_REG//0x000
{
  struct CPU_EPSR_BIT//ICI
  {
    UINT32 Reserved0:10;  //0,
    UINT32 ICT_IT:6;      //10,ICT_IT：ICI_IT=if-then,包含指令数目与执行条件
    UINT32 Reserved1:8;   //16,
    UINT32 T:1;           //24,使用一条相互作用的指令来清零，当T=0时，引起INVSTATE异常
    UINT32 ICI_IT:2;      //25,
    UINT32 Reserved2:5;   //27,
  }BIT;
	UINT32               VAL;
} EPSR_Type,Type_EPSR;
//==============================================================================================================================
#define RSTV_ITM_PORT           0x00000000//0x000,
#define RSTV_ITM_TER            0x00000000//0x000,
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ITM_TPR            0x00000000//0xE00,
struct ITM_TPR_BIT
{
	UINT32 PRIVMASK:4;   //00,PRIVMASK
	UINT32 Reserved0:28; //04,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ITM_TCR            0x00000000//0xE80,ITM Trace Control Register Definitions
struct ITM_TCR_BIT
{
	UINT32 ITMENA:1;     //00,ITM Enable bit
	UINT32 TSENA:1;      //01,
	UINT32 SYNCENA:1;    //02,
	UINT32 DWTENA:1;     //03,
	UINT32 SWOENA:1;     //04,
	UINT32 Reserved0:3;  //05,
	UINT32 TSPrescale:2; //08,
	UINT32 Reserved1:6;  //10,
	UINT32 ATBID:3;      //16,
	UINT32 Reserved2:4;  //19,
	UINT32 BUSY:1;       //23,
	UINT32 Reserved3:8;  //24,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ITM_IWR            0x00000000//0xEF8,ITM Integration Write Register Definitions
struct ITM_IWR_BIT
{
	UINT32 ATVALIDM:1;   //00,
	UINT32 Reserved0:31; //01,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ITM_IRR            0x00000000//0xEFC,ITM Integration Read Register Definitions
struct ITM_IRR_BIT
{
	UINT32 ATREADYM:1;   //00,
	UINT32 Reserved0:31; //01,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ITM_IMCR           0x00000000//0xF00,ITM Integration Mode Control Register Definitions
struct ITM_IMCR_BIT
{
	UINT32 NTEGRATION:1; //00,
	UINT32 Reserved0:31; //01,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ITM_LAR            0x00000000//0xFB0,
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ITM_LSR            0x00000003//0xFB4,ITM Lock Status Register Definitions
struct ITM_LSR_BIT
{
	UINT32 Present:1;    //00,
	UINT32 Access:1;     //01,
	UINT32 ByteAcc:1;    //02,
	UINT32 Reserved0:29; //03,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define ITM_Struct Struct_ITM
typedef struct Struct_ITM//0xE0000000
{
  union{UINT32 PORT[32];Type_BIT32 PORT_BIT[32];Type_UINT32_BIT8 PORT_B8[32];Type_UINT32_BIT16 PORT_B16[32];};//0x000(W),ITM Stimulus Port Registers
  UINT32 Reserved0[864]; //0x080(R),                                
  union{UINT32 TER;Type_BIT32 TER_BIT;};//0xE00(RW),ITM Trace Enable Register
  UINT32 Reserved1[15];  //0xE04(R),                                
  union{UINT32 TPR;struct ITM_TPR_BIT TPR_BIT;};//0xE40(RW),ITM Trace Privilege Register
  UINT32 Reserved2[15];  //0xE44(R),                                
  union{UINT32 TCR;struct ITM_TCR_BIT TCR_BIT;};//0xE80,ITM Trace Control Register
  UINT32 Reserved3[29];  //0xE84(R),                          
  union{UINT32 IWR;struct ITM_IWR_BIT IWR_BIT;};//0xEF8(RW),ITM Integration Write Register
  union{UINT32 IRR;struct ITM_IRR_BIT IRR_BIT;};//0xEFC(RW),ITM Integration Read Register
  union{UINT32 IMCR;struct ITM_IMCR_BIT IMCR_BIT;};//0xF00(RW),ITM Integration Mode Control Register
  UINT32 Reserved4[43];  //0xF04(R),                             
  union{UINT32 LAR;Type_BIT32 LAR_BIT;};        //0xFB0(RW),ITM Lock Access Register
  union{UINT32 LSR;struct ITM_LSR_BIT LSR_BIT;};//0xFB4(RW),ITM Lock Status Register
  UINT32 Reserved5[6];  //0xFB8(R),
  union{UINT32 PID4;};//0xFD0(R),ITM Peripheral Identification Register #4
  union{UINT32 PID5;};//0xFD4(R),ITM Peripheral Identification Register #5
  union{UINT32 PID6;};//0xFD8(R),ITM Peripheral Identification Register #6
  union{UINT32 PID7;};//0xFDC(R),ITM Peripheral Identification Register #7
  union{UINT32 PID0;};//0xFE0(R),ITM Peripheral Identification Register #0
  union{UINT32 PID1;};//0xFE4(R),ITM Peripheral Identification Register #1
  union{UINT32 PID2;};//0xFE8(R),ITM Peripheral Identification Register #2
  union{UINT32 PID3;};//0xFEC(R),ITM Peripheral Identification Register #3
  union{UINT32 CID0;};//0xFF0(R),ITM Component  Identification Register #0
  union{UINT32 CID1;};//0xFF4(R),ITM Component  Identification Register #1
  union{UINT32 CID2;};//0xFF8(R),ITM Component  Identification Register #2
  union{UINT32 CID3;};//0xFFC(R),ITM Component  Identification Register #3
} ITM_Type,Type_ITM;
#define PT_M3ITM                ((volatile Type_ITM *)BASE_ITM)        
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define ITM_PORT(i)             ITM.PORT[i]
#define ITM_TER                 ITM.TER
#define ITM_TPR                 ITM.TPR
#define ITM_TCR                 ITM.TCR
#define ITM_IWR                 ITM.IWR
#define ITM_IRR                 ITM.IRR
#define ITM_IMCR                ITM.IMCR
#define ITM_LAR                 ITM.LAR
#define ITM_LSR                 ITM.LSR
#define ITM_PID4                ITM.PID4
#define ITM_PID5                ITM.PID5
#define ITM_PID6                ITM.PID6
#define ITM_PID7                ITM.PID7
#define ITM_PID0                ITM.PID0
#define ITM_PID1                ITM.PID1
#define ITM_PID2                ITM.PID2
#define ITM_PID3                ITM.PID3
#define ITM_CID0                ITM.CID0
#define ITM_CID1                ITM.CID1
#define ITM_CID2                ITM.CID2
#define ITM_CID3                ITM.CID3
//==============================================================================================================================
#define RSTV_DWT_CTRL           0x40000000//0x000,DWT
struct DWT_CTRL_BIT
{
	UINT32 Reserved0:1;  //00,
	UINT32 POSTPRST:4;   //01,
	UINT32 POSTCNT:4;    //05,
	UINT32 CYCTAP:1;     //09,
	UINT32 SYNCTAP:2;    //10,
	UINT32 PCSAMPLENA:1; //12,
	UINT32 Reserved1:3;  //13,
	UINT32 EXCTRCENA:1;  //16,
	UINT32 CPIEVTENA:1;  //17,
	UINT32 EXCEVTENA:1;  //18,
	UINT32 SLEEPEVTENA:1;//19,
	UINT32 LSUEVTENA:1;  //20,
	UINT32 FOLDEVTENA:1; //21,
	UINT32 CYCEVTENA:1;  //22,
	UINT32 Reserved2:5;  //23,
	UINT32 NUMCOMP:4;    //28,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_CYCCNT         0x00000000//0x004,DWT,采样器周期计数器
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_CPICNT         0x00000000//0x008,DWT
struct DWT_CPICNT_BIT
{
	UINT32 CPICNT:8;     //00,
	UINT32 Reserved0:24; //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_EXCCNT         0x00000000//0x00C,DWT
struct DWT_EXCCNT_BIT
{
	UINT32 EXCCNT:8;     //00,
	UINT32 Reserved0:24; //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_SLEEPCNT       0x00000000//0x010,DWT
struct DWT_SLEEPCNT_BIT
{
	UINT32 SLEEPCNT:8;   //00,
	UINT32 Reserved0:24; //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_LSUCNT         0x00000000//0x014,WDT
struct DWT_LSUCNT_BIT
{
	UINT32 LSUCNT:8;     //00,
	UINT32 Reserved0:24; //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_FOLDCNT        0x00000000//0x018,DWT
struct DWT_FOLDCNT_BIT
{
	UINT32 FOLDCNT:8;    //00,
	UINT32 Reserved0:24; //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_COMP0          0x00000000//0x020,DWT
#define RSTV_DWT_COMP1          0x00000000//0x030,DWT
#define RSTV_DWT_COMP2          0x00000000//0x040,DWT
#define RSTV_DWT_COMP3          0x00000000//0x050,DWT
#define RSTV_DWT_COMP           0x00000000
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_MASK0          0x00000000//0x024,WDT
#define RSTV_DWT_MASK1          0x00000000//0x034,WDT
#define RSTV_DWT_MASK2          0x00000000//0x044,WDT
#define RSTV_DWT_MASK3          0x00000000//0x054,WDT
#define RSTV_DWT_MASK           0x00000000
struct DWT_MASK_BIT//MASK0,MASK1,MASK2,MASK3
{
	UINT32 MASK:4;       //00,
	UINT32 Reserved0:28; //04,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_FUNC0          0x00000000//0x028,DWT
#define RSTV_DWT_FUNC1          0x00000000//0x038,DWT
#define RSTV_DWT_FUNC2          0x00000000//0x048,DWT
#define RSTV_DWT_FUNC3          0x00000000//0x058,DWT
#define RSTV_DWT_FUNC           0x00000000
struct DWT_FUNC_BIT//FUNC0,FUNC1,FUNC2,FUNC3
{
	UINT32 FUNC:4;       //00,
	UINT32 Reserved0:1;  //04,
	UINT32 EMITRANGE:1;  //05,
	UINT32 Reserved1:1;  //06,
	UINT32 CYCMATCH:1;   //07,
	UINT32 Reserved2:24; //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DWT_PID4           0x00000004//0xFD0,
#define RSTV_DWT_PID5           0x00000000//0xFD4,
#define RSTV_DWT_PID6           0x00000000//0xFD8,
#define RSTV_DWT_PID7           0x00000000//0xFDC,
#define RSTV_DWT_PID0           0x00000002//0xFE0,
#define RSTV_DWT_PID1           0x000000B0//0xFE4,
#define RSTV_DWT_PID2           0x0000000B//0xFE8,
#define RSTV_DWT_PID3           0x00000000//0xFEC,
#define RSTV_DWT_PID            0x00000000
#define RSTV_DWT_CID0           0x0000000D//0xFF0,
#define RSTV_DWT_CID1           0x000000E0//0xFF4,
#define RSTV_DWT_CID2           0x00000005//0xFF8,
#define RSTV_DWT_CID3           0x000000B1//0xFFC,
#define RSTV_DWT_CID            0x00000000
//------------------------------------------------------------------------------------------------------------------------------
struct Struct_DWT_CMF
{
	union{UINT32 COMP;Type_BIT32 COMP_BIT;};//比较
	union{UINT32 MASK;struct DWT_MASK_BIT MASK_BIT;};//屏蔽
	union{UINT32 FUNC;struct DWT_FUNC_BIT FUNC_BIT;};//功能
	UINT32 Reserved0[1];
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define DWT_Struct Struct_DWT
typedef struct Struct_DWT//0xE0001000
{
  union{UINT32 CTRL;struct DWT_CTRL_BIT CTRL_BIT;};//0x000(RW),DWT
  union{UINT32 CYCCNT;Type_BIT32 CYCCNT_BIT;};  //0x004(RW),DWT
  union{UINT32 CPICNT;struct DWT_CPICNT_BIT CPICNT_BIT;};//0x008(RW),DWT
  union{UINT32 EXCCNT;struct DWT_EXCCNT_BIT EXCCNT_BIT;};//0x00C(RW),DWT
  union{UINT32 SLEEPCNT;struct DWT_SLEEPCNT_BIT SLEEPCNT_BIT;};//0x010(RW),DWT
  union{UINT32 LSUCNT;struct DWT_LSUCNT_BIT LSUCNT_BIT;};//0x014(RW),DWT
  union{UINT32 FOLDCNT;struct DWT_FOLDCNT_BIT FOLDCNT_BIT;};//0x018(RW),DWT
	UINT32 Reserved6[1];      //0x01C(R),
  struct Struct_DWT_CMF CMF[4]; //0x020(RW),DWT
	UINT32 Reserved7[988]; //0x060(R),
  union{UINT32 PID4;};//0xFD0(RW),ITM Peripheral Identification Register
  union{UINT32 PID5;};//0xFD4(RW),ITM Peripheral Identification Register
  union{UINT32 PID6;};//0xFD8(RW),ITM Peripheral Identification Register
  union{UINT32 PID7;};//0xFDC(RW),ITM Peripheral Identification Register
  union{UINT32 PID0;};//0xFE0(RW),ITM Peripheral Identification Register
  union{UINT32 PID1;};//0xFE4(RW),ITM Peripheral Identification Register
  union{UINT32 PID2;};//0xFE8(RW),ITM Peripheral Identification Register
  union{UINT32 PID3;};//0xFEC(RW),ITM Peripheral Identification Register
  union{UINT32 CID0;};//0xFF0(RW),ITM Component  Identification Register
  union{UINT32 CID1;};//0xFF4(RW),ITM Component  Identification Register
  union{UINT32 CID2;};//0xFF8(RW),ITM Component  Identification Register
  union{UINT32 CID3;};//0xFFC(RW),ITM Component  Identification Register
} DWT_Type,Type_DWT;                                                
