diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PT_M3DWT                ((volatile Type_DWT *)BASE_DWT)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define DWT_CTRL                DWT.CTRL
#define DWT_CYCCNT              DWT.CYCCNT
#define DWT_CPICNT              DWT.CPICNT
#define DWT_EXCCNT              DWT.EXCCNT
#define DWT_SLEEPCNT            DWT.SLEEPCNT
#define DWT_LSUCNT              DWT.LSUCNT
#define DWT_FOLDCNT             DWT.FOLDCNT
#define DWT_CMF_COMP(i)         DWT.CMF[i].COMP//i=0_3
#define DWT_CMF_MASK(i)         DWT.CMF[i].MASK//i=0_3
#define DWT_CMF_FUNC(i)         DWT.CMF[i].FUNC//i=0_3
#define DWT_PID4                DWT.PID4
#define DWT_PID5                DWT.PID5
#define DWT_PID6                DWT.PID6
#define DWT_PID7                DWT.PID7
#define DWT_PID0                DWT.PID0
#define DWT_PID1                DWT.PID1
#define DWT_PID2                DWT.PID2
#define DWT_PID3                DWT.PID3
#define DWT_CID0                DWT.CID0
#define DWT_CID1                DWT.CID1
#define DWT_CID2                DWT.CID2
#define DWT_CID3                DWT.CID3
//==============================================================================================================================
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define FPB_Struct Struct_FPB
typedef struct Struct_FPB//0xE0002000
{
  union{UINT32 CTRL;};   //0xE0002000(RW),修补控制
	union{UINT32 REMAP;};  //0xE0002004(RW),修补重映射
	union{UINT32 COMP[8];};//0xE0002008(RW),修补比较
	UINT32 Reserved0[1002];//0xE0002028(R),
  union{UINT32 PID4;};//0xE0002FD0(RW),Value=0x04,FP Peripheral Identification Register
  union{UINT32 PID5;};//0xE0002FD4(RW),Value=0x00,FP Peripheral Identification Register
  union{UINT32 PID6;};//0xE0002FD8(RW),Value=0x00,FP Peripheral Identification Register
  union{UINT32 PID7;};//0xE0002FDC(RW),Value=0x00,FP Peripheral Identification Register
  union{UINT32 PID0;};//0xE0002FE0(RW),Value=0x30,FP Peripheral Identification Register
  union{UINT32 PID1;};//0xE0002FE4(RW),Value=0xB0,FP Peripheral Identification Register
  union{UINT32 PID2;};//0xE0002FE8(RW),Value=0x0B,FP Peripheral Identification Register
  union{UINT32 PID3;};//0xE0002FEC(RW),Value=0x00,FP Peripheral Identification Register
  union{UINT32 CID0;};//0xE0002FF0(RW),Value=0x0D,FP Component  Identification Register
  union{UINT32 CID1;};//0xE0002FF4(RW),Value=0xE0,FP Component  Identification Register
  union{UINT32 CID2;};//0xE0002FF8(RW),Value=0x05,FP Component  Identification Register
  union{UINT32 CID3;};//0xE0002FFC(RW),Value=0xB1,FP Component  Identification Register	
} FPB_Type,Type_FPB;  
#define PT_M3FPB                ((volatile Type_FPB *)BASE_FPB)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define FPB_CTRL                M3FPB.CTRL
#define FPB_REMAP               M3FPB.REMAP
#define FPB_COMP(i)             M3FPB.COMP[i]
#define FPB_PID4                M3FPB.PID4
#define FPB_PID5                M3FPB.PID5
#define FPB_PID6                M3FPB.PID6
#define FPB_PID7                M3FPB.PID7
#define FPB_PID0                M3FPB.PID0
#define FPB_PID1                M3FPB.PID1
#define FPB_PID2                M3FPB.PID2
#define FPB_PID3                M3FPB.PID3
#define FPB_CID0                M3FPB.CID0
#define FPB_CID1                M3FPB.CID1
#define FPB_CID2                M3FPB.CID2
#define FPB_CID3                M3FPB.CID3
//==============================================================================================================================
#define RSTV_SYS_ICTR           0x00000000//0x004,Interrupt Controller Type Register Definitions
struct SYS_ICTR_BIT
{
	UINT32 INTLINESNUM:5;//00,
	UINT32 Reserved0:27; //05,
};
#define SYS_ICTR_INTLINESNUM    M3SYS.ICTR_BIT.INTLINESNUM
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_ACTLR          0x00000000//0x008,Auxiliary Control Register Definitions
struct SYS_ACTLR_BIT
{
	UINT32 DISMCYCINT:1; //00,
	UINT32 DISDEFWBUF:1; //01,
	UINT32 DISFOLD:1;    //02,
	UINT32 Reserved0:29; //03,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_STCTRL         0x00000000//0xE000E010
struct SYS_STCTRL_BIT
{
  UINT32 EN:1;         //00,Counter enable:1=enable
  UINT32 TICKINT:1;    //01,interrupt enable,Counting down to 0 pends the SysTick handler:1=enable
  UINT32 CLKSOURCE:1;  //02,Clock source:0=Extenal reference clock,1=core clock
	UINT32 Reserved0:13; //03,
  UINT32 COUNTFLAG:1;  //16,Count Flag
	UINT32 Reserved1:15; //17,
};
#define SYS_STCTRL_ENABLE       M3SYS.STCTRL_BIT.ENABLE
#define SYS_STCTRL_TICKINT      M3SYS.STCTRL_BIT.TICKINT
#define SYS_STCTRL_CLKSOURCE    M3SYS.STCTRL_BIT.CLKSOURCE
#define SYS_STCTRL_COUNTFLAG    M3SYS.STCTRL_BIT.COUNTFLAG
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_STLOAD         0x00000000//0xE000E014
struct SYS_STLOAD_BIT
{
  UINT32 RELOAD:24;    //00,Value to load into the SysTick Current Value Register when the counter reaches 0
	UINT32 Reserved0:8;  //24,
};
#define SYS_STLOAD_RELOAD       M3SYS.STLOAD_BIT.RELOAD
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_STVAL          0x00000000//0xE000E018
struct SYS_STVAL_BIT
{
  UINT32 CURRENT:24;   //00,Current value at the time the register is accessed
	UINT32 Reserved0:8;  //24,
};
#define SYS_STVAL_CURRENT       M3SYS.STVAL_BIT.CURRENT
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_STCALIB        0x00000000//0xE000E01C
struct SYS_STCALIB_BIT
{
  UINT32 TENMS:24;     //00,Reload value to use for 10ms timing
	UINT32 Reserved0:6;  //24,
	UINT32 SKEW:1;       //30,Calibration value is not exactly 10 ms
	UINT32 NOREF:1;      //31,The reference clock is not provided
};
#define SYS_STCALIB_TENMS       M3SYS.STCALIB_BIT.TENMS
#define SYS_STCALIB_SKEW        M3SYS.STCALIB_BIT.SKEW
#define SYS_STCALIB_NOREF       M3SYS.STCALIB_BIT.NOREF
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_ISER           0x00000000//Interrupt set enable bits
#define RSTV_SYS_ICER           0x00000000//Interrupt clear-enable bits
#define RSTV_SYS_ISPR           0x00000000//Interrupt set-pending bits
#define RSTV_SYS_ICPR           0x00000000//Interrupt clear-pending bits
#define RSTV_SYS_IABR           0x00000000//Interrupt active flags
#define RSTV_SYS_IPR            0x00;     //Interrupt Priority Register (8Bit wide)
//------------------------------------------------------------------------------------------------------------------------------
//SCB_Start
#define RSTV_SYS_CPUID           0x410FC230//0xE000ED00,
struct SYS_CPUID_BIT
{
	UINT32 REVISION:4;   //00,Implementation defined revision number
	UINT32 PARTNO:12;    //04,Number of processor within family
	UINT32 Constant:4;   //16,Reads as 0x0F
	UINT32 VARIANT:4;    //20,Implementation defined variant number
	UINT32 IMPLEMENTER:8;//24,Implementer code. ARM is 0x41
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_ICSR            0x00000000//0xE000ED04
struct SYS_ICSR_BIT
{
	UINT32 VECTACTIVE:9;   //00,Active ISR number field
	UINT32 Reserved0:2;    //09,
	UINT32 RETTOBASE:1;    //11,All active exceptions minus the IPSR_current_exception yields the empty set
	UINT32 VECTPENDING:10; //12,Pending ISR number field
	UINT32 ISRPENDING:1;   //22,Interrupt pending flag
	UINT32 ISRPREEMPT:1;   //23,It indicates that a pending interrupt becomes active in the next running cycle
	UINT32 Reserved1:1;    //24,
	UINT32 PENDSTCLR:1;    //25,Clear pending SysTick bit
	UINT32 PENDSTSET:1;    //26,Set pending SysTick bit
	UINT32 PENDSVCLR:1;    //27,Clear pending pendSV bit
	UINT32 PENDSVSET:1;    //28,Set pending pendSV bit
	UINT32 NMIPENDSET:1;   //29,Set pending NMI bit
	UINT32 Reserved2:2;    //30,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_VTOR           0x00000000//0xE000ED08
struct SYS_VTOR_BIT
{
	UINT32 Reserved0:7;    //00,
	UINT32 TBLOFF:22;      //07,Vector table base offset field
	UINT32 TBLBASE:1;      //29,Table base in code(0) or RAM(1)
	UINT32 Reserved1:2;    //30,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_AIRCR          0x00000000//E000ED0C
struct SYS_AIRCR_BIT
{
	UINT32 VECTRESET:1;    //00,System Reset bit
	UINT32 VECTCLRACTIVE:1;//01,Clear active vector bit
	UINT32 SYSRESETREQ:1;  //02,Requests chip control logic to generate a reset
	UINT32 Reserved0:5;    //03,
	UINT32 PRIGROUP:3;     //08,PRIGROUP[2:0] bits (Priority group),0_7=(7-x bits of pre-emption priority, x-3 bit of subpriority)
	UINT32 Reserved1:4;    //11,
	UINT32 ENDIANESS:1;    //15,Data endianness bit
	UINT32 VECTKEY:16;     //16,Register key (VECTKEY) - Reads as 0xFA05 (VECTKEYSTAT)
};

