diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PRIGROUP_0              0x07//0 bits for pre-emption priority,4 bits for subpriority
#define PRIGROUP_1              0x06//1 bits for pre-emption priority,3 bits for subpriority
#define PRIGROUP_2              0x05//2 bits for pre-emption priority,2 bits for subpriority
#define PRIGROUP_3              0x04//3 bits for pre-emption priority,1 bits for subpriority
#define PRIGROUP_4              0x03//4 bits for pre-emption priority,0 bits for subpriority
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_SCR             0x00000000//E000ED10
struct SYS_SCR_BIT
{
	UINT32 Reserved0:1;    //00,
	UINT32 SLEEPONEXIT:1;  //01,Sleep on exit bit
	UINT32 SLEEPDEEP:1;    //02,Sleep deep bit
	UINT32 Reserved1:1;    //03,
	UINT32 SEVONPEND:1;    //04,Wake up from WFE
	UINT32 Reserved2:27;   //05,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_CCR            0x00000000//0xE000ED14
struct SYS_CCR_BIT
{
	UINT32 NONBASETHRDENA:1;    //00,Thread mode can be entered from any level in Handler mode by controlled return value
	UINT32 USERSETMPEND:1; //01,Enables user code to write the Software Trigger Interrupt register to trigger (pend) a Main exception
	UINT32 Reserved0:1;    //02,
	UINT32 UNALIGNTRP:1;   //03,Trap for unaligned access
	UINT32 DIV_0_TRP:1;    //04,Trap on Divide by 0
	UINT32 Reserved1:3;    //05,
	UINT32 BFHFNMIGN:1;    //08,Handlers running at priority -1 and -2
	UINT32 STKALIGN:1;     //09,On exception entry, the SP used prior to the exception is adjusted to be 8-byte aligned
	UINT32 Reserved2:22;   //10,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_SHPR           0x00000000//E000ED18
struct SYS_SHPR_BIT
{
	UINT32 PRI0:8;         //00,Priority of system handler 4,8, and 12. Mem Manage, reserved and Debug Monitor
	UINT32 PRI1:8;         //08,Priority of system handler 5,9, and 13. Bus Fault, reserved and reserved 
	UINT32 PRI2:8;         //16,Priority of system handler 6,10, and 14. Usage Fault, reserved and PendSV
	UINT32 PRI3:8;         //24,Priority of system handler 7,11, and 15. Reserved, SVCall and SysTick

};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_SHCSR          0x00000000//0xE000ED24
struct SYS_SHCSR_BIT
{
	UINT32 MEMFAULTACT:1;  //00,MemManage is active
	UINT32 BUSFAULTACT:1;  //01,BusFault is active
	UINT32 Reserved0:1;    //02,
	UINT32 USGFAULTACT:1;  //03,UsageFault is active
	UINT32 Reserved1:3;    //04,
	UINT32 SVCALLACT:1;    //07,SVCall is active
  UINT32 MONITORACT:1;   //08,Monitor is active
	UINT32 Reserved2:1;    //09,	
	UINT32 PENDSVACT:1;    //10,PendSV is active
	UINT32 SYSTICKACT:1;   //11,SysTick is active
	UINT32 USGFAULTPENDED:1;//12,Usage Fault is pended
	UINT32 MEMFAULTPENDED:1;//13,MemManage is pended
	UINT32 BUSFAULTPENDED:1;//14,Bus Fault is pended
	UINT32 SVCALLPENDED:1;  //15,SVCall is pended
	UINT32 MEMFAULTENA:1;   //16,MemManage enable
	UINT32 BUSFAULTENA:1;   //17,Bus Fault enable
	UINT32 USGFAULTENA:1;   //18,UsageFault enable
	UINT32 Reserved3:13;    //19,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_CFSR           0x00000000//0xE000ED28
struct SYS_CFSR_BIT
{
	UINT32 IACCVIOL:1;   //00,Instruction access violation
	UINT32 DACCVIOL:1;   //01,Data access violation
	UINT32 Reserved0:1;  //02,
	UINT32 MUNSTKERR:1;  //03,Unstacking error
	UINT32 MSTKERR:1;    //04,Stacking error
	UINT32 Reserved1:2;  //05,
  UINT32 MMARVALID:1;  //07,Memory Manage Address Register address valid flag
	UINT32 IBUSERR:1;    //08,Instruction bus error flag
	UINT32 PRECISERR:1;  //09,Precise data bus error
	UINT32 IMPRECISERR:1;//10,Imprecise data bus error
	UINT32 UNSTKERR:1;   //11,Unstacking error
	UINT32 STKERR:1;     //12,Stacking error
	UINT32 Reserved2:2;  //13,
	UINT32 BFARVALID:1;  //15,Bus Fault Address Register address valid flag
	UINT32 UNDEFINSTR:1; //16,The processor attempt to execute an undefined instruction
	UINT32 INVSTATE:1;   //17,Invalid combination of EPSR and instruction
	UINT32 INVPC:1;      //18,Attempt to load EXC_RETURN into pc illegally
	UINT32 NOCP:1;       //19,Attempt to use a coprocessor instruction
	UINT32 Reserved3:4;  //20,
	UINT32 UNALIGNED:1;  //24,Fault occurs when there is an attempt to make an unaligned memory access
	UINT32 DIVBYZERO:1;  //25,Fault occurs when SDIV or DIV instruction is used with a divisor of 0
	UINT32 Reserved4:6;  //26;
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_HFSR           0x00000000//0xE000ED2C
struct SYS_HFSR_BIT
{
	UINT32 Reserved0:1;  //00,
	UINT32 VECTTBL:1;    //01,Fault occurs because of vector table read on exception processing
	UINT32 Reserved1:28; //02,
	UINT32 FORCED:1;     //30,Hard Fault activated when a configurable Fault was received and cannot activate
	UINT32 DEBUGEVT:1;   //31,Fault related to debug
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_DFSR           0x00000000//0xE000ED30
struct SYS_DFSR_BIT
{
	UINT32 HALTED:1;     //00,Halt request flag
	UINT32 BKPT:1;       //01,BKPT flag
	UINT32 DWTTRAP:1;    //02,Data Watchpoint and Trace (DWT) flag
	UINT32 VCATCH:1;     //03,Vector catch flag
	UINT32 EXTERNAL:1;   //04,External debug request flag
	UINT32 Reserved0:27; //05,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_MMFAR          0x00000000//0xE000ED34,Mem Manage fault address field
#define RSTV_SYS_BFAR           0x00000000//0xE000ED38,Bus fault address field
#define RSTV_SYS_AFSR           0x00000000//0xE000ED3C,Auxiliary Fault Status Register
#define RSTV_SYS_PFR            0x00000000//0xE000ED40,Processor Feature Register
#define RSTV_SYS_DFR            0x00000000//0xE000ED48,Debug Feature Register
#define RSTV_SYS_AFR            0x00000000//0xE000ED4C,Auxiliary Feature Register
#define RSTV_SYS_MMFR           0x00000000//0xE000ED50,Memory Model Feature Register
#define RSTV_SYS_ISAR           0x00000000//0xE000ED60,ISA Feature Register
//------------------------------------------------------------------------------------------------------------------------------
//MPU_Start
#define RSTV_SYS_TYPE           0x00000000//0xE000ED90,MPU Type Register
struct SYS_TYPE_BIT
{
	UINT32 SEPARATE:1;   //00,This is always 0 because the MPU is always unified
	UINT32 Reserved0:7;  //01,
	UINT32 DREGION:8;    //08,Number of regions supported by this MPU
	UINT32 IREGION:8;    //16,Number Instruction region; because ARM v7-M architecture uses a unifi ed MPU, this is always 0
	UINT32 Reserved1:8;  //24,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_CTRL           0x00000000//0xE000ED94,MPU Control Register
struct SYS_CTRL_BIT
{
	UINT32 EN:1;         //00,Enable the MPU if set to 1:1=Enable
	UINT32 HFNMIENA:1;   //01,If set to 1, enable MPU during hard fault handler and NMI handler; otherwise, the MPU is not enabled for the hard fault handler and NMI
	UINT32 PRIVDEFENA:1; //02,Privileged default memory map enable
	UINT32 Reserved1:29; //03,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_RNR            0x00000000//0xE000ED98,MPU Region Number Register
struct SYS_RNR_BIT
{
	UINT32 REGION:8;     //00,
	UINT32 Reserved1:24; //08,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_RBAR           0x00000000//0x00C,MPU Region Base Address Register
struct SYS_RBAR_BIT
{
	UINT32 REGION:4;     //00,
	UINT32 VALID:1;      //04,
	UINT32 ADDR:27;      //05,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_RASR           0x00000000//0x010,MPU Region Attribute and Size Register
struct SYS_RASR_BIT
{
	UINT32 ENA:1;        //00,Region enable bit
	UINT32 SIZE:5;       //01,Region Size Field
	UINT32 Reserved0:2;  //06,
	UINT32 SRD:8;        //08,Sub-Region Disable
	UINT32 B:1;          //16,Bufferable
	UINT32 C:1;          //17,Cacheable
	UINT32 S:1;          //18,Shareable
	UINT32 TEX:3;        //19,
	UINT32 Reserved1:2;  //22,
	UINT32 AP:3;         //24,
	UINT32 Reserved2:1;  //27,
	UINT32 XN:1;         //28,
	UINT32 Reserved3:3;  //29,
};
//MPU_END
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_DHCSR          0x00000000//0xe000edf0,Debug Halting Control and Status Register
struct SYS_DHCSR_BIT
{
	UINT32 C_DEBUGEN:1;  //00,
	UINT32 C_HALT:1;     //01,
	UINT32 C_STEP:1;     //02,
	UINT32 C_MASKINTS:1; //03,
	UINT32 Reserved0:1;  //04,
	UINT32 C_SNAPSTALL:1;//05,
	UINT32 Reserved1:10; //06,
	UINT32 S_REGRDY:1;   //16,
	UINT32 S_HALT:1;     //17,
	UINT32 S_SLEEP:1;    //18,
	UINT32 S_LOCKUP:1;   //19,
	UINT32 Reserved2:4;  //20,
	UINT32 S_RETIRE_ST:1;//24,
	UINT32 S_RESET_ST:1; //25,
	UINT32 DBGKEY:6;     //26,<LDY>
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_DCRSR          0x00000000//0x004,Debug Core Register Selector Register
struct SYS_DCRSR_BIT
{
	UINT32 REGSEL:5;     //00,
	UINT32 Reserved0:11; //05,
	UINT32 REGWNR:1;     //16,
	UINT32 Reserved1:15; //17,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_DEMCR          0x00000000//0x00C,Debug Exception and Monitor Control Register
struct SYS_DEMCR_BIT
{
	UINT32 VC_CORERST:1; //00,VC_CORERESET
	UINT32 Reserved0:3;  //01,
	UINT32 VC_MMERR:1;   //04,
	UINT32 VC_NOCPERR:1; //05,
	UINT32 VC_CHKERR:1;  //06,
	UINT32 VC_STATERR:1; //07,
	UINT32 VC_BUSERR:1;  //08,
	UINT32 VC_INTERR:1;  //09,
	UINT32 VC_HARDERR:1; //10,
	UINT32 Reserved1:5;  //11,
	UINT32 MON_EN:1;     //16,
	UINT32 MON_PEND:1;   //17,
	UINT32 MON_STEP:1;   //18,
	UINT32 MON_REQ:1;    //19,
	UINT32 Reserved2:4;  //20,
	UINT32 TRCENA:1;     //24,
	UINT32 Reserved3:7;  //25,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_SYS_STIR           0x00000000//0xE000EF00,Software Trigger Interrupt Register
struct SYS_STIR_BIT
{
	UINT32 INTID:9;      //00,Halt request flag
	UINT32 Reserved0:23; //09,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  
#define SYS_Struct Struct_SYS
typedef struct Struct_SYS//0xE000E000
{
  //SYS_Start,SCS_Start
  UINT32 Reserved0[1];//0xE000E000,
  union{UINT32 ICTR;struct SYS_ICTR_BIT ICTR_BIT;};      //0xE000E004(R),Interrupt Control Type Register
  union{UINT32 ACTLR;struct SYS_ACTLR_BIT ACTLR_BIT;};   //0xE000E008(RW),Auxiliary Control Register ,for __CM3_REV >= 0x200
	UINT32 Reserved1[1];//0xE000E00C,
  //Systick_Start,SCS_End
  union{UINT32 STCTRL;struct SYS_STCTRL_BIT STCTRL_BIT;};   //0xE000E010(RW),SysTick Control and Status Register
  union{UINT32 STLOAD;struct SYS_STLOAD_BIT STLOAD_BIT;};   //0xE000E014(RW),SysTick Reload Value Register
  union{UINT32 STVAL;struct SYS_STVAL_BIT STVAL_BIT;};      //0xE000E018(RW),SysTick Current Value Register
  union{UINT32 STCALIB;struct SYS_STCALIB_BIT STCALIB_BIT;};//0xE000E01C(R),SysTick Calibration Register
	//Systick_End
	UINT32 Reserved2[0x38];//0xE000E020(R),
  //Interrupt_Start
  union{UINT32 ISER[8];Type_BIT32 ISER_BIT[8];};    //0xE000E100,  Interrupt Set Enable Register
  UINT32 Reserved3[24];//0xE000E120(R),                                   
  union{UINT32 ICER[8];Type_BIT32 ICER_BIT[8];};    //0xE000E180,  Interrupt Clear Enable Register
  UINT32 Reserved4[24];//0xE000E1A0(R),                                    
  union{UINT32 ISPR[8];Type_BIT32 ISPR_BIT[8];};    //0xE000E200,  Interrupt Set Pending Register
  UINT32 Reserved5[24];//0xE000E220(R),                                   
  union{UINT32 ICPR[8];Type_BIT32 ICPR_BIT[8];};    //0xE000E280,  Interrupt Clear Pending Register
  UINT32 Reserved6[24];//0xE000E2A0(R),                                   
  union{UINT32 IABR[8];Type_BIT32 IABR_BIT[8];};   //0xE000E300,  Interrupt Active bit Register
  UINT32 Reserved7[56];//0xE000E320(R),                                   
  union{UINT8 IPR[240];};//0xE000E400,  Interrupt Priority Register (8Bit wide)
  UINT32 Reserved8[516];
	//SCB_Start,Interrupt_End
  union{UINT32 CPUID;struct SYS_CPUID_BIT CPUID_BIT;};//0xE000ED00(R),CPU ID Base Register
  union{UINT32 ICSR;struct SYS_ICSR_BIT ICSR_BIT;};   //0xE000ED04(RW),Interrupt Control State Register
  union{UINT32 VTOR;struct SYS_VTOR_BIT VTOR_BIT;};   //0xE000ED08(RW),Vector Table Offset Register
  union{UINT32 AIRCR;struct SYS_AIRCR_BIT AIRCR_BIT;};//0xE000ED0C(RW),Application Interrupt / Reset Control Register
  union{UINT32 SCR;struct SYS_SCR_BIT SCR_BIT;};      //0xE000ED10(RW),System Control Register
  union{UINT32 CCR;struct SYS_CCR_BIT CCR_BIT;};      //0xE000ED14(RW),Configuration Control Register
  union{UINT8  SHPR[12];};                            //0xE000ED18(RW),System Handlers Priority Registers (4-7, 8-11, 12-15)
  union{UINT32 SHCSR;struct SYS_SHCSR_BIT SHCSR_BIT;};//0xE000ED24(RW),System Handler Control and State Register
  union{UINT32 CFSR;struct SYS_CFSR_BIT CFSR_BIT;};   //0xE000ED28(RW),Configurable Fault Status Register
  union{UINT32 HFSR;struct SYS_HFSR_BIT HFSR_BIT;};   //0xE000ED2C(RW),Hard Fault Status Register
  union{UINT32 DFSR;struct SYS_DFSR_BIT DFSR_BIT;};   //0xE000ED30(RW),Debug Fault Status Register
  union{UINT32 MMFAR;};  //0xE000ED34(R),Mem Manage Address Register
  union{UINT32 BFAR;};   //0xE000ED38(R),Bus Fault Address Register
  union{UINT32 AFSR;};   //0xE000ED3C(RW),Auxiliary Fault Status Register
  union{UINT32 PFR[2];}; //0xE000ED40(R),Processor Feature Register
  union{UINT32 DFR;};    //0xE000ED48(R),Debug Feature Register
  union{UINT32 AFR;};    //0xE000ED4C(R),Auxiliary Feature Register
  union{UINT32 MMFR[4];};//0xE000ED50(R),Memory Model Feature Register
  union{UINT32 ISAR[5];};//0xE000ED60(R),ISA Feature Register
	UINT32 Reserved9[7];   //0xE000ED74,
  //MPU_Start,only for IsDensity(XL)
  union{UINT32 TYPE;struct SYS_TYPE_BIT TYPE_BIT;};   //0xE000ED90(R), MPU Type Register
  union{UINT32 CTRL;struct SYS_CTRL_BIT CTRL_BIT;};   //0xE000ED94(RW), MPU Control Register
  union{UINT32 RNR;struct SYS_RNR_BIT RNR_BIT;};      //0xE000ED98(RW), MPU Region RNRber Register 
  union{UINT32 RBAR;struct SYS_RBAR_BIT RBAR_BIT;};   //0xE000ED9C(RW), MPU Region Base Address Register
  union{UINT32 RASR;struct SYS_RASR_BIT RASR_BIT;};   //0xE000EDA0(RW), MPU Region Attribute and Size Register
  union{UINT32 RBARA1;};//0xE000EDA4(RW), MPU Alias 1 Region Base Address Register
  union{UINT32 RASRA1;};//0xE000EDA8(RW), MPU Alias 1 Region Attribute and Size Register
  union{UINT32 RBARA2;};//0xE000EDAC(RW), MPU Alias 2 Region Base Address Register
  union{UINT32 RASRA2;};//0xE000EDB0(RW), MPU Alias 2 Region Attribute and Size Register
  union{UINT32 RBARA3;};//0xE000EDB4(RW), MPU Alias 3 Region Base Address Register
  union{UINT32 RASRA3;};//0xE000EDB8(RW), MPU Alias 3 Region Attribute and Size Register
  //MPU_END	
	UINT32 Reserved10[13];  //0xE000EDBC
	//CDB_Start
  union{UINT32 DHCSR;struct SYS_DHCSR_BIT DHCSR_BIT;}; //0xE000EDF0(RW),Debug Halting Control and Status Register
  union{UINT32 DCRSR;struct SYS_DCRSR_BIT DCRSR_BIT;}; //0xE000EDF4(W),Debug Core Register Selector Register
  union{UINT32 DCRDR;Type_BIT32 DCRDR_BIT;};           //0xE000EDF8(RW),Debug Core Register Data Register
  union{UINT32 DEMCR;struct SYS_DEMCR_BIT DEMCR_BIT;}; //0xE000EDFC(RW),Debug Exception and Monitor Control Register
	//CDB_End
	union{UINT32 SOFTTRIG;Type_BIT32 SOFTTRIG_BIT;};//0xE000EE00(RW),Soft trig interrupt
	UINT32 Reserved11[51];  //0xE000EE04(R),
  union{UINT32 PERIPHID4;};//0xE000EED0(RW),外设识别
  union{UINT32 PERIPHID5;};//0xE000EED4(RW),外设识别	
  union{UINT32 PERIPHID6;};//0xE000EED8(RW),外设识别	
  union{UINT32 PERIPHID7;};//0xE000EEDC(RW),外设识别	
  union{UINT32 PERIPHID0;};//0xE000EEE0(RW),外设识别位7:0
  union{UINT32 PERIPHID1;};//0xE000EEE4(RW),外设识别位15:8
  union{UINT32 PERIPHID2;};//0xE000EEE8(RW),外设识别位23:16	
  union{UINT32 PERIPHID3;};//0xE000EEEC(RW),外设识别位31:24
  union{UINT32 PCELLID0;}; //0xE000EEF0(RW),元件识别位7:0
  union{UINT32 PCELLID1;}; //0xE000EEF4(RW),元件识别位15:8
  union{UINT32 PCELLID2;}; //0xE000EEF8(RW),元件识别位23:16
  union{UINT32 PCELLID3;}; //0xE000EEFC(RW),元件识别位31:24
  //SCB_END	
  union{UINT32 STIR;struct SYS_STIR_BIT STIR_BIT;};//0xE000EF00(RW),  Software Trigger Interrupt Register
  UINT32 Reserved12[63];//0xE000EF04(R),
} SYS_Type,Type_SYS; 
