diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define PT_M3SYS                ((volatile Type_SYS *)BASE_SYS)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  
#define SYS_ICTR                M3SYS.ICTR
#define SYS_ACTLR               M3SYS.ACTLR
#define SYS_STCTRL              M3SYS.STCTRL
#define SYS_STLOAD              M3SYS.STLOAD
#define SYS_STVAL               M3SYS.STVAL
#define SYS_STCALIB             M3SYS.STCALIB

#define SYS_ISER(i)             M3SYS.ISER[i]//i=0_7
#define SYS_ICER(i)             M3SYS.ICER[i]//i=0_7
#define SYS_ISPR(i)             M3SYS.ISPR[i]//i=0_7
#define SYS_ICPR(i)             M3SYS.ICPR[i]//i=0_7
#define SYS_IABR(i)             M3SYS.IABR[i]//i=0_7
#define SYS_IP(i)               M3SYS.IPR[i] //i=0_239
//SCB_Start
#define SYS_CPUID               M3SYS.CPUID
#define SYS_ICSR                M3SYS.ICSR
#define SYS_VTOR                M3SYS.VTOR
#define SYS_AIRCR               M3SYS.AIRCR
#define SYS_SCR                 M3SYS.SCR
#define SYS_CCR                 M3SYS.CCR
#define SYS_SHPR(i)             M3SYS.SHPR[i]//i=0_11
#define SYS_SHCSR               M3SYS.SHCSR
#define SYS_CFSR                M3SYS.CFSR
#define SYS_HFSR                M3SYS.HFSR
#define SYS_DFSR                M3SYS.DFSR
#define SYS_MMFAR               M3SYS.MMFAR
#define SYS_BFAR                M3SYS.BFAR
#define SYS_AFSR                M3SYS.AFSR
#define SYS_PFR(i)              M3SYS.PFR[i]//i=0_2
#define SYS_DFR                 M3SYS.DFR
#define SYS_AFR                 M3SYS.AFR
#define SYS_MMFR(i)             M3SYS.MMFR[i]//i=0_3
#define SYS_ISAR(i)             M3SYS.ISAR[i]//i=0_4
//MPU_Start
#define SYS_TYPE                M3SYS.TYPE
#define SYS_CTRL                M3SYS.CTRL
#define SYS_RNR                 M3SYS.RNR
#define SYS_RBAR                M3SYS.RBAR
#define SYS_RASR                M3SYS.RASR
#define SYS_RBARA1              M3SYS.RBARA1
#define SYS_RASRA1              M3SYS.RASRA1
#define SYS_RBARA2              M3SYS.RBARA2
#define SYS_RASRA2              M3SYS.RASRA2
#define SYS_RBARA3              M3SYS.RBARA3
#define SYS_RASRA3              M3SYS.RASRA3
//MPU_END	
//CDB_Start
#define SYS_DHCSR               M3SYS.DHCSR
#define SYS_DCRSR               M3SYS.DCRSR
#define SYS_DCRDR               M3SYS.DCRDR
#define SYS_DEMCR               M3SYS.DEMCR
//CDB_End
#define SYS_SOFTTRIG            M3SYS.SOFTTRIG
#define SYS_PERIPHID4           M3SYS.PERIPHID4
#define SYS_PERIPHID5           M3SYS.PERIPHID5
#define SYS_PERIPHID6           M3SYS.PERIPHID6
#define SYS_PERIPHID7           M3SYS.PERIPHID7
#define SYS_PERIPHID0           M3SYS.PERIPHID0
#define SYS_PERIPHID1           M3SYS.PERIPHID1
#define SYS_PERIPHID2           M3SYS.PERIPHID2
#define SYS_PERIPHID3           M3SYS.PERIPHID3
#define SYS_PCELLID0            M3SYS.PCELLID0
#define SYS_PCELLID1            M3SYS.PCELLID1
#define SYS_PCELLID2            M3SYS.PCELLID2
#define SYS_PCELLID3            M3SYS.PCELLID3
#define SYS_STIR                M3SYS.STIR
//==============================================================================================================================
struct TPI_PROTOCAL_BIT
{
  UINT32 PRO:2;           //00,：0=跟踪端口模式,1=串行写输出（曼彻斯特）,它为复位值 2=串行写输出（NRZ）,3=保留 
  UINT32 Reserved0:30;  //02,
};
//------------------------------------------------------------------------------------------------------------------------------
struct TPI_STATE_BIT
{
  UINT32 FIInProg:1;    //00,读取该位时总是为 0 
  UINT32 FtStopped:1;   //01,读取该位时总是为 0 
  UINT32 TCPresent:1;   //02,读取该位时总是为 0 
  UINT32 FtNonStop:1;   //03,格式器不能停止 
  UINT32 Reserved0:28;  //04  
};
//------------------------------------------------------------------------------------------------------------------------------
struct TPI_ITATBCTR2_BIT
{
  UINT32 ATREADY:1;     //00,该位读取或设置 ATREADYS1 和 ATREADYS2 的值 
  UINT32 Reserved0:31;  //01,
};
//------------------------------------------------------------------------------------------------------------------------------
struct TPI_ITATBCTR0_BIT
{
  UINT32 ATVALID:1;     //00,该位读取或设置 ATVALIDS1 和 ATVALIDS2 的值 
  UINT32 Reserved0:31;  //01,
};
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  
#define TPI_Struct Struct_TPI
typedef struct Struct_TPI//0xE0040000
{
	union{UINT32 CLASS;Type_UINT32_BIT4 CLASS_BIT;};          //0xE0040000(R),支持端口类型
	union{UINT32 NUM;Type_UINT32_BIT4 NUM_BIT;};              //0xE0040004(RW),当前端口类型,(NUM=1,2,4,8)
	UINT32 Reserved0[2];   //0xE0040008(R),
	union{UINT32 PRESCALER;Type_UINT32_BIT13 PRESCALER_BIT;}; //0xE0040010(RW),当前端口输出速度
	UINT32 Reserved1[55];  //0xE0040014(R),
	union{UINT32 PROTOCAL;struct TPI_PROTOCAL_BIT PROTOCAL_BIT;};    //0xE00400F0(RW),所选管脚
	UINT32 Reserved2[131]; //0xE00400F4(R),
	union{UINT32 STATE;struct TPI_STATE_BIT STATE_BIT;};  //0xE0040300(RW),所选管脚
	union{UINT32 CTRL;};   //0xE0040304(R),所选管脚
	union{UINT32 CNT;};    //0xE0040308(R),所选管脚
	UINT32 Reserved3[761];    //0xE004030C(R),
	union{UINT32 ITATBCTR2;struct TPI_ITATBCTR2_BIT ITATBCTR2_BIT;}; //0xE0040EF0(R),综合寄存器
	UINT32 Reserved4[1];      //0xE0040EF4(R),
	union{UINT32 ITATBCTR0;struct TPI_ITATBCTR0_BIT ITATBCTR0_BIT;}; //0xE0040EF8(R),综合寄存器
	UINT32 Reserved5[65];     //0xE0040EFC(R),
} TPI_Type,Type_TPI;
#define PT_M3TPI                ((volatile Type_TPI *)BASE_TPI)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  
#define TPI_CLASS               M3TPI.CLASS
#define TPI_NUM                 M3TPI.NUM
#define TPI_SP                  M3TPI.SP
#define TPI_PIN                 M3TPI.PIN
#define TPI_STATE               M3TPI.STATE
#define TPI_CTRL                M3TPI.CTRL
#define TPI_CNT                 M3TPI.CNT
#define TPI_ITATBCTR2           M3TPI.ITATBCTR2
#define TPI_ITATBCTR0           M3TPI.ITATBCTR0
#define TPI_CNT                 M3TPI.CNT
#define TPI_CNT                 M3TPI.CNT
//==============================================================================================================================
#define RSTV_ETM_CTRL           0x00002411
struct ETM_CTRL_BIT
{
  UINT32 P1:1;          //00,
  UINT32 Reserved0:3;   //01,
  UINT32 P2:8;          //04,
  UINT32 Reserved1:1;   //12,
  UINT32 P3:1;          //13,
  UINT32 Reserved2:2;   //14,
  UINT32 P4:2;          //16,
  UINT32 Reserved3:3;   //18,
  UINT32 P5:1;          //21,
  UINT32 Reserved4:10;  //22,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_ETM_CODE           0x8C800000 
struct ETM_CODE_BIT
{
  UINT32 Reserved0:17;  //00,
  UINT32 MAXEXTIN:2;    //17,
  UINT32 Reserved1:1;   //19,
  UINT32 P1:3;          //20,固定为 0
  UINT32 Reserved2:9;   //23,
};
//------------------------------------------------------------------------------------------------------------------------------

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  
#define ETM_Struct Struct_ETM
typedef struct Struct_ETM//0xE0041000
{
	union{UINT32 CTRL;struct ETM_CTRL_BIT CTRL_BIT;};  //0xE0041000,控制
	union{UINT32 CODE;struct ETM_CODE_BIT CODE_BIT;};  //0xE0041004,可配置代码
	union{UINT32 EVENT;}; //0xE0041008,触发事件
	union{UINT32 ASIC;};  //0xE004100C,当前端口输出速度
	union{UINT32 STAT;};  //0xE0041010,状态
	union{UINT32 SYS;};   //0xE0041014,系统配置
	union{UINT32 TEN[2];};//0xE0041018,跟踪使能
	union{UINT32 TEVENT;};//0xE0041020,跟踪事件
	union{UINT32 TCTRL;}; //0xE0041024,跟踪控制
	union{UINT32 FIFOAREA;}; //0xE0041028,FIFOFULL区域
	union{UINT32 FIFOGRADE;};//0xE004102C,FIFOFULL级别
	union{UINT32 DATA[4];};  //0xE0041030,数据
	union{UINT32 ADDR[64];}; //0xE0041040,地址比较器
	union{UINT32 CNT[16];};  //0xE0041140,计数器
	union{UINT32 SEQ[8];};   //0xE0041180,定序器
	union{UINT32 EXTOUT[4];};//0xE00411A0,外部输出
	union{UINT32 CID[4];};//0xE00411B0,CID比较器
	union{UINT32 SPD[8];};//0xE00411C0,特定实现
	union{UINT32 FRQ;};   //0xE00411E0,同步频率
	union{UINT32 ID;};    //0xE00411E4,ETM ID
	union{UINT32 EXCODE;};//0xE00411E8,配置代码扩展
	union{UINT32 EXIN;};  //0xE00411EC,外部输入
	union{UINT32 ICEBE;}; //0xE00411F0,ICE启停
	union{UINT32 ICEACT;};//0xE00411F4,ICE行为控制
	UINT32 Reserved0[2];  //0xE00411F8,
	union{UINT32 CSID;};       //0xE0041200,Core Sight跟踪ID
	UINT32 Reserved1[64];      //0xE0041204,
	union{UINT32 OSRW[2];};    //0xE0041304,OS保存与恢复(0xE0041304-0xE0041308)
	UINT32 Reserved2[757];     //0xE004130C,
	union{UINT32 ITMISCIN;};   //0xE0041EE0,
	UINT32 Reserved3[3];       //0xE0041EE4,
	union{UINT32 ITATBCTR2;};  //0xE0041EF0,
	UINT32 Reserved4[1];       //0xE0041EF4,
	union{UINT32 ITATBCTR0;};  //0xE0041EF8,
	UINT32 Reserved5[1];       //0xE0041EFC,
	union{UINT32 MODECTRL;};   //0xE0041F00,综合模式控制
	UINT32 Reserved6[39];      //0xE0041F04,
	union{UINT32 TAG[2];};     //0xE0041FA0,申明标签(0xE0041FA0-0xE0041FA4)
	UINT32 Reserved7[2];       //0xE0041FA8,
	union{UINT32 LOCK[2];};    //0xE0041FB0,锁定访问(0xE0041FB0-0xE0041FB4)
	union{UINT32 DEVICESTATE;};//0xE0041FB8,鉴别状态
	UINT32 Reserved8[4];       //0xE0041FBC,
	union{UINT32 DEVICETYPE;}; //0xE0041FCC,设备类型
  union{UINT32 PID4;};       //0xE0041FD0,外设ID
  union{UINT32 PID5;};       //0xE0041FD4,外设ID
  union{UINT32 PID6;};       //0xE0041FD8,外设ID
  union{UINT32 PID7;};       //0xE0041FDC,外设ID
  union{UINT32 PID0;};       //0xE0041FE0,外设ID
  union{UINT32 PID1;};       //0xE0041FE4,外设ID
  union{UINT32 PID2;};       //0xE0041FE8,外设ID
  union{UINT32 PID3;};       //0xE0041FEC,外设ID
  union{UINT32 GID0;};       //0xE0041FF0,组件ID
  union{UINT32 GID1;};       //0xE0041FF4,组件ID
  union{UINT32 GID2;};       //0xE0041FF8,组件ID
  union{UINT32 GID3;};       //0xE0041FFC,组件ID
} ETM_Type,Type_ETM;
#define PT_M3ETM                ((volatile Type_ETM *)BASE_ETM)
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  
#define ETM_CTRL                M3ETM.CTRL
#define ETM_CODE                M3ETM.CODE
#define ETM_EVENT               M3ETM.EVENT
#define ETM_ASIC                M3ETM.ASIC
#define ETM_STAT                M3ETM.STAT
#define ETM_SYS                 M3ETM.SYS
#define ETM_TEN(i)              M3ETM.TEN[i]//i=0_1
#define ETM_TEVENT              M3ETM.TEVENT
#define ETM_TCTRL               M3ETM.TCTRL
#define ETM_FIFOAREA            M3ETM.FIFOAREA
#define ETM_FIFOGRADE           M3ETM.FIFOGRADE
#define ETM_DATA(i)             M3ETM.DATA[i]//i=0_3
#define ETM_ADDR(i)             M3ETM.ADDR[i]//i=0_63
#define ETM_CNT(i)              M3ETM.CNT[i]//i=0_15
#define ETM_SEQ(i)              M3ETM.SEQ[i]//i=0_7
#define ETM_EXTOUT(i)           M3ETM.EXTOUT[i]//i=0_3
#define ETM_CID(i)              M3ETM.CID[i]//i=0_3
#define ETM_SPD(i)              M3ETM.SPD[i]//i=0_7
#define ETM_FRQ                 M3ETM.FRQ
#define ETM_ID                  M3ETM.ID
#define ETM_EXCODE              M3ETM.EXCODE
#define ETM_EXIN                M3ETM.EXIN
#define ETM_ICEBE               M3ETM.ICEBE
#define ETM_ICEACT              M3ETM.ICEACT
#define ETM_CSID                M3ETM.CSID
#define ETM_OSRW(i)             M3ETM.OSRW[i]//i=0_1
#define ETM_ITMISCIN            M3ETM.ITMISCIN
#define ETM_ITATBCTR2           M3ETM.ITATBCTR2
#define ETM_ITATBCTR0           M3ETM.ITATBCTR0
#define ETM_MODECTRL            M3ETM.MODECTRL
#define ETM_TAG(i)              M3ETM.TAG[i]
#define ETM_LOCK(i)             M3ETM.LOCK[i]
#define ETM_DEVICESTATE         M3ETM.DEVICESTATE
#define ETM_DEVICETYPE          M3ETM.DEVICETYPE
#define ETM_PID4                M3ETM.PID4
#define ETM_PID5                M3ETM.PID5
#define ETM_PID6                M3ETM.PID6
#define ETM_PID7                M3ETM.PID7
#define ETM_PID0                M3ETM.PID0
#define ETM_PID1                M3ETM.PID1
#define ETM_PID2                M3ETM.PID2
#define ETM_PID3                M3ETM.PID3
#define ETM_GID0                M3ETM.GID0
#define ETM_GID1                M3ETM.GID1
#define ETM_GID2                M3ETM.GID2
#define ETM_GID3                M3ETM.GID3
//==============================================================================================================================
#define RSTV_DBG_ID             0x00000000//0x000
struct DBG_ID_BIT
{
	UINT32 DEVID:12;      //00,Device Identifier
	UINT32 Reserved0:4;   //12,
	UINT32 REVID:16;      //16,
};
//------------------------------------------------------------------------------------------------------------------------------
#define RSTV_DBG_CR             0x00000000//0x004
struct DBG_CR_BIT
{
	UINT32 DBG_SLEEP:1;   //00,Debug Sleep Mode
	UINT32 DBG_STOP:1;    //01,Debug Stop Mode
	UINT32 DBG_STANDBY:1; //02,Debug Standby mode
	UINT32 Reserved0:2;   //03,
	UINT32 TRACE_IOEN:1;  //05,Trace Pin Assignment Control
	UINT32 MODE:2;        //06,TRACE_MODE[1:0] bits (Trace Pin Assignment Control)
	UINT32 IWDG_STOP:1;   //08,Debug Independent Watchdog stopped when Core is halted
	UINT32 WWDG_STOP:1;   //09,Debug Window Watchdog stopped when Core is halted
	UINT32 TIM1_STOP:1;   //10,TIM1 counter stopped when core is halted
	UINT32 TIM2_STOP:1;   //11,TIM1 counter stopped when core is halted
	UINT32 TIM3_STOP:1;   //12,TIM1 counter stopped when core is halted
	UINT32 TIM4_STOP:1;   //13,TIM1 counter stopped when core is halted
	UINT32 CAN1_STOP:1;   //14,Debug CAN1 stopped when Core is halted
	UINT32 I2C1_SMBUS_TIMEOUT:1; //15,SMBUS timeout mode stopped when Core is halted
	UINT32 I2C2_SMBUS_TIMEOUT:1; //16,SMBUS timeout mode stopped when Core is halted
	UINT32 TIM8_STOP:1;   //17,TIM8 counter stopped when core is halted
	UINT32 TIM5_STOP:1;   //18,TIM5 counter stopped when core is halted
	UINT32 TIM6_STOP:1;   //19,TIM6 counter stopped when core is halted
	UINT32 TIM7_STOP:1;   //20,TIM7 counter stopped when core is halted
	UINT32 CAN2_STOP:1;   //21,Debug CAN2 stopped when Core is halted
	UINT32 TIM15_STOP:1;  //22,Debug TIM15 stopped when Core is halted,<LDY>
	UINT32 TIM16_STOP:1;  //23,Debug TIM16 stopped when Core is halted,<LDY>
	UINT32 TIM17_STOP:1;  //24,Debug TIM17 stopped when Core is halted,<LDY>
	UINT32 TIM12_STOP:1;  //25,Debug TIM12 stopped when Core is halted,<LDY>
	UINT32 TIM13_STOP:1;  //26,Debug TIM13 stopped when Core is halted,<LDY>
	UINT32 TIM14_STOP:1;  //27,Debug TIM14 stopped when Core is halted,<LDY>
	UINT32 TIM9_STOP:1;   //28,Debug TIM9 stopped when Core is halted,<LDY>
	UINT32 TIM10_STOP:1;  //29,Debug TIM10 stopped when Core is halted,<LDY>
	UINT32 TIM11_STOP:1;  //30,Debug TIM11 stopped when Core is halted,<LDY>
  UINT32 Reserved1:1;   //31,
};
//------------------------------------------------------------------------------------------------------------------------------
#define DBG_Struct Struct_DBG
typedef struct Struct_DBG//0xE0042000
{
  union{UINT32 ID;struct DBG_ID_BIT ID_BIT;}; //0x000(RW),
  union{UINT32 CR;struct DBG_CR_BIT CR_BIT;}; //0x004(RW),
} DBG_Type,Type_DBG;
#define PT_DBG    ((volatile Type_DBG *)BASE_DBG)
#define DBG_ID                  DBG.ID
#define DBG_CR                  DBG.CR
//==============================================================================================================================
//------------------------------------------------------------------------------------------------------------------------------
#define TAB_Struct Struct_TAB
typedef struct Struct_TAB
{
  union{UINT32 NVIC;};//0x000(R),
  union{UINT32 DWT;}; //0x004(R),
  union{UINT32 FPB;}; //0x008(R),
  union{UINT32 ITM;}; //0x00C(R),
  union{UINT32 TPI;}; //0x010(R),
  union{UINT32 ETM;}; //0x014(R),
  union{UINT32 END;}; //0x018(R),
  UINT32 Reserved0[1004]; //0x01C(R),
  union{UINT32 MEMType;}; //0xFCC(R),
  union{UINT32 PID4;};//0xFD0,Peripheral ID space; reserved 
  union{UINT32 PID5;};//0xFD4,Peripheral ID space; reserved 
  union{UINT32 PID6;};//0xFD8,Peripheral ID space; reserved 
  union{UINT32 PID7;};//0xFDC,Peripheral ID space; reserved 
  union{UINT32 PID0;};//0xFE0,Peripheral ID space; reserved 
  union{UINT32 PID1;};//0xFE4,Peripheral ID space; reserved 
  union{UINT32 PID2;};//0xFE8,Peripheral ID space; reserved 
  union{UINT32 PID3;};//0xFEC,Peripheral ID space; reserved 
  union{UINT32 CID0;};//0xFF0,Component ID space; reserved 
  union{UINT32 CID1;};//0xFF4,Component ID space; reserved 
  union{UINT32 CID2;};//0xFF8,Component ID space; reserved 
  union{UINT32 CID3;};//0xFFC,Component ID space; reserved  
} TAB_Type,Type_TAB;
#define PT_M3TAB                ((volatile Type_TAB *)BASE_TAB)
//------------------------------------------------------------------------------------------------------------------------------
#define TAB_NVIC                M3TAB.NVIC
#define TAB_DWT                 M3TAB.DWT
#define TAB_FPB                 M3TAB.FPB
#define TAB_ITM                 M3TAB.ITM
#define TAB_TPI                 M3TAB.TPI
#define TAB_ETM                 M3TAB.ETM
#define TAB_END                 M3TAB.END
#define TAB_MEMType             M3TAB.MEMType
#define TAB_PID4                M3TAB.PID4
#define TAB_PID5                M3TAB.PID5
#define TAB_PID6                M3TAB.PID6
#define TAB_PID7                M3TAB.PID7
#define TAB_PID0                M3TAB.PID0
#define TAB_PID1                M3TAB.PID1
#define TAB_PID2                M3TAB.PID2
#define TAB_PID3                M3TAB.PID3
#define TAB_CID0                M3TAB.CID0
#define TAB_CID1                M3TAB.CID1
#define TAB_CID2                M3TAB.CID2
#define TAB_CID3                M3TAB.CID3
//==============================================================================================================================
#define AHBAP_Struct Struct_AHBAP
typedef struct Struct_AHBAP
{
	UINT32                        CSW;
	UINT32                        TRANSADDR;
	UINT32                        Reserved0;
	UINT32                        DATA;
	UINT32                        BD[4];
	UINT32                        Reserved1[54];
	UINT32                        ROMADDR;  //RSTV=0xE000E000
	UINT32                        IDR;      //RSTV=0x04770011
} AHBAP_Type,Type_AHBAP;
