diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
//==============================================================================================================================
#define JTAG_Struct Struct_JTAG
typedef struct Struct_JTAG
{
	UINT32                        ABORT;
	UINT32                        IDCODE;
	UINT32                        CTRL_STAT;
	UINT32                        SELECT;
	UINT32                        RDBUFF;
	UINT32                        WCR;
	UINT32                        RESEND;
} JTAG_Type,Type_JTAG;
//==============================================================================================================================
#define GPIO_Pin_0                 ((uint16_t)0x0001)  //Pin 0 selected
#define GPIO_Pin_1                 ((uint16_t)0x0002)  //Pin 1 selected
#define GPIO_Pin_2                 ((uint16_t)0x0004)  //Pin 2 selected
#define GPIO_Pin_3                 ((uint16_t)0x0008)  //Pin 3 selected
#define GPIO_Pin_4                 ((uint16_t)0x0010)  //Pin 4 selected
#define GPIO_Pin_5                 ((uint16_t)0x0020)  //Pin 5 selected
#define GPIO_Pin_6                 ((uint16_t)0x0040)  //Pin 6 selected
#define GPIO_Pin_7                 ((uint16_t)0x0080)  //Pin 7 selected
#define GPIO_Pin_8                 ((uint16_t)0x0100)  //Pin 8 selected
#define GPIO_Pin_9                 ((uint16_t)0x0200)  //Pin 9 selected
#define GPIO_Pin_10                ((uint16_t)0x0400)  //Pin 10 selected
#define GPIO_Pin_11                ((uint16_t)0x0800)  //Pin 11 selected
#define GPIO_Pin_12                ((uint16_t)0x1000)  //Pin 12 selected
#define GPIO_Pin_13                ((uint16_t)0x2000)  //Pin 13 selected
#define GPIO_Pin_14                ((uint16_t)0x4000)  //Pin 14 selected
#define GPIO_Pin_15                ((uint16_t)0x8000)  //Pin 15 selected
#define GPIO_Pin_All               ((uint16_t)0xFFFF)  //All pins selected

typedef enum
{ 
  GPIO_Speed_10MHz = 1,
  GPIO_Speed_2MHz=2, 
  GPIO_Speed_50MHz=3,
}GPIOSpeed_TypeDef;
#define IS_GPIO_SPEED(SPEED) (((SPEED) == GPIO_Speed_10MHz) || ((SPEED) == GPIO_Speed_2MHz) || ((SPEED) == GPIO_Speed_50MHz))

typedef enum
{ GPIO_Mode_AIN = 0x0,
  GPIO_Mode_IN_FLOATING = 0x04,
  GPIO_Mode_IPD = 0x28,
  GPIO_Mode_IPU = 0x48,
  GPIO_Mode_Out_OD = 0x14,
  GPIO_Mode_Out_PP = 0x10,
  GPIO_Mode_AF_OD = 0x1C,
  GPIO_Mode_AF_PP = 0x18
}GPIOMode_TypeDef;

#define IS_GPIO_MODE(MODE) (((MODE) == GPIO_Mode_AIN) || ((MODE) == GPIO_Mode_IN_FLOATING) || ((MODE) == GPIO_Mode_IPD) || ((MODE) == GPIO_Mode_IPU) || \
                            ((MODE) == GPIO_Mode_Out_OD) || ((MODE) == GPIO_Mode_Out_PP) || ((MODE) == GPIO_Mode_AF_OD) || ((MODE) == GPIO_Mode_AF_PP))
typedef struct
{
  uint16_t GPIO_Pin;             //Specifies the GPIO pins to be configured. This parameter can be any value of @ref GPIO_pins_define
  GPIOSpeed_TypeDef GPIO_Speed;  //Specifies the speed for the selected pins. This parameter can be a value of @ref GPIOSpeed_TypeDef
  GPIOMode_TypeDef GPIO_Mode;    //Specifies the operating mode for the selected pins. This parameter can be a value of @ref GPIOMode_TypeDef
}GPIO_InitTypeDef;

typedef struct
{
  uint8_t NVIC_IRQChannel;
  uint8_t NVIC_IRQChannelPreemptionPriority;
  uint8_t NVIC_IRQChannelSubPriority;
  bool NVIC_IRQChannelCmd;//ENABLE or DISABLE
} NVIC_InitTypeDef;
//==============================================================================================================================
//register memory
extern volatile Type_ADC        ADC1    __attribute__((at(BASE_ADC1)));
extern volatile Type_ADC        ADC2    __attribute__((at(BASE_ADC2)));
extern volatile Type_ADC        ADC3    __attribute__((at(BASE_ADC3)));
extern volatile Type_ADC        *ADC[];//Array
extern volatile Type_BKP        BKP     __attribute__((at(BASE_BKP)));
extern volatile Type_CAN        CAN[2]  __attribute__((at(BASE_CAN1)));//array
extern volatile Type_CEC        CEC     __attribute__((at(BASE_CEC)));
extern volatile Type_CRC        CRC     __attribute__((at(BASE_CRC)));
extern volatile Type_DAC        DAC     __attribute__((at(BASE_DAC)));
extern volatile Type_DMA        DMA[2]  __attribute__((at(BASE_DMA1)));//array
extern volatile Type_ETH        ETH     __attribute__((at(BASE_ETH)));
extern volatile Type_EXTI       EXTI    __attribute__((at(BASE_EXTI)));
extern volatile Type_FLASH      FLASH   __attribute__((at(BASE_FLASHR)));
extern volatile Type_OB         OB      __attribute__((at(BASE_OB)));
extern volatile Type_FSMC       FSMC    __attribute__((at(BASE_FSMC)));
extern volatile Type_LCD        LCD     __attribute__((at(BASE_LCD)));//FSMC LCD
extern volatile Type_GPIO       GPIO[7] __attribute__((at(BASE_GPIOA)));//array
extern volatile Type_AFIO       AFIO    __attribute__((at(BASE_AFIO)));
extern volatile Type_I2C        I2C[2]  __attribute__((at(BASE_I2C1)));//array
extern volatile Type_WWDG       WWDG    __attribute__((at(BASE_WWDG)));
extern volatile Type_IWDG       IWDG    __attribute__((at(BASE_IWDG)));
extern volatile Type_PWR        PWR     __attribute__((at(BASE_PWR)));
extern volatile Type_RCC        RCC     __attribute__((at(BASE_RCC)));
extern volatile Type_RTC        RTC     __attribute__((at(BASE_RTC)));
extern volatile Type_SDIO       SDIO    __attribute__((at(BASE_SDIO)));
extern volatile Type_SPI        SPI1    __attribute__((at(BASE_SPI1)));
extern volatile Type_SPI        SPI2    __attribute__((at(BASE_SPI2)));
extern volatile Type_SPI        SPI3    __attribute__((at(BASE_SPI3)));
extern volatile Type_SPI        *SPI[];//array
extern volatile Type_TIM        TIM1    __attribute__((at(BASE_TIM1)));
extern volatile Type_TIM        TIM2    __attribute__((at(BASE_TIM2)));
extern volatile Type_TIM        TIM3    __attribute__((at(BASE_TIM3)));
extern volatile Type_TIM        TIM4    __attribute__((at(BASE_TIM4)));
extern volatile Type_TIM        TIM5    __attribute__((at(BASE_TIM5)));
extern volatile Type_TIM        TIM6    __attribute__((at(BASE_TIM6)));
extern volatile Type_TIM        TIM7    __attribute__((at(BASE_TIM7)));
extern volatile Type_TIM        TIM8    __attribute__((at(BASE_TIM8)));
extern volatile Type_TIM        TIM9    __attribute__((at(BASE_TIM9)));
extern volatile Type_TIM        TIM10   __attribute__((at(BASE_TIM10)));
extern volatile Type_TIM        TIM11   __attribute__((at(BASE_TIM11)));
extern volatile Type_TIM        TIM12   __attribute__((at(BASE_TIM12)));
extern volatile Type_TIM        TIM13   __attribute__((at(BASE_TIM13)));
extern volatile Type_TIM        TIM14   __attribute__((at(BASE_TIM14)));
extern volatile Type_TIM        TIM15   __attribute__((at(BASE_TIM15)));
extern volatile Type_TIM        TIM16   __attribute__((at(BASE_TIM16)));
extern volatile Type_TIM        TIM17   __attribute__((at(BASE_TIM17)));
extern volatile Type_TIM        *TIM[];//array(17)
extern volatile Type_UART       UART1   __attribute__((at(BASE_UART1)));
extern volatile Type_UART       UART2   __attribute__((at(BASE_UART2)));
extern volatile Type_UART       UART3   __attribute__((at(BASE_UART3)));
extern volatile Type_UART       UART4   __attribute__((at(BASE_UART4)));
extern volatile Type_UART       UART5   __attribute__((at(BASE_UART5)));
extern volatile Type_UART       *UART[];//array(5)
extern volatile Type_USB        USB     __attribute__((at(BASE_USB)));
extern volatile Type_USBFS      USBFS   __attribute__((at(BASE_USBFS)));
extern volatile Type_DES        DES     __attribute__((at(BASE_DES)));
//------------------------------------------------------------------------------------------------------------------------------
extern volatile Type_ITM        M3ITM   __attribute__((at(BASE_ITM)));
extern volatile Type_DWT        M3DWT   __attribute__((at(BASE_DWT)));
extern volatile Type_FPB        M3FPB   __attribute__((at(BASE_FPB)));
extern volatile Type_SYS        M3SYS   __attribute__((at(BASE_SYS)));
extern volatile Type_TPI        M3TPI   __attribute__((at(BASE_TPI)));//TPIU
extern volatile Type_ETM        M3ETM   __attribute__((at(BASE_ETM)));
extern volatile Type_DBG        M3DBG   __attribute__((at(BASE_DBG)));//DBGMCU
extern volatile Type_TAB        M3TAB   __attribute__((at(BASE_TAB)));
//------------------------------------------------------------------------------------------------------------------------------
#define SIZE_REGS       (sizeof(Type_ADC)*3+sizeof(Type_BKP)+sizeof(Type_CAN)*2+sizeof(Type_CEC)+sizeof(Type_CRC)+\
                        sizeof(Type_DAC)+sizeof(Type_DMA)*2+sizeof(Type_ETH)+sizeof(Type_EXTI)+sizeof(Type_FLASH)+\
                        sizeof(Type_OB)+sizeof(Type_FSMC)+sizeof(Type_LCD)+sizeof(Type_GPIO)*7+sizeof(Type_AFIO)+\
                        sizeof(Type_I2C)*2+sizeof(Type_WWDG)+sizeof(Type_IWDG)+sizeof(Type_PWR)+sizeof(Type_RCC)+\
                        sizeof(Type_RTC)+sizeof(Type_SDIO)+sizeof(Type_SPI)*3+sizeof(Type_TIM)*17+sizeof(Type_UART)*5+\
                        sizeof(Type_USB)+sizeof(Type_USBFS)+sizeof(Type_DES)+sizeof(Type_ITM)+sizeof(Type_DWT)+\
                        sizeof(Type_FPB)+sizeof(Type_SYS)+sizeof(Type_TPI)+sizeof(Type_ETM)+sizeof(Type_DBG)+sizeof(Type_TAB))
//==============================================================================================================================
//[PortIndex]
#define PortIndex_USB1          0
#define PortIndex_USB2          1
#define PortIndex_CAN1          2
#define PortIndex_CAN2          3
#define PortIndex_Uart1         4
#define PortIndex_Uart2         5
#define PortIndex_Uart3         6
#define PortIndex_Uart4         7
#define PortIndex_Uart5         8
#define PortIndex_SPI1          9
#define PortIndex_SPI2          10
#define PortIndex_SPI3          11
#define PortIndex_Count         12
//==============================================================================================================================
//[AppPara]
#define AppPara_Area_ROM        0
#define AppPara_Area_IIC        1
#define AppPara_Area_Count      2
//==============================================================================================================================
//[INTF],interface
typedef struct Data_INTF
{
  void (*IMM_Event)(void);
  void (*INT_Event)(void);
  void (*TMR_Event)(void);
  void (*Init)(UINT8 IsAfter);
  void (*IRQ_RTC)(UINT8 Index);
  void (*IRQ_TIM)(UINT8 Index);//TIM2=100us
  void (*TMR)(UINT8 Index);//0=1ms,1=5ms,2=10ms,3=100ms,4=1000ms
  void (*ADC_Control)(UINT8 Index);
  void (*DMA_Control)(UINT8 Index,UINT8 CHIndex);
  void (*EXTI_Control)(UINT8 Index);
  void (*COM_ReadPacket)(UINT16 Index,UINT8* s,UINT16 Count);
  void (*COM_ReadParameter)(UINT16 Index,UINT8* s,UINT16 Count);
} Type_INTF;
