diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
//==============================================================================================================================
//[APPV]
typedef struct Data_APPV
{
  UINT8                   Var[4],IRQVar[4];//公用8位变量（分中断内外)
  UINT16                  INT[4],IRQINT[4];//公用16位变量（分中断内外)
  UINT32                  LNG[4],IRQLNG[4];//公用32位变量（分中断内外)
  union UINT32_REG        U32V[2],IRQU32V[2];//公用32位结构变量（分中断内外)
  union UINT64_REG        U64V[2],IRQU64V[2];//公用64位结构变量（分中断内外)

  union UINT8_REG         SystemST;//系统3大事件状态，如果建立成数组或制作成芯片，可以做成最快的操作系统
  union UINT32_REG        ST[4];//设备通用状态
  
  UINT8  TMRCount[4],MicroTimeCount,LGIndex,LGCount;
  UINT32 SysTimeCount,SleepTimeCount,Para_Save_TimeCount;
  UINT32 PSP,MSP;//堆栈备份，用于升级
  UINT64 Dentify;
} Type_APPV;
//==============================================================================================================================
//[GPIO]
#define SDK_GPIO_MAXCOUNT       7
#define PN_EMPTY                0xFFFFFFFF//PIN
//==============================================================================================================================
//[EXTI]
#define SDK_EXT_MAXCOUNT        16
typedef struct Setup_EXT
{
	UINT16 PN:10;//PN=PortNumber=Port*32+Pin: for Port  0=GIOA,1=GPIOB,...;for Pin 0_15=PIN0_15
	UINT16 Falling:1;
	UINT16 Rising:1;
	UINT16 Reserved0:3;
  UINT16 EN:1;
} Setup_EXT_Type,Type_Setup_EXT;
typedef struct Data_EXTItem
{
	Type_Setup_EXT Setup;
} Type_EXTItem;
//==============================================================================================================================
//[ADC]
#define SDK_ADC_MAXCOUNT        3
typedef struct Data_ADCItem
{
  UINT8  HWIndex,Count,Index;
  UINT32 *V;
} Type_ADCItem;
//==============================================================================================================================
//[DAC]
#define SDK_DAC_MAXCOUNT        1
typedef struct Data_DACItem
{
  UINT8  HWIndex,Count,Index;
  UINT32 *V;
} Type_DACItem;
//==============================================================================================================================
//[SPI]
#define SDK_SPI_MAXCOUNT        3
typedef struct Setup_SPI
{
	UINT8 BR:3;//BR: SPI1=72M,SP2/SP3=36M div by :0=/2=18M,1=/4=9MHz,2=/8=4.5MHz
	UINT8 CPHA:1;//phase:相位:0=first,1=second
	UINT8 CPOL:1;//Level:稳态电压,0=Low,1=High
	UINT8 BIDMode:1;//BIDMode=1 for 3 wire
	UINT8 ALF:1;//ALF for SPI1,SPI3
	UINT8 EN:1;
} Type_Setup_SPI;
typedef struct Data_SPIItem
{
  UINT8 HWIndex,BaudIndex;
	Type_Setup_SPI Setup;
} Type_SPIItem;
//==============================================================================================================================
//[I2S]
#define SDK_I2S_MAXCOUNT        3
typedef struct Setup_I2S
{
  UINT8 EN:1;
} Type_Setup_I2S;
typedef struct Data_I2SItem
{
	UINT8 HWIndex,BaudIndex;
  Type_Setup_I2S Setup;
} Type_I2SItem;
//==============================================================================================================================
//[I2C]
#define SDK_I2C_MAXCOUNT        2
typedef struct Setup_I2C
{
  UINT8 EN:1;
} type_Setup_I2C;
typedef struct Data_I2CItem
{
  UINT8 HWIndex,BaudIndex;
  type_Setup_I2C Setup;
} Type_I2CItem;
//==============================================================================================================================
//[UART],BAUD={1200,2400,4800,9600,14400,19200,28800,38400,57600,115200,500000,1000000,2000000}
#define SDK_UART_MAXCOUNT       5
typedef struct Data_UARTItem
{
  UINT8 HWIndex,BaudIndex,BitCount;//硬件索引，波特率索引,位数
} Type_UARTItem;
//==============================================================================================================================
//[CAN]
#define SDK_CAN_MAXCOUNT        2
typedef struct Data_CANItem
{
  union  UINT8_REG State;
  union  UINT32_REG SAD,TAD;//CAN 源地址，目标地址  
  UINT8 HWIndex,BaudIndex;//硬件索引，波特率索引
} Type_CANItem;
//==============================================================================================================================
//[ETH]
#define SDK_ETH_MAXCOUNT        1
typedef struct Data_ETHItem
{
  UINT8 HWIndex,BaudIndex;//硬件索引，波特率索引
} Type_ETHItem;
//==============================================================================================================================
//[USB]
#define SDK_USB_MAXCOUNT        1
typedef enum ENUM_USBRESULT
{
  USB_SUCCESS = 0, 
  USB_ERROR=1,
  USB_UNSUPPORT=2,
  USB_NOT_READY=3//The process has not been finished, endpoint will be NAK to further request
} USB_RESULT;

typedef enum ENUM_USBRESUMESTATE
{
  USB_RESUME_EXTERNAL=0,
  USB_RESUME_INTERNAL=1,
  USB_RESUME_LATER=2,
  USB_RESUME_WAIT=3,
  USB_RESUME_START=4,
  USB_RESUME_ON=5,
  USB_RESUME_OFF=6,
  USB_RESUME_SOF=7,
  USB_RESUME_ESOF=8
} USB_RESUME_STATE;

typedef enum ENUM_USBDEVICESTATE
{
  USB_STATE_UNCONNECTED=0,
  USB_STATE_ATTACHED=1,
  USB_STATE_POWERED=2,
  USB_STATE_SUSPENDED=3,
  USB_STATE_ADDRESSED=4,
  USB_STATE_CONFIGURED=5
} USB_DEVICE_STATE;

typedef enum ENUM_USBControlStatus
{
  WAIT_SETUP=0,
  SETTING_UP=1,
  IN_DATA=2,
  OUT_DATA=3,
  LAST_IN_DATA=4,
  LAST_OUT_DATA=5,
  WAIT_STATUS_IN=7, 
  WAIT_STATUS_OUT=8,
  STALLED=9,
  PAUSE=10
} USB_CONTROL_STATE;//The state machine states of a control pipe

typedef struct OneDescriptor
{
  UINT8 *Descriptor;
  UINT16 Descriptor_Size;
}ONE_DESCRIPTOR, *PONE_DESCRIPTOR;

typedef struct _ENDPOINT_INFO
{
  uint16_t  Usb_wLength;
  uint16_t  Usb_wOffset;
  uint16_t  PacketSize;
  UINT8   *(*CopyData)(uint16_t Length);
}ENDPOINT_INFO;

typedef struct _DEVICE_INFO
{
  UINT8 USBbmRequestType; //bmRequestType
  UINT8 USBbRequest;            //bRequest
  union UINT16_REG USBwValues;         //wValue
  union UINT16_REG USBwIndexs;         //wIndex
  union UINT16_REG USBwLengths;        //wLength

  UINT8 ControlState;           //USB_CONTROL_STATE
  UINT8 Current_Feature;
  UINT8 Current_Configuration;   //Selected configuration  //CONFIGURATION是怎么取值的，代表什么意义？
  UINT8 Current_Interface;       //Selected interface of current configuration 
  UINT8 Current_AlternateSetting;//Selected Alternate Setting of current interface
  ENDPOINT_INFO Ctrl_Info;
}DEVICE_INFO;

typedef struct Data_ResumeState
{
  USB_RESUME_STATE eState;
  UINT8 bESOFcnt;
} USB_ResumeState;

//RequestType
#define USB_REQUEST_TYPE      0x60
#define USB_STANDARD_REQUEST  0x00
#define USB_CLASS_REQUEST     0x20
#define USB_VENDOR_REQUEST    0x40
#define USB_RECIPIENT         0x1F

#define USB_DEVICE_CLASS_RESERVED           0x00
#define USB_DEVICE_CLASS_AUDIO              0x01
#define USB_DEVICE_CLASS_COMMUNICATIONS     0x02
#define USB_DEVICE_CLASS_HUMAN_INTERFACE    0x03
#define USB_DEVICE_CLASS_MONITOR            0x04
#define USB_DEVICE_CLASS_PHYSICAL_INTERFACE 0x05
#define USB_DEVICE_CLASS_POWER              0x06
#define USB_DEVICE_CLASS_PRINTER            0x07
#define USB_DEVICE_CLASS_STORAGE            0x08
#define USB_DEVICE_CLASS_HUB                0x09
#define USB_DEVICE_CLASS_VENDOR_SPECIFIC    0xFF
//STANDARD_REQUESTS
#define USB_GET_STATUS 0
#define USB_CLEAR_FEATURE 1
#define USB_RESERVED1 2
#define USB_SET_FEATURE 3
#define USB_RESERVED2 4
#define USB_SET_ADDRESS 5
#define USB_GET_DESCRIPTOR 6
#define USB_SET_DESCRIPTOR 7
#define USB_GET_CONFIGURATION 8
#define USB_SET_CONFIGURATION 9
#define USB_GET_INTERFACE 10
#define USB_SET_INTERFACE 11
#define USB_SYNCH_FRAME 12//Total number of Standard request

