diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
//Feature selector of a SET_FEATURE or CLEAR_FEATURE
#define USB_ENDPOINT_STALL  0
#define USB_DEVICE_REMOTE_WAKEUP 1

#define USB_DEVICE_DESCRIPTOR 1
#define USB_CONFIG_DESCRIPTOR 2
#define USB_STRING_DESCRIPTOR 3
#define USB_INTERFACE_DESCRIPTOR 4
#define USB_ENDPOINT_DESCRIPTOR	5

#define USB_STALLED 0x00
#define USB_WAIT_STATUS_IN 0x01
#define USB_WAIT_STATUS_OUT 0x02
#define USB_WAIT_Data_IN 0x04
#define USB_WAIT_Data_OUT 0x08
#define USB_WAIT_SET_ADDRESS 0x10
#define USB_RESET 0x20

#define USB_STANDARD_REQUEST    0x00//Standard request
#define USB_CLASS_REQUEST       0x20//Class request
#define USB_VENDOR_REQUEST      0x40//Vendor request

#define USB_DEVICE_RECIPIENT    0x00//Recipient device
#define USB_INTERFACE_RECIPIENT 0x01//Recipient interface
#define USB_ENDPOINT_RECIPIENT  0x02//Recipient endpoint
#define USB_OTHER_RECIPIENT     0x03

#define USB_REPORT_DESCRIPTOR	  0x22
#define USB_HID_DESCRIPTOR_TYPE	0x21
//HID_REQUESTS
#define USB_GET_REPORT	1
#define USB_GET_IDLE	2
#define USB_GET_PROTOCOL	3
#define USB_SET_REPORT	9
#define USB_SET_IDLE	10
#define USB_SET_PROTOCOL	11

#define USB_MDL_USB1            0x00
#define USB_MDL_USB2            0x01
//------------------------------------------------------------------------------------------------------------------------------
typedef struct Data_USBItem
{
  UINT8 HWIndex,BaudIndex;//硬件索引，波特率索引
} Type_USBItem;
//==============================================================================================================================
//[FLASH]
typedef enum
{ 
  FLASH_BUSY = 1,
  FLASH_ERROR_PG=2,
  FLASH_ERROR_WRP=3,
  FLASH_COMPLETE=4,
  FLASH_TIMEOUT=5,
}Flash_Status;
//FLASH Keys for OPTKEYR
#define RDP_Key                 ((UINT16)0x00A5)
#define FLASH_KEY1              ((UINT32)0x45670123)
#define FLASH_KEY2              ((UINT32)0xCDEF89AB)
//FLASH BANK address
#define FLASH_BANK1_END_ADDRESS ((UINT32)0x0807FFFF)
#define FLASH_EraseTimeout      0x000B0000
#define FLASH_ProgramTimeout    0x00002000

#define IS_FLASH_ADDRESS(ADDRESS) (((ADDRESS) >= 0x08000000) && ((ADDRESS) < 0x080FFFFF))
#define IS_OB_DATA_ADDRESS(ADDRESS) (((ADDRESS) == 0x1FFFF804) || ((ADDRESS) == 0x1FFFF806))

#define FLASH_BACKUP_NONE               0
#define FLASH_BACKUP_ROM                1
#define FLASH_BACKUP_RAM                2
#define FLASH_BACKUP_MODE               FLASH_BACKUP_RAM//1=ROM,2=RAM
typedef struct Data_Flash
{
	UINT8  Item[SIZE_FLASHPAGE];
	UINT16 Index,Count;
} Type_DFLA;
//==============================================================================================================================
//[COM]
#define SIZE_NSN_LEN            8
#define SIZE_COM_MT             8
#define SIZE_ADR_LEN            0x20
typedef struct Data_COM_PRTC
{
  UINT16 Index,Count,TimeIndex,TimeCount,*Item;
} Type_COMPRTC;
typedef struct Data_COM_PortIndex
{
  UINT16 I,O,App;
} Type_COMPort;

struct Data_COM_Port
{
	UINT8  Type,Index,BaudIndex,Name[8]; UINT32 Baud;
};
struct DATA_COM_BUS
{
  UINT8  Size,Count,Index,*Item;//总线子设备缓冲大小，子设备个数，子设备索引，子设备列表
  UINT8  NSN[SIZE_NSN_LEN],NSNLen;//主设备
};
struct Data_AddressPos
{
  UINT8 Len,Port,Addr;
};
struct Data_Address
{
  UINT8 Layer,LayerLen[2],LayerAddrIndex,LayerAddrCount,AddrIndex;//层索引，当前层单个地址长度，层地址索引与个数，地址索引
  UINT8 RelayLayer;struct Data_AddressPos NextAP,LocalAP;//中继位置
	UINT8 Len,Item[SIZE_ADR_LEN];//地址总长度,Item=地址头+地址列表, Index:0_3=发送者个数，路径个数，接收者个数,中继层索引
};

struct Data_MessTime
{
  UINT16 Pos;UINT32 Time;//位置，时间
};

struct Data_MultiMessTime
{
  UINT8 Size,Count,Index;
  struct Data_MessTime Item[SIZE_COM_MT];
};
struct COM_Control_BIT
{
  UINT8 RW:2;           //0=W,1=R,2=WR,3=RW;
  UINT8 BG:1;           //2,
  UINT8 SF:1;           //3,
  UINT8 PW:1;           //4,
  UINT8 AD:1;           //5,
  UINT8 AP:1;           //6,
  UINT8 BC:1;           //7,
};

struct Data_TXItem
{
  UINT8 TimeOut_Time,TimeOut_TimeCount,TimeOut_Count;//超时控制
  UINT16 Pos,Len,Index;//项内字符控制
};

typedef struct Data_COM_TXFrame
{
  union{UINT8 Control;struct COM_Control_BIT Control_BIT;};
  UINT8  *Item,Command,Verify;
	UINT16 Size,Count,Index,ParaCount,PortIndex;UINT32 Time;
  struct Data_TXItem TXI;
  struct Data_MultiMessTime MMT;
} Type_COM_TXFrame;
typedef struct Data_COM_RXFrame
{
  union{UINT8 Control;struct COM_Control_BIT Control_BIT;};
	UINT8  *Item,Command,Verify;
	UINT16 Size,Count,Index,ParaCount,PortIndex;UINT32 Time;
  UINT16 PacketTimeCount,PacketIndex,LFParaCount,LFSubParaCount;
	struct Data_Address ADR;
} Type_COM_RXFrame;

typedef struct Data_COMItem//Communication
{
	union  UINT32_REG State;//状态
  UINT32 RXTime,TXTime;//最后的收发时间
	struct Data_Array_UINT8   TPW;//传输密码
  struct Data_COM_PRTC      PRTC;//Protocol,协议，
  struct Data_COM_PortIndex PORT;//当前输出端口，多任务端口
  struct Data_COM_RXFrame   RF;//接收包
	struct Data_COM_TXFrame   TF;//发送包
  struct DATA_COM_BUS       BUS;//总线
} Type_COMItem;
//==============================================================================================================================
//setup register
//------------------------------------------------------------------------------------------------------------------------------
//WWDG and IWDG
#define SET_WWDG_CFR_WDGTB      WWDG_CFR_WDGTB_DIV8
#define SET_WWDG_CFR_W          0x7F
#define SET_IWDG_PR_DIV         IWDG_PR_DIV256
//------------------------------------------------------------------------------------------------------------------------------
//NVIC
#define SET_PRIGROUP            PRIGROUP_2//0_4
#define VECTTAB_FLASH           0
#define VECTTAB_SRAM            1
#define SDK_VECTTAB             VECTTAB_FLASH
//------------------------------------------------------------------------------------------------------------------------------
//RCC
#define SET_SW                  RCC_CFGR_SW_PLL//Sysclk source
#define SET_HPRE                0//AHB prescaler,Sysclk divided by: 0_7=1,8_B=2^(HPRE-7),C_F=2^(HPRE-6)
#define SET_PPRE1               4//APB1,0_3=/1,4_7=CLK_AHB/(1<<(PPRE1-3))
#define SET_PPRE2               0//APB2,0_3=/1,4_7=CLK_AHB/(1<<(PPRE2-3))
#define SET_ADCPRE              1//0_3= PCLK2/((ADCPRE+1)*2)
#define SET_PLLSRC              1//PLL entry clock source:0=HSI/2,1=PREDIV1
#define SET_PLLMULL             7//2_7=*(PLLMULL+2)=*4_9,11=*6.5
#define SET_MCO                 0//MCO:0=No CLK,4=SysCLK

#define SET_PREDIV1             0// PLL2CLK/1
#define SET_PREDIV2             0// HSE/1
#define SET_PLL2MUL             7// 6_12= *(PLL2MUL+2)=*8_14,14=*16,15=*20
#define SET_PLL3MUL             7// 6_12= *(PLL2MUL+2)=*8_14,14=*16,15=*20
#define SET_PREDIV1SRC          0//0=HSE,1=PLL2
#define SET_I2S2SRC             0//
#define SET_I2S3SRC             0//

#define CLK_LSI                 24000//Internal slow OSC
#define CLK_LSE                 32000//External slow OSC
#define CLK_HSI                 8000000//Internal OSC
#if IsDensity(CL)
  #define CLK_HSE               25000000//External OSC
#else
  #define CLK_HSE               8000000//External OSC
#endif
#define CLK_USBFS               48000000//USB OTGFS
#define CLK_PREDIV2             (CLK_HSE/(SET_PREDIV2+1))

