diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#if SET_PLL2MUL>=6 && SET_PLL2MUL<=12
#define CLK_PLL2                ((SET_PLL2MUL+2)*CLK_PREDIV2)
#elif SET_PLL2MUL==14
#define CLK_PLL2                (16*CLK_PREDIV2)
#elif SET_PLL2MUL==15
#define CLK_PLL2                (20*CLK_PREDIV2)
#else
#define CLK_PLL2                CLK_PREDIV2
#endif

#if SET_PLL3MUL>=6 && SET_PLL3MUL<=12
#define CLK_PLL3                ((SET_PLL3MUL+2)*CLK_PREDIV2)
#elif SET_PLL3MUL==14
#define CLK_PLL3                (16*CLK_PREDIV2)
#elif SET_PLL3MUL==15
#define CLK_PLL3                (20*CLK_PREDIV2)
#else
#define CLK_PLL3                CLK_PREDIV2	
#endif

#define CLK_PREDIV1             (SET_PREDIV1SRC==0 ? CLK_HSE/(SET_PREDIV1+1) : CLK_PLL2/(SET_PREDIV1+1))
#define CLK_PLLIN               (SET_PLLSRC==0 ? CLK_HSI/2:CLK_PREDIV1)

#if SET_PLLMULL>=2 && SET_PLLMULL<=7
#define CLK_PLL                 (CLK_PLLIN*(SET_PLLMULL+2))
#elif SET_PLLMULL==11
#define CLK_PLL                 (CLK_PLLIN*6.5)
#endif

#define CLK_PLLVCO              (2*CLK_PLL)
#define SET_OTGFSPRE            (CLK_PLL==72000000 ? 0:1)//0=2*PLLCLK/3(PLLCLK=72M),1=2*PLLCLK/2(PLLCLK=48MHz)
#define SET_PLLXTPRE            (SET_PREDIV1&1)

#if     SET_SW==0 
#define CLK_SYS                 CLK_HSI
#elif   SET_SW==1
#define CLK_SYS                 CLK_HSE
#else
#define CLK_SYS                 CLK_PLL//Max 72MHz 
#endif

//#define CLK_AHB                 CLK_SYS/(SET_HPRE<8 ? 1:1<<(SET_HPRE-(SET_HPRE<12 ? 7:6))) //HCLK
#if SET_HPRE<8
#define CLK_AHB                 CLK_SYS//Max 72MHz
#elif SET_HPRE<12
#define CLK_AHB                 (CLK_SYS/(1<<(SET_HPRE-7)))
#else
#define CLK_AHB                 (CLK_SYS/(1<<(SET_HPRE-6)))
#endif

//#define CLK_APB1                (CLK_AHB/(SET_PPRE1<4 ?  1: 1<<(SET_PPRE1-3)))//Max 36MHz
#if SET_PPRE1<4
#define CLK_APB1                CLK_AHB
#else
#define CLK_APB1                (CLK_AHB/(1<<(SET_PPRE1-3)))
#endif

//#define CLK_APB2                (CLK_AHB/(SET_PPRE2<4 ?  1: 1<<(SET_PPRE2-3)))//Max 72MHz
#if SET_PPRE2<4
#define CLK_APB2                CLK_AHB
#else
#define CLK_APB2                (CLK_AHB/(1<<(SET_PPRE2-3)))
#endif


#define CLK_ADC                 CLK_APB2/(SET_ADCPRE+1)//Max 14MHz
#define CLK_TIM234567           (SET_PPRE1<4 ? CLK_APB1:2*CLK_APB1)//Max 36MHz
#define CLK_TIM1                CLK_APB2//Max 72MHz
#define CLK_DMA                 CLK_AHB
#define CLK_CORE                CLK_AHB

#define SET_RCC_CFGR            SET_MCO<<24|SET_OTGFSPRE<<22|SET_PLLMULL<<18|SET_PLLXTPRE<<17|SET_PLLSRC<<16\
                                |SET_ADCPRE<<14|SET_PPRE2<<11|SET_PPRE1<<8|SET_HPRE<<4|SET_SW
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define SET_RCC_CFGR2           SET_PREDIV1|SET_PREDIV2<<4|SET_PLL2MUL<<8|SET_PLL3MUL<<12\
                                |SET_PREDIV1SRC<<16|SET_I2S2SRC<<17|SET_I2S3SRC<<18
//==============================================================================================================================
//asm function macro
static __inline void __EIRQ()   { __asm volatile ("cpsie i"); }//__enable_irq()
static __inline void __DIRQ()   { __asm volatile ("cpsid i"); }//__disable_irq()
static __inline void __EFIRQ()  { __asm volatile ("cpsie f"); }//__enable_fault_irq()
static __inline void __DFIRQ()  { __asm volatile ("cpsid f"); }//__disable_fault_irq() 
static __inline void __NOP()    { __asm volatile ("nop"); }
static __inline void __WFI()    { __asm volatile ("wfi"); }
static __inline void __WFE()    { __asm volatile ("wfe"); }
static __inline void __SEV()    { __asm volatile ("sev"); }
static __inline void __ISB()    { __asm volatile ("isb"); }
static __inline void __DSB()    { __asm volatile ("dsb"); }
static __inline void __DMB()    { __asm volatile ("dmb"); }
static __inline void __CLREX()  { __asm volatile ("clrex"); }

#define EIRQ()                  { __asm volatile ("cpsie i"); }
#define DIRQ()                  { __asm volatile ("cpsid i"); }
#define EFIRQ()                 { __asm volatile ("cpsie f"); }
#define DFIRQ()                 { __asm volatile ("cpsid f"); }
#define NOP()                   { __asm volatile ("nop"); }
#define WFI()                   { __asm volatile ("wfi"); }
#define WFE()                   { __asm volatile ("wfe"); }
#define SEV()                   { __asm volatile ("sev"); }
#define ISB()                   { __asm volatile ("isb"); }
#define DSB()                   { __asm volatile ("dsb"); }
#define DMB()                   { __asm volatile ("dmb"); }
#define CLREX()                 { __asm volatile ("clrex"); }
//==============================================================================================================================
#define ITM_RXBUFFER_EMPTY   0x5AA55AA5U     //Value identifying \ref ITM_RxBuffer is ready for next character.
extern volatile UINT32 ITM_RxBuffer;         //External variable to receive characters.

__STATIC_INLINE UINT32 ITM_SendChar (UINT32 ch)
{
  if (M3ITM.TCR_BIT.ITMENA && M3ITM.TER_BIT.B0) {while (M3ITM.PORT[0] == 0)NOP(); M3ITM.PORT_B8[0].V = (UINT8)ch;}//ITM enabled and ITM Port #0 enabled */
  return (ch);
}
__STATIC_INLINE INT32 ITM_ReceiveChar (void)
{
  INT32 ch = -1;//no character available 
  if (ITM_RxBuffer != ITM_RXBUFFER_EMPTY){ch = ITM_RxBuffer; ITM_RxBuffer = ITM_RXBUFFER_EMPTY;} //ready for next character
  return (ch);
}
__STATIC_INLINE UINT32 ITM_CheckChar (void)
{
  return (ITM_RxBuffer == ITM_RXBUFFER_EMPTY ? 0:1);
}
//------------------------------------------------------------------------------------------------------------------------------
__STATIC_INLINE void SystemReset(void)
{
  __DSB(); M3SYS.AIRCR  =0x05FA0001| (M3SYS.AIRCR&0x700);// Keep priority group unchanged
};
//------------------------------------------------------------------------------------------------------------------------------
__STATIC_INLINE UINT32 CPUGet_CONTROL(void)
{
  register UINT32 __regControl         __ASM("control");
  return(__regControl);
}
__STATIC_INLINE void CPUSet_CONTROL(UINT32 control)
{
  register UINT32 __regControl         __ASM("control");
  __regControl = control;
}
__STATIC_INLINE UINT32 CPUGet_IPSR(void)
{
  register UINT32 __regIPSR          __ASM("ipsr");
  return(__regIPSR);
}
__STATIC_INLINE UINT32 CPUGet_APSR(void)
{
  register UINT32 __regAPSR          __ASM("apsr");
  return(__regAPSR);
}
__STATIC_INLINE UINT32 CPUGet_xPSR(void)
{
  register UINT32 __regXPSR          __ASM("xpsr");
  return(__regXPSR);
}
__STATIC_INLINE UINT32 CPUGet_PSP(void)
{
  register UINT32 __regProcessStackPointer  __ASM("psp");
  return(__regProcessStackPointer);
}
__STATIC_INLINE void CPUSet_PSP(UINT32 topOfProcStack)
{
  register UINT32 __regProcessStackPointer  __ASM("psp");
  __regProcessStackPointer = topOfProcStack;
}
__STATIC_INLINE UINT32 CPUGet_MSP(void)
{
  register UINT32 __regMainStackPointer     __ASM("msp");
  return(__regMainStackPointer);
}
__STATIC_INLINE void CPUSet_MSP(UINT32 topOfMainStack)
{
  register UINT32 __regMainStackPointer     __ASM("msp");
  __regMainStackPointer = topOfMainStack;
}
__STATIC_INLINE UINT32 CPUGet_PRIMASK(void)
{
  register UINT32 __regPriMask         __ASM("primask");
  return(__regPriMask);
}
__STATIC_INLINE void CPUSet_PRIMASK(UINT32 priMask)
{
  register UINT32 __regPriMask         __ASM("primask");
  __regPriMask = (priMask);
}
__STATIC_INLINE UINT32  CPUGet_BASEPRI(void)
{
  register UINT32 __regBasePri         __ASM("basepri");
  return(__regBasePri);
}
__STATIC_INLINE void CPUSet_BASEPRI(UINT32 basePri)
{
  register UINT32 __regBasePri         __ASM("basepri");
  __regBasePri = (basePri & 0xFFU);
}
__STATIC_INLINE void CPUSet_BASEPRI_MAX(UINT32 basePri)
{
  register UINT32 __regBasePriMax      __ASM("basepri_max");
  __regBasePriMax = (basePri & 0xFFU);
}
__STATIC_INLINE UINT32 CPUGet_FAULTMASK(void)
{
  register UINT32 __regFaultMask       __ASM("faultmask");
  return(__regFaultMask);
}
__STATIC_INLINE void CPUSet_FAULTMASK(UINT32 faultMask)
{
  register UINT32 __regFaultMask       __ASM("faultmask");
  __regFaultMask = (faultMask & 1);
}

