diqiu114/CodeLib/STM32F10X_V01/Source/STM32F10X_V01.h
#define GETSP()        __current_sp()
//==============================================================================================================================
//c function macro
#define IWDG_Enable(EN)         {if(EN)IWDG.KR=0xCCCC; else DBG.CR_BIT.IWDG_STOP=1;}//0=Disable,1=Enable
#define IWDG_CLR()              IWDG.KR=0xAAAA
#define WWDG_Enable(EN)         WWDG.CR_BIT.WDGA=EN//1=Enable,0=Disable
#define WWDG_CLR()              WWDG.CR_BIT.T=0x7F
#define WDT_Enable(EN)          IWDG_Enable(EN);//WWDG_Enable(EN)
#define WDT_CLR()               IWDG_CLR();//WWDG_CLR()
#define SETIRQPR(IRQN,PP,SP)    {M3SYS.IPR[(IRQN)]= ((PP&(0x0f>>(SET_PRIGROUP-3)))<<(SET_PRIGROUP+1)|(SP&(0x0f>>(7-SET_PRIGROUP)))<<4);}//PP=0_15,SP=0_15
#define SETIRQEN(IRQN,EN)       {if(EN) M3SYS.ISER[(IRQN)>>5] = (1<<((IRQN)&0x1F));else M3SYS.ICER[(IRQN)>>5] = (1<<((IRQN)&0x1F));}//bit=interrupt enable:1= enable ,0=disable
#define SETIRQ(IRQN,PP,SP)      SETIRQPR(IRQN,PP,SP);SETIRQEN(IRQN,1);

#define SETPINMODE(PN,Mode)     {if(PN&0x18)GPIO[(PN>>5)].CRH=(GPIO[(PN>>5)].CRH&~((UINT32)0x0F<<((PN&7)*4)))|((UINT32)Mode<<((PN&7)*4)); \
                                       else GPIO[(PN>>5)].CRL=(GPIO[(PN>>5)].CRL&~((UINT32)0x0F<<((PN&7)*4)))|((UINT32)Mode<<((PN&7)*4));}

#define SETPINEXTI(PN)          {AFIO.EXTICR[(PN>>2)&3]&=(0xFFFF-(0x0F<<((PN&3)*4)));AFIO.EXTICR[(PN>>2)&3]|=((PN>>5)<<((PN&3)*4));}
//------------------------------------------------------------------------------------------------------------------------------
#define Device_Reset()          SystemReset()
//==============================================================================================================================
#endif
//==============================================================================================================================
